[
  {
   "category_id": 1,
    "title": "সকাল ও সন্ধ্যা",
    "group": [
      {
        "group_id": 1,
        "title": "ঘুম থেকে উঠার সময়",
        "duas": [
          {
            "id": 1,
            "group_id": 1,
            "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
            "translation": "সকল প্রশংসা আল্লাহর, যিনি আমাদের মৃত্যুর পর পুনরায় জীবিত করেছেন এবং তাঁর কাছেই আমাদের প্রত্যাবর্তন।",
            "reference": "Al-Bukhârî [6312], see Fatĥ al-Bârî (11/113) and Muslim [2711](4/2083)."
          },
          {
            "id": 2,
            "group_id": 1,
            "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
            "translation": "আল্লাহ ছাড়া কোন উপাস্য নেই, তিনি একক, তাঁর কোন শরিক নেই, তাঁরই সার্বভৌমত্ব এবং সমস্ত প্রশংসা তাঁরই জন্য, এবং তিনি সর্ববিষয়ে সর্বশক্তিমান। আল্লাহ পবিত্র, আল্লাহর জন্য সমস্ত প্রশংসা। আল্লাহ ছাড়া কোন উপাস্য নেই। আল্লাহ সর্বশ্রেষ্ঠ। আল্লাহর ইচ্ছা ব্যতীত কোন ক্ষমতা ও শক্তি নেই। হে আমার রব, আমাকে ক্ষমা করুন। (যে কেউ এটি বলবে তাকে ক্ষমা করা হবে, এবং যদি সে আল্লাহর কাছে প্রার্থনা করে, তার প্রার্থনা মঞ্জুর হবে; যদি সে অজু করে এবং নামাজ পড়ে, তার নামাজ গ্রহণ করা হবে)।",
            "reference": "Al-Bukhârî [1154], see Fatĥ al-Bârî (3/39) and the wording is of Ibn Mâjah (2/335), also see Ŝaĥiĥ Ibn Mâjah (2/335). "
          },
          {
            "id": 3,
            "group_id": 1,
            "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
            "translation": "সকল প্রশংসা আল্লাহর, যিনি আমার দেহকে সুস্থ করেছেন, আমার আত্মাকে ফিরিয়ে দিয়েছেন এবং আমাকে তাঁকে স্মরণ করার অনুমতি দিয়েছেন।",
            "reference": "At-Tirmidhî [3401](5/473), also see Ŝaĥiĥ At-Tirmidhî (3/144)."
          },
          {
            "id": 4,
            "group_id": 1,
            "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
            "translation": "সূরা আলে ইমরান [৩:১৯০-২০০] তিলাওয়াত করুন।",
            "reference": "Al-Bukhârî [4572], see Fatĥ al-Bârî (8/237) and Muslim [763](1/530)."
          }
        ]
      },
      {
        "group_id": 27,
        "title": "সকাল ও সন্ধ্যায়",
        "duas": [
          {
            "id": 75,
            "group_id": 27,
            "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
            "translation": "যে কেউ সকালে Âyat al-Kursî (আয়াতুল কুরসী) পাঠ করে, তাকে জিনদের হাত থেকে রক্ষা করা হবে সন্ধ্যা পর্যন্ত, এবং সন্ধ্যায় এটি পাঠ করলে, তাকে রক্ষা করা হবে সকাল পর্যন্ত।",
            "reference": "Al-Hâkim (1/562) and Al-Albânî authenticated it in Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) and he attributed it to An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] and Ťabarânî [Al-Kabîr][541] and said that the latter's chain is good."
          },
          {
            "id": 76,
            "group_id": 27,
            "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
            "translation": "তিলাওয়াত করুন:1. সূরা ইখলাস (আল কুরআন: ১১২)2. সূরা আল-ফালাক (আল কুরআন: ১১৩)3. সূরা আন-নাস (আল কুরআন: ১১৪)[৩ বার]",
            "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Also see Ŝaĥîĥ At-Tirmidhî (3/182)."
          },
          {
            "id": 77,
            "group_id": 27,
            "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
            "translation": "'আমরা সকাল করেছি এবং এর সাথে সব রাজত্ব আল্লাহর। সমস্ত প্রশংসা আল্লাহর জন্য। আল্লাহ ছাড়া কোন উপাস্য নেই, তিনি একক, তাঁর কোন শরিক নেই। আল্লাহর সার্বভৌমত্ব এবং প্রশংসা তাঁরই জন্য, এবং তিনি সর্ববিষয়ে সর্বশক্তিমান। হে আমার রব, আমি তোমার কাছে এ দিনের কল্যাণ এবং এর পরে যা আসবে তার কল্যাণ চাইছি, এবং আমি তোমার কাছে এ দিনের মন্দ থেকে এবং এর পরে যা আসবে তার মন্দ থেকে আশ্রয় চাইছি। হে আমার রব, আমি তোমার কাছে অলসতা এবং বার্ধক্যের দুর্দশা থেকে আশ্রয় চাইছি। হে আমার রব, আমি তোমার কাছে আগুনের শাস্তি থেকে এবং কবরের শাস্তি থেকে আশ্রয় চাইছি।'রাতে, এর পরিবর্তে পাঠ করুন:'আমরা সন্ধ্যা করেছি এবং এর সাথে সমস্ত রাজত্ব আল্লাহর...'এবং:'...হে আমার রব, আমি তোমার কাছে এ রাতের এবং এর পরে যা আসবে তার কল্যাণ চাইছি...' ",
            "reference": "Muslim [2723](4/2088)."
          },
          {
            "id": 78,
            "group_id": 27,
            "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
            "translation": "'হে আল্লাহ, আপনারই ইচ্ছায় আমরা সকাল করেছি এবং আপনারই ইচ্ছায় আমরা সন্ধ্যা করেছি, আপনারই ইচ্ছায় আমরা বেঁচে আছি এবং মারা যাচ্ছি এবং আপনার কাছেই আমাদের পুনরুত্থান।'রাতে, এর পরিবর্তে পাঠ করুন:'হে আল্লাহ, আপনারই ইচ্ছায় আমরা সন্ধ্যা করেছি এবং আপনারই ইচ্ছায় আমরা সকাল করেছি, আপনারই ইচ্ছায় আমরা বেঁচে আছি এবং মারা যাচ্ছি এবং আপনার কাছেই আমাদের প্রত্যাবর্তন।'",
            "reference": "At-Tirmidhî [3391](5/466). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
          },
          {
            "id": 79,
            "group_id": 27,
            "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
            "translation": "হে আল্লাহ, আপনি আমার প্রভু, আপনার ছাড়া কোন উপাস্য নেই, আপনি আমাকে সৃষ্টি করেছেন এবং আমি আপনার দাস। আমি আপনার অঙ্গীকার এবং প্রতিশ্রুতি মেনে চলি যতটুকু পারি, আমি আপনার কাছে আশ্রয় প্রার্থনা করছি আমার কৃতকর্মের মন্দ থেকে। আমি আপনার দানকে স্বীকার করি এবং আমার পাপকে স্বীকার করছি, তাই আমাকে ক্ষমা করুন, নিশ্চয়ই আপনার ছাড়া কেউ পাপ ক্ষমা করতে পারে না।",
            "reference": "Al-Bukhârî [6306](7/150)."
          },
          {
             "id": 80,
             "group_id": 27,
             "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
             "translation": "হে আল্লাহ, নিঃসন্দেহে আমি এই সকালে আপনার সাক্ষ্য দিচ্ছি, আরশ বহনকারী ফেরেশতাদের, আপনার সব ফেরেশতা এবং আপনার সমস্ত সৃষ্টিকে সাক্ষ্য হিসেবে ডাকছি যে আপনি আল্লাহ, আপনার ছাড়া কোনো উপাস্য নেই, আপনি একক, আপনার কোনো শরিক নেই এবং মুহাম্মদ আপনার বান্দা ও রাসুল। [চার বার]",
             "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] and Ibn As-Sunnî [70]. Shaykh Ibn Bâz declared the chain of An-Nisâ'i and Abû Dâwud, Hasan in [Tuĥfat Al-Akhyâr][pg. 23]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [25]."
          },
          {
             "id": 81,
             "group_id": 27,
             "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
             "translation": "হে আল্লাহ, আজ সকালে আমার বা আপনার কোনো সৃষ্টির ওপর যে কোনো নেয়ামত এসেছে তা আপনারই, এককভাবে, আপনার কোনো শরিক নেই, অতএব সমস্ত প্রশংসা এবং কৃতজ্ঞতা আপনার জন্য।",
             "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Shaykh Ibn Bâz declared its chain Ĥasan in [Tuĥfat Al-Akhyâr][pg. 24]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [26]."
          },
          {
             "id": 82,
             "group_id": 27,
             "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصَرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
             "translation": "হে আল্লাহ, আমার শরীরকে সুস্থ রাখুন, হে আল্লাহ, আমার শ্রবণশক্তিকে সুস্থ রাখুন, হে আল্লাহ, আমার দৃষ্টিশক্তিকে সুস্থ রাখুন। আপনার ছাড়া কোন উপাস্য নেই। হে আল্লাহ, আমি আপনার কাছে কুফর ও দারিদ্র্য থেকে আশ্রয় প্রার্থনা করছি, এবং কবরের শাস্তি থেকে আশ্রয় প্রার্থনা করছি। [তিন বার]",
             "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 26]. Al-Albânî declared it weak. See Ďa'îf Al-J Al-Jâmi' [1210]."
          },
          {
             "id": 83,
             "group_id": 27,
             "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
             "translation": "আল্লাহ আমার জন্য যথেষ্ট, তিনি ছাড়া কোন উপাস্য নেই, আমি তাঁর উপর নির্ভর করি এবং তিনি মহান আরশের প্রভু। [সাত বার]",
             "reference": "Ibn As-Sunnî [71][Marfû'] and Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic. Also see Zâd al-Ma'âd (2/376). Al-Albânî declared it weak. See Ďa'îf Abî Dâwud."
          },
          {
             "id": 84,
             "group_id": 27,
             "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
             "translation": "হে আল্লাহ, আমি আপনার কাছে এই পৃথিবী এবং পরকালের জন্য ক্ষমা ও সুস্থতা প্রার্থনা করছি। হে আল্লাহ, আমি আপনার কাছে আমার ধর্মীয় এবং দুনিয়াবি জীবনে, আমার পরিবার এবং সম্পদের জন্য ক্ষমা ও সুস্থতা প্রার্থনা করছি। হে আল্লাহ, আমার দুর্বলতাগুলোকে ঢেকে দিন এবং আমার ভয়গুলিকে নিরসন করুন। হে আল্লাহ, আমাকে সামনের থেকে, পিছনের থেকে, ডান দিক থেকে, বাম দিক থেকে এবং উপর থেকে সংরক্ষণ করুন, এবং আমি আপনার মহিমায় আশ্রয় চাই যাতে আমি নিচ থেকে ধ্বংস না হই।",
             "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Also see Ŝaĥîĥ Ibn Mâjah (2/332)."
          },
          {
             "id": 85,
             "group_id": 27,
             "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
             "translation": "হে আল্লাহ, অদৃশ্য এবং দৃশ্যমানের জ্ঞানী, আকাশ এবং পৃথিবীর স্রষ্টা, সমস্ত কিছু এবং তার শাসকের প্রভু, আমি সাক্ষ্য দিচ্ছি যে আপনার ছাড়া কোন উপাস্য নেই। আমি আপনার কাছে আমার আত্মার মন্দ এবং শয়তানের মন্দ ও শিরক থেকে আশ্রয় প্রার্থনা করছি এবং আমি আমার উপর অন্যায় করা বা অন্য কোনো মুসলমানের উপর অন্যায় না করার জন্য আশ্রয় প্রার্থনা করছি।",
             "reference": "At-Tirmidhî [3392] and Abû Dâwud [5067]. Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
          },
          {
             "id": 86,
             "group_id": 27,
             "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
             "translation": "আল্লাহর নামে যার সাথে পৃথিবীতে বা আকাশে কিছুই ক্ষতি করতে পারে না এবং তিনি সর্বশ্রোতা ও সর্বজ্ঞ। [তিন বার]",
             "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Also see Ŝaĥîĥ Ibn Mâjah (2/332). Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 39]."
          },
          {
             "id": 87,
             "group_id": 27,
             "dua": "رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
             "translation": "আমি আল্লাহকে প্রভু হিসেবে, ইসলামকে ধর্ম হিসেবে এবং মুহাম্মদকে নবী হিসেবে গ্রহণ করেছি। [তিন বার]",
             "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) and At-Tirmidhî [3389](5/465). Shaykh Ibn Bâz declared it Ĥasan in [Tuĥfat Al-Akhyâr][39]."
          },
          {
             "id": 88,
             "group_id": 27,
             "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
             "translation": "হে চিরঞ্জীব, হে সকল কিছুর ধারক, আমি আপনার দয়া প্রার্থনা করছি, আমার সমস্ত ব্যাপারকে সংশোধন করুন এবং আমাকে এক চোখের পলকেও নিজের উপর নির্ভরশীল করবেন না।",
             "reference": "Al-Hâkim (1/545); he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
          },
          {
            "id": 89,
            "group_id": 27,
            "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
            "translation": "আমরা সকালকে পেয়েছি, সমস্ত রাজত্ব আল্লাহর, সকল জগতের প্রভুর। হে আল্লাহ, আমি আপনার কাছে আজকের দিনের কল্যাণ, বিজয়, আলো, বরকত এবং সঠিক পথ প্রার্থনা করছি এবং এর মধ্যে থাকা মন্দ এবং এর পরবর্তী মন্দ থেকে আপনার কাছে আশ্রয় চাইছি।আর যদি রাত আসে, তাহলে পড়বে: আমরা সন্ধ্যায় এসে পৌঁছেছি এবং সমস্ত রাজত্ব আল্লাহর, সমস্ত জগতের প্রভুর। হে আল্লাহ, আমি আপনার কাছে এই রাতের কল্যাণ, এর বিজয়, এর আলো, এর বরকত এবং এর সঠিক পথ প্রার্থনা করছি এবং এর মন্দ এবং এর পরবর্তী মন্দ থেকে আপনার আশ্রয় চাইছি।",
            "reference": "Abû Dâwud [5084](4/322), Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared its chain Ĥasan in their research of Zâd al-Ma'âd (2/273)."
          },
          {
            "id": 90,
            "group_id": 27,
            "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
            "translation": "আমরা ইসলামের উপর, খাঁটি বিশ্বাসের উপর, আমাদের নবী মুহাম্মদ ﷺ এর ধর্মের উপর, এবং আমাদের পিতা ইব্রাহীমের ধর্মের উপর সকালে পৌঁছেছি। তিনি সত্য ও খাঁটি মুসলিম ছিলেন এবং কখনও মুশরিক ছিলেন না।যদি সন্ধ্যা হয়, তাহলে পড়বে: আমরা ইসলামের উপর সন্ধ্যায় পৌঁছেছি।",
            "reference": "Aĥmad (3/406,407) and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Also see Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
          },
          {
            "id": 91,
            "group_id": 27,
            "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
            "translation": "আল্লাহ পবিত্র এবং আমি তার প্রশংসা করি। [একশো বার]",
            "reference": "Muslim [2723](4/2071)."
          },
          {
            "id": 92,
            "group_id": 27,
            "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
            "translation": "আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই, তাঁর সমস্ত রাজত্ব ও সমস্ত প্রশংসা এবং তিনি সব কিছুর উপর ক্ষমতাবান। [দশবার] অথবা [একবার]",
            "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] from the ĥadîth of Abu Ayûb Al-Anŝârî  (May Allah be pleased with him). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb [650](1/272) and Tuĥfat Al-Akhyâr (pg. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] and Aĥmad (4/60). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb (1/270), Ŝaĥîĥ Abî  Dâwud  (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) and Zâd Al-Ma'âd (2/377)."
          },
          {
            "id": 93,
            "group_id": 27,
            "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
            "translation": "আল্লাহ ছাড়া কোনো উপাস্য নেই, তিনি একক, তাঁর কোনো শরিক নেই, সমস্ত রাজত্ব তাঁর এবং সমস্ত প্রশংসা তাঁর জন্য, তিনি সব কিছুর উপর ক্ষমতাবান। [সকালবেলা একশোবার]",
            "reference": "Al-Bukhârî [3293](4/95) and Muslim [2691](4/2071)."
          },
          {
            "id": 94,
            "group_id": 27,
            "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
            "translation": "আল্লাহ পবিত্র এবং আমি তার প্রশংসা করি, তার সৃষ্টির সংখ্যা অনুযায়ী, তার সন্তুষ্টির অনুযায়ী, তার আরশের ওজন অনুযায়ী এবং তার শব্দের কালি অনুযায়ী। [সকালবেলা তিনবার]",
            "reference": "Muslim [2726](4/2090)."
          },
          {
            "id": 95,
            "group_id": 27,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
            "translation": "হে আল্লাহ, আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিজিক এবং কবুলকৃত আমল প্রার্থনা করছি। [সকালবেলা]",
            "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] and Ibn Mâjah [925]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic in their research of Zâd al-Ma'âd (2/375)."
          },
          {
            "id": 96,
            "group_id": 27,
            "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
            "translation": "আমি আল্লাহর কাছে ক্ষমা চাই এবং তাঁর দিকে ফিরে আসি। [প্রতিদিন একশোবার]",
            "reference": "Al-Bukhârî [6307](11/101) and Muslim [2702](4/2075)."
          },
          {
            "id": 97,
            "group_id": 27,
            "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
            "translation": "আমি আল্লাহর পূর্ণাঙ্গ বাক্যসমূহের মাধ্যমে সমস্ত মন্দ থেকে আশ্রয় প্রার্থনা করছি যা তিনি সৃষ্টি করেছেন। [সন্ধ্যাবেলা তিনবার]",
            "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Also see Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) and Tuĥfat Al-Akhyâr (p. 45)."
          },
          {
            "id": 98,
            "group_id": 27,
            "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
            "translation": "হে আল্লাহ, আমাদের নবী মুহাম্মদের উপর দরুদ ও সালাম বর্ষণ করুন। [দশবার]",
            "reference": "Ať-Ťabarânî through two chains, one of which is good. See Majm'u Az-Zawâ 'id (10/120) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
          }
        ]
      },
      {
        "group_id": 28,
        "title": "ঘুমানোর আগে",
        "duas": [
          {
            "id": 99,
            "group_id": 28,
            "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
            "translation": "প্রতিদিন রাতে ঘুমাতে যাওয়ার আগে, নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাঁর দুই হাতকে একত্র করতেন, তাতে হালকা ফুঁ দিতেন, কুরআনের শেষ তিনটি সূরা পাঠ করতেন এবং তারপরে তাঁর হাত দিয়ে নিজের শরীরের যতটুকু সম্ভব মুছতেন; তিনি এটি তিনবার করতেন।",
            "reference": "Al-Bukhârî [5017](9/62) এবং Muslim [2192](4/1723)।"
          },
          {
            "id": 100,
            "group_id": 28,
            "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
            "translation": "নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আরও বলেছেন: 'যখন তুমি ঘুমাতে যাবে, আয়াতুল কুরসি পড়বে, আল্লাহর পক্ষ থেকে তোমার উপর রক্ষা থাকবে এবং কোন শয়তান তোমার নিকট আসবে না সকাল পর্যন্ত।'",
            "reference": "Al-Bukhârî [2311](4/487)।"
          },
          {
            "id": 101,
            "group_id": 28,
            "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
            "translation": "নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) আরও বলেছেন: 'যে কেউ সূরা আল-বাকারা এর শেষ দুই আয়াত রাতে পাঠ করবে; এই দুই আয়াত তার জন্য যথেষ্ট হবে।'",
            "reference": "Al-Bukhârî [4008](9/94) এবং Muslim [808](1/554)।"
          },
          {
            "id": 102,
            "group_id": 28,
            "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
            "translation": "তোমাদের কেউ যখন তার বিছানা থেকে ওঠে এবং পুনরায় বিছানায় ফিরে আসে তখন তাকে তার পোশাকের প্রান্ত দিয়ে বিছানাকে তিনবার ঝেড়ে ফেলতে হবে, কারণ সে জানে না তার অনুপস্থিতিতে সেখানে কি ঘটেছে। এরপর সে শুয়ে পড়ে এই দোয়া পাঠ করবে: ‘হে আমার প্রভু, আপনার নামে আমি শুয়ে পড়ছি এবং আপনার নামেই আমি জেগে উঠব, তাই যদি আপনি আমার আত্মা নেন তবে তার প্রতি দয়া করুন, আর যদি ফেরত পাঠান তবে তাকে রক্ষা করুন যেভাবে আপনি আপনার নেক বান্দাদের রক্ষা করেন।’",
            "reference": "Al-Bukhârî [6320](11/126) এবং Muslim [2714](4/2084)।"
          },
          {
            "id": 103,
            "group_id": 28,
            "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
            "translation": "হে আল্লাহ, আপনি আমার আত্মাকে সৃষ্টি করেছেন এবং আপনি তার জীবন নেবেন, তার জীবন ও মৃত্যু আপনার হাতে। আপনি যদি আমার আত্মাকে জীবিত রাখেন তবে তাকে রক্ষা করুন, আর যদি তার মৃত্যু ঘটে তবে তাকে ক্ষমা করুন। হে আল্লাহ, আমি আপনার কাছে সুস্থতা প্রার্থনা করছি।",
            "reference": "Muslim [2712](4/2083) এবং Aĥmad (2/79)।"
          },
          {
            "id": 104,
            "group_id": 28,
            "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
            "translation": "হে আল্লাহ, আপনার দাসদের পুনরুত্থানের দিনে আমাকে আপনার শাস্তি থেকে রক্ষা করুন।",
            "reference": "Abû Dâwud [5045](4/311)। এছাড়াও Ŝaĥîĥ At-Tirmidhî (3/143) দেখুন।"
          },
          {
            "id": 105,
            "group_id": 28,
            "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
            "translation": "হে আল্লাহ, আপনার নামে আমি বাঁচি এবং মরি।",
            "reference": "Abû Dâwud [5045](4/311)। এছাড়াও Ŝaĥîĥ At-Tirmidhî (3/143) দেখুন।"
          },
          {
            "id": 106,
            "group_id": 28,
            "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
            "translation": "আল্লাহ পরিপূর্ণ (তেত্রিশ বার)।আল্লাহর জন্য সমস্ত প্রশংসা (তেত্রিশ বার)।আল্লাহ সর্বশ্রেষ্ঠ (চৌত্রিশ বার)।",
            "reference": "Al-Bukhârî [3705](7/71) এবং Muslim [2727](4/2091)।"
          },
          {
            "id": 107,
            "group_id": 28,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
            "translation": "হে আল্লাহ, আপনি সাত আসমানের প্রভু এবং মহান সিংহাসনের প্রভু। আমাদের প্রভু এবং সব কিছুর প্রভু। আপনি শস্য এবং বীজকে ভেঙে দেন, তাওরাত, ইঞ্জিল এবং কুরআন নাযিল করেছেন। আমি আপনার আশ্রয় প্রার্থনা করছি সেই সকল কিছুর মন্দ থেকে, যার নিয়ন্ত্রণ আপনি হাতে রেখেছেন। হে আল্লাহ, আপনি প্রথম এবং আপনার আগে কিছুই নেই, আপনি শেষ এবং আপনার পরে কিছুই নেই, আপনি প্রকাশিত এবং আপনার উপরে কিছুই নেই, আপনি লুকায়িত এবং আপনার নিচে কিছুই নেই। আমাদের ঋণ পরিশোধ করুন এবং আমাদের দরিদ্রতা থেকে মুক্তি দিন।",
            "reference": "Muslim [2713](4/2084)।"
          },
          {
            "id": 108,
            "group_id": 28,
            "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
            "translation": "সকল প্রশংসা আল্লাহর জন্য, যিনি আমাদের খাদ্য দিয়েছেন, পানি দিয়েছেন, আমাদের জন্য যথেষ্ট হয়েছেন এবং আমাদের আশ্রয় দিয়েছেন। আর কতজন আছে যাদের জন্য কেউ যথেষ্ট নয় বা আশ্রয় দেয় না।",
            "reference": "Muslim [2715](4/2085)।"
          },
          {
            "id": 109,
            "group_id": 28,
            "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
            "translation": "হে আল্লাহ, আপনি দৃশ্যমান ও অদৃশ্য জগতের জ্ঞানী, আসমান ও জমিনের স্রষ্টা, সব কিছুর প্রভু ও অধিপতি। আমি সাক্ষ্য দিচ্ছি যে আপনি ছাড়া আর কোন উপাস্য নেই। আমি আপনার কাছে আমার আত্মার মন্দ এবং শয়তানের মন্দ ও শিরক থেকে আশ্রয় প্রার্থনা করছি, এবং আমি যেন নিজের প্রতি বা অন্য কোন মুসলিমের প্রতি কোনো অন্যায় না করি।",
            "reference": "Abû Dâwud [5083](4/317)। এছাড়াও Ŝaĥîĥ At-Tirmidhî (3/142) দেখুন।"
          },
          {
            "id": 110,
            "group_id": 28,
            "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
            "translation": "সূরা আস-সাজদাহ এবং সূরা আল-মুলক পাঠ করুন।",
            "reference": "At-Tirmidhî [3404] এবং An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]। এছাড়াও Ŝaĥîĥ Al-Jâmi' [4873](4/255) দেখুন।"
          },
          {
            "id": 111,
            "group_id": 28,
            "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
            "translation": "হে আল্লাহ, আমি আমার আত্মাকে আপনার কাছে সমর্পণ করেছি, আমার সমস্ত বিষয় আপনার কাছে অর্পণ করেছি, আমার মুখমণ্ডল আপনার দিকে ফিরিয়েছি এবং আমি সম্পূর্ণরূপে আপনার উপর নির্ভর করছি, আপনার প্রতি আশা এবং ভয় নিয়ে। আপনার কাছ থেকে আশ্রয় বা মুক্তির কোন স্থান নেই, আপনি ছাড়া। আমি আপনার কিতাবে বিশ্বাস করি, যা আপনি অবতীর্ণ করেছেন এবং আপনার নবীর প্রতি যাকে আপনি প্রেরণ করেছেন।",
            "reference": "Al-Bukhârî [6313,6315,7488](11/113) এবং Muslim [2710](4/2081)।"
          }
  ]
},
      {
        "group_id": 29,
        "title": "রাতে ফিরে শোবার সময়",
        "duas": [
          {
            "id": 112,
            "group_id": 29,
            "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
            "translation": "আল্লাহ ছাড়া আর কোন উপাস্য নেই, তিনি এক ও অজেয়, আসমান ও জমিন এবং তাদের মধ্যে যা কিছু আছে সেগুলোর প্রভু, তিনি সম্মানিত ও ক্ষমাশীল।",
            "reference": "Al-Hâkim (1/540) এবং তিনি এটিকে সহীহ বলেছেন এবং Adh-Dhahabî তার সাথে একমত হয়েছেন, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] এবং Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757)। এছাড়াও Ŝaĥîĥ Al-Jâmi' [4693](4/213) দেখুন।"
          }
        ]
      },
      {
        "group_id": 30,
        "title": "ঘুমের সময় অস্থিরতা, ভয়, উদ্বেগ অনুভব করলে",
        "duas": [
          {
            "id": 113,
            "group_id": 30,
            "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
            "translation": "আমি আল্লাহর পূর্ণ শব্দের আশ্রয় প্রার্থনা করছি, তাঁর ক্রোধ ও শাস্তি থেকে, তাঁর দাসদের মন্দ কাজ থেকে, এবং শয়তানদের খারাপ আকাঙ্ক্ষা থেকে এবং তারা যাতে আমার নিকট উপস্থিত না হয়।",
            "reference": "Abû Dâwud [3893](4/12)। এছাড়াও Ŝaĥîĥ At-Tirmidhî (3/171) দেখুন।"
          }
        ]
      },
      {
        "group_id": 31,
        "title": "ভাল বা খারাপ স্বপ্ন দেখলে",
        "duas": [
          {
            "id": 114,
            "group_id": 31,
            "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
            "translation": "খারাপ স্বপ্ন দেখার পর কি করা উচিত তার সংক্ষিপ্ত বিবরণ:(১) আপনার বাম দিকে তিনবার থুথু ফেলুন।(২) তিনবার আল্লাহর কাছে শয়তান ও দেখা স্বপ্নের মন্দ থেকে আশ্রয় প্রার্থনা করুন।(৩) স্বপ্ন কারো সাথে শেয়ার করবেন না।(৪) আপনি যে পাশ দিয়ে শুয়েছিলেন তার উল্টো পাশে ঘুরে শুয়ে পড়ুন।",
            "reference": "Al-Bukhârî [7044] এবং Muslim [2261](4/1772)।"
          },
          {
            "id": 115,
            "group_id": 31,
            "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
            "translation": "ইচ্ছা হলে উঠে নামাজ আদায় করুন।",
            "reference": "Muslim [2263](4/1773)।"
          }
        ]
      }
       ]
},
  {
  "category_id": 2,
  "title": "নামাজ",
  "group": [
    {
      "group_id": 8,
      "title": "ওজু শুরু করার সময়",
      "duas": [
        {
          "id": 12,
          "group_id": 8,
          "dua": "بِسْمِ اللهِ",
          "translation": "আল্লাহর নামে।",
          "reference": "Abû Dâwud [101], Ibn Mâjah [399] এবং Aĥmad (2/418)। এছাড়াও Irwâ'-ul-Ghalîl (1/122) দেখুন।"
        }
      ]
    },
    {
      "group_id": 9,
      "title": "ওজু শেষ করার পর",
      "duas": [
        {
          "id": 13,
          "group_id": 9,
          "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
          "translation": "আমি সাক্ষ্য দিচ্ছি যে একমাত্র আল্লাহরই ইবাদত করার অধিকার আছে, তিনি এক ও অদ্বিতীয়, এবং আমি সাক্ষ্য দিচ্ছি যে মুহাম্মদ (ﷺ) তাঁর দাস ও রাসূল।",
          "reference": "Muslim [234](1/209)।"
        },
        {
          "id": 14,
          "group_id": 9,
          "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
          "translation": "হে আল্লাহ, আমাকে তাদের অন্তর্ভুক্ত করুন যারা আপনার কাছে তওবা করে এবং আমাকে তাদের অন্তর্ভুক্ত করুন যারা পবিত্র থাকে।",
          "reference": "At-Tirmidhî [55](1/78)। এছাড়াও Ŝaĥiĥ At-Tirmidhî (1/18) দেখুন।"
        },
        {
          "id": 15,
          "group_id": 9,
          "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
          "translation": "হে আল্লাহ, আপনি কতই না পূর্ণ! আমি আপনার প্রশংসা করি এবং সাক্ষ্য দিচ্ছি যে আপনি ছাড়া আর কোনো ইলাহ নেই। আমি আপনার কাছে ক্ষমা প্রার্থনা করছি এবং আপনার কাছে তওবা করছি।",
          "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)।"
        }
      ]
    },
    {
      "group_id": 12,
      "title": "মসজিদে যাওয়ার সময়",
      "duas": [
        {
          "id": 19,
          "group_id": 12,
          "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
          "translation": "হে আল্লাহ, আমার হৃদয়ে নূর দান করুন, আমার জিহ্বায় নূর, আমার কানে নূর, আমার দৃষ্টিতে নূর, আমার উপরে নূর, আমার নিচে নূর, আমার ডানপাশে নূর, আমার বামপাশে নূর, আমার সামনে নূর এবং আমার পেছনে নূর। আমার আত্মায় নূর দান করুন। আমার জন্য নূর বৃদ্ধি করুন এবং আমাকে নূরে ভরপুর করুন। হে আল্লাহ, আমাকে নূর দান করুন, আমার স্নায়ু, আমার মাংস, আমার রক্ত, আমার চুল, আমার ত্বকে নূর দান করুন।",
          "reference": "(1) Al-Bukhârî [6316](11/116) এবং Muslim [763](1/526,529,530)।(2) At-Tirmidhî [3419](5/483)।"
        }
      ]
    },
    {
      "group_id": 13,
      "title": "মসজিদে প্রবেশ করার সময়",
      "duas": [
        {
          "id": 20,
          "group_id": 13,
          "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
          "translation": "(ডান পা দিয়ে প্রবেশ করুন)(১), এবং বলুন: (আমি আল্লাহর মহিমার আশ্রয় চাই, তার মহান মুখ ও তার প্রাচীন শক্তি দ্বারা, শয়তানের অভিশাপ থেকে)।(২) (আল্লাহর নামে, এবং প্রার্থনা)। [রাসূলুল্লাহর উপর শান্তি বর্ষিত হোক]। (হে আল্লাহ, আমার জন্য আপনার রহমতের দরজা খুলে দিন)।(৫)",
          "reference": "(1) Al-Hakim (1/218) এবং তিনি এটিকে মুসলিমের শর্ত অনুযায়ী সহীহ বলেছেন এবং Adh-Dhahabî তার সাথে একমত হয়েছেন, Al-Baihaqî (2/442), এবং Al-Albânî এটি Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624) এ হাসান বলেছেন।(2) Abû Dâwud [466]। এছাড়াও Ŝaĥiĥ Al-Jâmi' [4591] দেখুন।(3) An-Nisâ'i [88] এবং Al-Albânî এটিকে হাসান বলেছেন।(4) Abû Dâwud [465](1/126)। এছাড়াও Ŝaĥîĥ Al-Jâmi' [514](1/528)।(5) Muslim [713](1/494), Ibn Mâjah [771] এবং Al-Albânî এটিকে Ŝaĥîĥ বলেছেন।"
        }
      ]
    },
    {
      "group_id": 14,
      "title": "মসজিদ থেকে বের হওয়ার সময়",
      "duas": [
        {
          "id": 21,
          "group_id": 14,
          "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢)",
          "translation": "(বাম পা দিয়ে বের হন)(১), এবং বলুন: (আল্লাহর নামে, এবং প্রার্থনা ও রাসূলুল্লাহর উপর শান্তি বর্ষিত হোক। হে আল্লাহ, আমি আপনার অনুগ্রহ চাই, হে আল্লাহ, আমাকে শয়তানের অভিশাপ থেকে রক্ষা করুন)।(২)",
          "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) এবং Al-Albânî এটিকে Ŝaĥîĥ বলেছেন।(2) পূর্ববর্তী দোয়ার তাখরিজ দেখুন (দোয়া #20)।"
        }
      ]
    },
    {
      "group_id": 15,
      "title": "আযানের সময়",
      "duas": [
        {
          "id": 22,
          "group_id": 15,
          "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
          "translation": "মুয়াজ্জিন যা বলে, আপনি তা পুনরাবৃত্তি করবেন, তবে “হাইয়া আলা সালাহ” এবং “হাইয়া আলা আল-ফালাহ” শুনলে বলুন: “আল্লাহ ছাড়া কেউ ক্ষমতা ও শক্তি দান করতে পারে না।”",
          "reference": "Al-Bukhârî [611](1/152) এবং Muslim [383](1/288)।"
        },
        {
          "id": 23,
          "group_id": 15,
          "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
          "translation": "মুয়াজ্জিনের তাশাহহুদ ঘোষণার পরে আপনি বলবেন: “আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি এক ও অদ্বিতীয়। এবং আমি সাক্ষ্য দিচ্ছি যে মুহাম্মদ (ﷺ) তার দাস ও রাসূল।”",
          "reference": "(1) Muslim [386](1/290)।(2) Ibn Khuzaîymah [422](1/220)।"
        },
        {
          "id": 24,
          "group_id": 15,
          "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
          "translation": "মুয়াজ্জিনের ডাকে সাড়া দেয়ার পরে, রাসূল (সা.)-এর উপর দরূদ পাঠ করবেন।",
          "reference": "Muslim [384](1/288)।"
        },
        {
          "id": 25,
          "group_id": 15,
          "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
          "translation": "বলুন: ‘হে আল্লাহ, এই পূর্ণ আহ্বানের মালিক এবং আসন্ন নামাজের মালিক, মুহাম্মদকে আল-ওয়াসিলা ও আল-ফাদিলা দান করুন, এবং তাকে সেই প্রশংসিত অবস্থানে পৌঁছে দিন যা আপনি তাকে প্রতিশ্রুতি দিয়েছেন। [নিশ্চয় আপনি প্রতিশ্রুতি ভঙ্গ করেন না।]’",
          "reference": "Al-Bukhârî [614](1/152) এবং ব্র্যাকেটের মধ্যে যা আছে তা Al-Baihaqî (1/410) থেকে।"
        },
        {
          "id": 26,
          "group_id": 15,
          "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
          "translation": "আযান ও ইকামার মধ্যবর্তী সময়ে নিজের জন্য দোয়া করবেন, কারণ এই সময়ে দোয়া প্রত্যাখ্যাত হয় না।",
          "reference": "At-Tirmidhî [212], Abû Dâwud [521] এবং Ahmad [3/119]। এছাড়াও Irwâ'-ul-Ghalîl (1/262) দেখুন।"
        }
      ]
    },
    {
      "group_id": 16,
      "title": "নামাজ শুরুর সময় (তাকবীরের পরে)",
      "duas": [
        {
          "id": 27,
          "group_id": 16,
          "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
          "translation": "হে আল্লাহ, আমার পাপ থেকে আমাকে দূরে রাখুন যেমন আপনি পূর্ব ও পশ্চিমের মধ্যে দূরত্ব সৃষ্টি করেছেন। হে আল্লাহ, আমাকে আমার পাপ থেকে পবিত্র করুন যেমন সাদা কাপড় ময়লা থেকে পবিত্র হয়। হে আল্লাহ, বরফ, পানি এবং শিশির দিয়ে আমার পাপগুলো ধুয়ে ফেলুন।",
          "reference": "Al-Bukhârî [744](1/181) এবং Muslim [598](1/419)।"
        },
        {
          "id": 28,
          "group_id": 16,
          "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
          "translation": "হে আল্লাহ, আপনি কতই না পবিত্র! আমি আপনার প্রশংসা করছি। আপনার নাম কতই না বরকতময়, এবং আপনার অবস্থান কতই না উচ্চ। আপনার ছাড়া আর কোনো ইলাহ নেই।",
          "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), এবং Ibn Mâjah [804, 806]। এছাড়াও Ŝaĥîĥ At-Tirmidhî (1/77) এবং Ŝaĥîĥ Ibn Mâjah (1/135) দেখুন।"
        },
        {
          "id": 29,
          "group_id": 16,
          "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
          "translation": "আমি আমার মুখ ফিরিয়ে নিলাম সেই দিকে যিনি আসমান ও জমিন সৃষ্টি করেছেন, এবং আমি মুশরিকদের অন্তর্ভুক্ত নই। আমার নামাজ, আমার ইবাদত, আমার জীবন এবং আমার মৃত্যু সবই আল্লাহর জন্য, যিনি সমস্ত জগতের প্রভু। তার কোনো অংশীদার নেই, এবং এটাই আমাকে আদেশ করা হয়েছে এবং আমি মুসলিমদের অন্তর্ভুক্ত। হে আল্লাহ, আপনি হলেন রাজা, আপনার ছাড়া আর কোনো উপাস্য নেই। আপনি আমার প্রভু, আর আমি আপনার দাস। আমি নিজেকে অবিচার করেছি এবং আমার পাপের কথা স্বীকার করছি। অতএব, আমার সমস্ত পাপ ক্ষমা করুন, কারণ শুধুমাত্র আপনি পাপ ক্ষমা করতে পারেন। আমাকে উত্তম চরিত্রে পরিচালিত করুন, কারণ শুধুমাত্র আপনি উত্তম চরিত্রে পরিচালনা করতে পারেন। আমাকে মন্দ চরিত্র থেকে দূরে রাখুন, কারণ শুধুমাত্র আপনি তা থেকে আমাকে রক্ষা করতে পারেন। হে আল্লাহ, আপনার সেবায় আমি উপস্থিত, সমস্ত কল্যাণ আপনার হাতে এবং মন্দ আপনার থেকে আসে না। আমি আপনার দাস, আপনার দিকে প্রত্যাবর্তিত। আপনি বরকতময় এবং উচ্চ মর্যাদাসম্পন্ন। আমি আপনার কাছে ক্ষমা চাই এবং আপনার দিকে ফিরে যাই।",
          "reference": "Muslim [771](1/534)।"
        },
        {
          "id": 30,
          "group_id": 16,
          "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
          "translation": "হে আল্লাহ, আপনি হলেন জিব্রাইল, মিকাইল এবং ইস্রাফিলের প্রভু, আসমান ও জমিনের স্রষ্টা, দৃশ্যমান এবং অদৃশ্য জগতের জ্ঞাত। আপনি আপনার বান্দাদের মধ্যে যেসব বিষয়ে মতভেদ হয়েছে, তাতে সিদ্ধান্ত গ্রহণ করেন। আমাকে সঠিক পথে পরিচালিত করুন আপনার ইচ্ছা অনুযায়ী, নিশ্চয় আপনি যাকে ইচ্ছা সরল পথে পরিচালিত করেন।",
          "reference": "Muslim [770](1/534)।"
        },
        {
          "id": 31,
          "group_id": 16,
          "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
          "translation": "আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়, আল্লাহ সবচেয়ে বড়। আল্লাহর জন্য অধিক প্রশংসা, আল্লাহর জন্য অধিক প্রশংসা, আল্লাহর জন্য অধিক প্রশংসা। এবং আমি সকাল-বিকাল আল্লাহর পবিত্রতা ঘোষণা করছি। (তিনবার) আমি আল্লাহর কাছে আশ্রয় চাই শয়তানের কুমন্ত্রণা, তার কবিতা এবং তার পাগলামি থেকে।",
          "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), এবং Muslim [601](1/420)।"
        },
        {
          "id": 32,
          "group_id": 16,
          "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ,",
          "translation": "হে আল্লাহ, সমস্ত প্রশংসা আপনার জন্য। আপনি হলেন আসমান ও জমিনের আলো এবং তাদের মধ্যে যা কিছু আছে। সমস্ত প্রশংসা আপনার জন্য, আপনি আসমান ও জমিনের প্রতিপালক এবং তাদের মধ্যে যা কিছু আছে। সমস্ত প্রশংসা আপনার জন্য, আপনি আসমান ও জমিনের রাজা এবং তাদের মধ্যে যা কিছু আছে। আপনি হলেন সত্য, আপনার প্রতিশ্রুতি সত্য, আপনার বাক্য সত্য, এবং আপনার সাথে সাক্ষাতের দিনও সত্য।",
          "reference": "Al-Bukhârî (3/3), (11/116), এবং [1120](13/371, 423, 465) এবং Muslim [769](1/532)।"
        }
  ]
},
    {
      "group_id": 17,
      "title": "নামাজের রুকুতে",
      "duas": [
        {
          "id": 33,
          "group_id": 17,
          "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا)",
          "translation": "আমার মহান প্রতিপালক পরম পবিত্র। (তিনবার)",
          "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) এবং Aĥmad (5/382, 394)৷ এছাড়াও Ŝaĥîĥ At-Tirmidhî (1/83)।"
        },
    {
      "id": 34,
      "group_id": 17,
      "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
      "translation": "হে আল্লাহ, আমাদের প্রভু, আপনি পবিত্র, এবং আপনার প্রশংসা করি। হে আল্লাহ, আমাকে ক্ষমা করুন।",
      "reference": "Al-Bukhârî [794](1/99) এবং Muslim [484](1/350)।"
    },
    {
      "id": 35,
      "group_id": 17,
      "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
      "translation": "আপনি মহাপবিত্র এবং মহাপুরাণ, ফেরেশতাদের এবং জিবরাইলের প্রভু।",
      "reference": "Muslim [487](1/353) এবং Abû Dâwud [872](1/230)।"
    },
    {
      "id": 36,
      "group_id": 17,
      "dua": "اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، خَشَعَ لَكَ سَمْعِي، وَبَصَرِي، وَمُخِّي، وَعَظْمِي، وَعَصَبِي، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
      "translation": "হে আল্লাহ, আমি আপনার জন্য রুকু করেছি, এবং আপনার প্রতি বিশ্বাস স্থাপন করেছি, এবং আপনার জন্য আত্মসমর্পণ করেছি। আমার কান, চোখ, মস্তিষ্ক, হাড় এবং স্নায়ু আপনার সামনে বিনয় প্রকাশ করেছে।",
      "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] এবং An-Nisâ'i [2/130]। এই দোয়ার সম্প্রসারণটি ইবন হিবান এবং Ŝaĥîĥ Ibn Ĥibân [1901] এবং Ŝaĥîĥ Ibn Khuzaîmah [607] থেকে নেওয়া।"
    },
    {
      "id": 37,
      "group_id": 17,
      "dua": "سُبْحَانَ ذِي الْجَبَروتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ.",
      "translation": "মহাপ্রভুত্ব, পরম সাম্রাজ্য, মহত্ত্ব এবং মহিমার অধিকারী পবিত্র।",
      "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) এবং Aĥmad (6/24)।"
    }
  ]
},
    {
      "group_id": 18,
      "title": "রুকু থেকে উঠে দাঁড়ানোর সময়",
      "duas": [
        {
          "id": 38,
          "group_id": 18,
          "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
          "translation": "আল্লাহ তার প্রশংসাকারীর কথা শোনেন।",
          "reference": "Al-Bukhârî [795](2/282)।"
        },
        {
          "id": 39,
          "group_id": 18,
          "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
          "translation": "হে আমাদের প্রভু, সমস্ত প্রশংসা আপনার জন্য, একাধিক, সুন্দর এবং বরকতময় প্রশংসা।",
          "reference": "Al-Bukhârî [799](2/284)।"
        },
        {
          "id": 40,
          "group_id": 18,
          "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
          "translation": "আসমান এবং জমিন এবং তাদের মধ্যকার যা কিছু আছে তা আপনার প্রশংসায় পূর্ণ, এবং যা আপনি এর পরে যা ইচ্ছা তা পূর্ণ। আপনি প্রশংসা এবং মহিমার প্রাপ্য। যা কিছু আপনার বান্দারা বলে তা ঠিক, এবং আমরা সবাই আপনার বান্দা। হে আল্লাহ, আপনি যা দিয়েছেন তা কেউ আটকাতে পারে না, এবং আপনি যা আটকিয়েছেন তা কেউ দিতে পারে না, এবং কারও ধন-সম্পদ বা সম্মান আপনার নিকট কোন উপকারে আসবে না।",
          "reference": "Muslim [477](1/346)।"
        }
      ]
    },
    {
      "group_id": 19,
      "title": "নামাজে সিজদার সময়",
      "duas": [
        {
          "id": 41,
          "group_id": 19,
          "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
          "translation": "আমার পরম প্রতিপালক সর্বোচ্চ পবিত্র। (তিনবার)",
          "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] এবং Aĥmad (5/382, 394)। Ŝaĥîĥ At-Tirmidhî (1/83)।"
        },
        {
          "id": 42,
          "group_id": 19,
          "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
          "translation": "হে আল্লাহ, আমাদের প্রভু, আপনি পবিত্র এবং আপনার প্রশংসা করি। হে আল্লাহ, আমাকে ক্ষমা করুন।",
          "reference": "Al-Bukhârî [794](1/99) এবং Muslim [484](1/350)।"
        },
    {
      "id": 43,
      "group_id": 19,
      "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
      "translation": "আপনি মহাপবিত্র এবং মহাপুরাণ, ফেরেশতাদের এবং জিবরাইলের প্রভু।",
      "reference": "Muslim (1/533)।"
    },
    {
      "id": 44,
      "group_id": 19,
      "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
      "translation": "হে আল্লাহ, আপনার জন্য আমি সিজদা করেছি, এবং আপনার প্রতি বিশ্বাস স্থাপন করেছি, এবং আপনার জন্য আত্মসমর্পণ করেছি। আমার মুখ সেই সত্তার জন্য সিজদা করেছে, যিনি এটি সৃষ্টি করেছেন এবং এর শ্রবণ ও দর্শন সৃষ্টি করেছেন। পবিত্র আল্লাহ, সৃষ্টির মধ্যে সর্বোত্তম।",
      "reference": "Muslim [771](1/534)।"
    },
    {
      "id": 45,
      "group_id": 19,
      "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ.",
      "translation": "মহাপ্রভুত্ব, পরম সাম্রাজ্য, মহত্ত্ব এবং মহিমার অধিকারী পবিত্র।",
      "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), এবং An-Nisâ'i (2/191)। Al-Albânî এটিকে Ŝaĥîĥ Abî Dâwud (1/166) এ প্রমাণিত করেছেন।"
    },
    {
      "id": 46,
      "group_id": 19,
      "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
      "translation": "হে আল্লাহ, আমার সকল পাপ ক্ষমা করুন, ছোট এবং বড়, প্রথম এবং শেষ, গোপন এবং প্রকাশ্য।",
      "reference": "Muslim [483](1/350)।"
    },
    {
      "id": 47,
      "group_id": 19,
      "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
      "translation": "হে আল্লাহ, আমি আপনার সন্তুষ্টি দ্বারা আপনার অসন্তুষ্টি থেকে আশ্রয় চাই, আপনার ক্ষমা দ্বারা আপনার শাস্তি থেকে আশ্রয় চাই, এবং আপনার থেকে আপনার কাছে আশ্রয় চাই। আমি আপনার প্রশংসা গণনা করতে পারি না, আপনি যেমন নিজেকে প্রশংসা করেছেন তেমনই আপনি।",
      "reference": "Muslim [486](1/352)।"
    }
  ]
},
    {
      "group_id": 20,
      "title": "দুই সিজদার মধ্যে",
      "duas": [
        {
          "id": 48,
          "group_id": 20,
          "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
          "translation": "আমার প্রতিপালক, আমাকে ক্ষমা করুন, আমার প্রতিপালক, আমাকে ক্ষমা করুন।",
          "reference": "Abû Dâwud [874](1/231)। এছাড়াও Ŝaĥîĥ Ibn Mâjah (1/148)।"
        },
        {
          "id": 49,
          "group_id": 20,
          "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
          "translation": "হে আল্লাহ, আমাকে ক্ষমা করুন, আমার প্রতি দয়া করুন, আমাকে সঠিক পথে পরিচালিত করুন, আমাকে শক্তি দিন, আমাকে সুস্থতা দিন, আমাকে রিজিক দিন এবং আমাকে উচ্চতায় উন্নীত করুন।",
          "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]। এছাড়াও Ŝaĥîĥ At-Tirmidhî (1/90) এবং Ŝaĥîĥ Ibn Mâjah (1/148)।"
        }
      ]
    },
    {
      "group_id": 21,
      "title": "কুরআন তিলাওয়াতের জন্য সিজদাহ করার সময়",
      "duas": [
        {
          "id": 50,
          "group_id": 21,
          "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
          "translation": "আমার মুখ সেই সত্তার কাছে সিজদা করেছে, যিনি এটি সৃষ্টি করেছেন এবং তাঁর শক্তি ও ক্ষমতা দ্বারা এর শ্রবণ ও দৃষ্টিশক্তি সৃষ্টি করেছেন। (সুতরাং, পবিত্র তিনি, সৃষ্টিকর্তাদের মধ্যে সর্বোত্তম আল্লাহ।)",
          "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) এবং Al-Hâkim এটিকে প্রমাণিত ঘোষণা করেছেন এবং Adh-Dhahabî তার সাথে একমত হয়েছেন (1/220)। বর্ধিতাংশ Ŝûrah Al-Mu'minûn থেকে।"
        },
        {
          "id": 51,
          "group_id": 21,
          "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
          "translation": "হে আল্লাহ, আমাকে এর জন্য আপনার নিকটে পুরস্কার দিন, আমার থেকে এর দ্বারা পাপ দূর করুন, এটিকে আমার জন্য সংরক্ষণ করুন এবং এটিকে আমার কাছ থেকে গ্রহণ করুন যেমন আপনি আপনার বান্দা দাউদের কাছ থেকে গ্রহণ করেছিলেন।",
          "reference": "At-Tirmidhî [579](2/473) এবং Al-Hâkim এটিকে Ŝaĥîĥ ঘোষণা করেছেন এবং Adh-Dhahabî তার সাথে একমত হয়েছেন (1/219)।"
        }
      ]
    },
    {
      "group_id": 22,
      "title": "তাশাহ্হুদ",
      "duas": [
        {
          "id": 52,
          "group_id": 22,
          "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
          "translation": "সমস্ত প্রশংসা আল্লাহর জন্য। সমস্ত উপাসনা এবং পবিত্র কাজ তাঁর জন্য। হে নবী, আপনার উপর শান্তি, আল্লাহর দয়া এবং তাঁর বরকত বর্ষিত হোক। আমাদের উপর এবং আল্লাহর সমস্ত নেক বান্দার উপর শান্তি বর্ষিত হোক। আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া আর কোন উপাস্য নেই এবং মুহাম্মদ আল্লাহর বান্দা এবং রাসূল।",
          "reference": "Al-Bukhârî [831](2/311) এবং Muslim [402](1/301)।"
        }
      ]
    },
    {
      "group_id": 23,
      "title": "তাশাহুদ-এর পর নবী (সা.) এর ওপর দোয়া",
      "duas": [
        {
          "id": 53,
          "group_id": 23,
          "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
          "translation": "হে আল্লাহ, আপনি যেভাবে ইবরাহিম এবং ইবরাহিমের পরিবারের ওপর রহমত ও দোয়া পাঠিয়েছেন, ঠিক সেভাবেই মুহাম্মদ এবং মুহাম্মদের পরিবারের ওপর রহমত ও দোয়া পাঠান। নিশ্চয়ই আপনি সর্ব প্রশংসার যোগ্য এবং মহিমান্বিত। হে আল্লাহ, আপনি যেভাবে ইবরাহিম এবং ইবরাহিমের পরিবারের ওপর বরকত দিয়েছেন, ঠিক সেভাবেই মুহাম্মদ এবং মুহাম্মদের পরিবারের ওপর বরকত দান করুন। নিশ্চয়ই আপনি সর্ব প্রশংসার যোগ্য এবং মহিমান্বিত।",
          "reference": "Al-Bukhârî [337](6/408)."
        },
        {
          "id": 54,
          "group_id": 23,
          "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
          "translation": "হে আল্লাহ, মুহাম্মদ এবং তার স্ত্রী ও সন্তানদের ওপর রহমত ও দোয়া পাঠান যেমন আপনি ইবরাহিমের পরিবারের ওপর পাঠিয়েছেন, এবং মুহাম্মদ, তার স্ত্রী ও সন্তানদের ওপর বরকত দান করুন, যেমন আপনি ইবরাহিমের পরিবারের ওপর বরকত দিয়েছেন। নিশ্চয়ই আপনি সর্ব প্রশংসার যোগ্য এবং মহিমান্বিত।",
          "reference": "Al-Bukhârî [3369](2/407) and Muslim [407](1/306)."
        }
      ]
    },
    {
      "group_id": 24,
      "title": "শেষ তাশাহুদ এবং সালামের পূর্বে",
      "duas": [
        {
          "id": 55,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই কবরের শাস্তি থেকে, জাহান্নামের শাস্তি থেকে, জীবন ও মৃত্যুর ফিতনা থেকে এবং মসীহ আদ-দজ্জালের বিপদ থেকে।",
          "reference": "Al-Bukhârî 2/102 and Muslim 1/412."
        },
        {
          "id": 56,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই কবরের শাস্তি থেকে, এবং ফিতনা থেকে যা মসীহ আদ-দজ্জালের দ্বারা সংঘটিত হবে, এবং জীবন ও মৃত্যুর ফিতনা থেকে। হে আল্লাহ, আমি পাপ এবং ঋণ থেকে আশ্রয় চাই।",
          "reference": "Al-Bukhârî [832](2/102) and Muslim [589](1/412) and the wording is the latter's."
        },
        {
          "id": 57,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "হে আল্লাহ, আমি আমার নফসের ওপর বহু অত্যাচার করেছি এবং আপনি ছাড়া কেউ পাপ ক্ষমা করতে পারেন না, তাই আমাকে আপনার পক্ষ থেকে ক্ষমা করুন এবং আমার প্রতি দয়া করুন। নিশ্চয়ই আপনি ক্ষমাশীল এবং পরম দয়ালু।",
          "reference": "Al-Bukhârî [7387](8/168) and Muslim [2705](4/2078)."
        },
        {
          "id": 58,
          "group_id": 24,
          "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
          "translation": "হে আল্লাহ, আপনি আমাকে আমার অতীত এবং ভবিষ্যতের পাপগুলো ক্ষমা করুন, যা আমি প্রকাশ্যে এবং গোপনে করেছি, যা আমি অতিক্রম করেছি এবং যা সম্পর্কে আপনি আমার চেয়েও ভাল জানেন। আপনি অগ্রদাতা এবং আপনি বিলম্বকারী। আপনি ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Muslim [771](1/534)."
        },
        {
          "id": 59,
          "group_id": 24,
          "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
          "translation": "হে আল্লাহ, আমাকে আপনার স্মরণ করতে, আপনাকে ধন্যবাদ জানাতে এবং আপনার সেরা উপায়ে ইবাদত করতে সাহায্য করুন।",
          "reference": "Abû Dâwud [1522](2/86) and An-Nisâ'i (3/53). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/284)."
        },
        {
          "id": 60,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
          "translation": "হে আল্লাহ, আমি কৃপণতা এবং ভীরুতা থেকে আপনার কাছে আশ্রয় চাই, এবং আমি আপনার কাছে আশ্রয় চাই যেন আমাকে আমার জীবনের সবচেয়ে নিকৃষ্ট অবস্থায় ফিরিয়ে দেওয়া না হয়। আমি আপনার কাছে আশ্রয় চাই দুনিয়ার ফিতনা থেকে এবং কবরের শাস্তি থেকে।",
          "reference": "Al-Bukhârî [2822](6/35)."
        },
        {
          "id": 61,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে জান্নাত প্রার্থনা করছি এবং আমি জাহান্নামের শাস্তি থেকে আশ্রয় চাই।",
          "reference": "Abû Dâwud [792] and Ibn Mâjah, see Ŝaĥîĥ Ibn Mâjah (2/328)."
        },
        {
          "id": 62,
          "group_id": 24,
          "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
          "translation": "হে আল্লাহ, আপনার অদৃশ্য জ্ঞানের দ্বারা এবং আপনার সৃষ্টির ক্ষমতার দ্বারা, আমাকে তখন পর্যন্ত জীবিত রাখুন যখন আপনি জানেন যে আমার জীবনের জন্য তা উত্তম এবং যখন আপনি জানেন যে মৃত্যু আমার জন্য উত্তম, তখন আমাকে মৃত্যু দান করুন। হে আল্লাহ, আমি আপনার কাছে ভয় প্রার্থনা করছি, তা গোপনে হোক বা প্রকাশ্যে। আমি আপনার কাছে প্রার্থনা করছি সত্য কথা বলার জন্য, তা আনন্দে হোক বা ক্রোধে। আমি আপনার কাছে দোয়া করছি ধন-দৌলত এবং দারিদ্র্যে মধ্যপন্থী থাকার জন্য। আমি আপনার কাছে এমন এক নেয়ামত প্রার্থনা করছি যা কখনো শেষ হবে না এবং এমন আনন্দ যা কখনো ম্লান হবে না। আমি আপনার কাছে প্রার্থনা করছি আপনার সিদ্ধান্তের প্রতি সন্তুষ্টি থাকার জন্য এবং মৃত্যুর পর সহজ জীবনযাপনের জন্য। আমি আপনার কাছে প্রার্থনা করছি আপনার মুখাবয়বের দিকে চেয়ে থাকার মধুর অনুভূতির জন্য এবং এমন এক আকাঙ্ক্ষার জন্য যা আমাকে বিপদ বা গুমরাহি ছাড়াই আপনার সাথে সাক্ষাতের দিকে নিয়ে যাবে। হে আল্লাহ, আমাদেরকে ঈমানের শোভা দিয়ে সাজান এবং আমাদেরকে হেদায়েতপ্রাপ্তদের মধ্যে রাখুন।",
          "reference": "An-Nisâ'i (4/54, 55) and Aĥmad (4/364). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/281)."
        },
        {
          "id": 63,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে প্রার্থনা করছি, হে আল্লাহ, আপনি এক এবং অদ্বিতীয়, আপনি না কাউকে জন্ম দিয়েছেন না আপনাকে জন্ম দেওয়া হয়েছে, এবং আপনার সমতুল্য কেউ নেই। আপনি আমাকে আমার পাপ ক্ষমা করুন। নিশ্চয়ই আপনি ক্ষমাশীল এবং পরম দয়ালু।",
          "reference": "An-Nisâ'i (3/52) and Aĥmad (4/238). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/280)."
        },
        {
          "id": 64,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে প্রার্থনা করছি, আপনি সকল প্রশংসার যোগ্য, আপনি ছাড়া আর কোনো উপাস্য নেই, আপনি এক এবং অদ্বিতীয়, আপনার কোনো শরিক নেই। আপনি সমস্ত আকাশ ও পৃথিবীর সৃষ্টিকর্তা, মহিমান্বিত এবং সম্মানিত। হে চিরঞ্জীব, হে নিজ ক্ষমতায় টিকে থাকা এবং অন্যদের সাহায্যকারী, আমি আপনার কাছে জান্নাত প্রার্থনা করছি এবং আমি জাহান্নামের শাস্তি থেকে আশ্রয় চাই।",
          "reference": "Abû Dâwud [1495], An-Nisâ'i (3/52), Ibn Mâjah [3858] and At-Tirmidhî [3544]. Also see Ŝaĥîĥ Ibn Mâjah (2/329)."
        },
        {
          "id": 65,
          "group_id": 24,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে প্রার্থনা করছি, আমি সাক্ষ্য দিচ্ছি যে আপনি আল্লাহ, আপনি ছাড়া আর কোনো উপাস্য নেই, আপনি এক এবং অদ্বিতীয়, আপনি কাউকে জন্ম দেননি, আপনাকেও জন্ম দেওয়া হয়নি এবং আপনার কোনো সমতুল্য কেউ নেই।",
          "reference": "Abû Dâwud [1493](2/62), At-Tirmidhî [3475](5/515), Ibn Mâjah [3857](2/1267) and Aĥmad (5/360). Also see Ŝaĥîĥ Ibn Mâjah (2/329) and Ŝaĥîĥ At-Tirmidhî (3/163)."
        }
      ]
    },
    {
      "group_id": 25,
      "title": "সালামের পরে",
      "duas": [
        {
          "id": 66,
          "group_id": 25,
          "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
          "translation": "(১) আমি আল্লাহর কাছে ক্ষমা প্রার্থনা করছি (তিনবার)(২) হে আল্লাহ, আপনি শান্তির উৎস, এবং আপনার থেকেই সকল শান্তি আসে। আপনি বরকতময়, হে মহিমা ও সম্মানের অধিকারী।",
          "reference": "Muslim [591](1/414)."
        },
        {
          "id": 67,
          "group_id": 25,
          "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
          "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি এক এবং অদ্বিতীয়। তার কোনো শরিক নেই। সমস্ত সাম্রাজ্য এবং প্রশংসা তারই, এবং তিনি সমস্ত কিছুর উপর সর্বশক্তিমান। হে আল্লাহ, আপনি যা দান করেছেন তা কেউ আটকাতে পারে না, এবং আপনি যা আটকে রেখেছেন তা কেউ দিতে পারে না। কোনো সম্পদ বা সম্মান আপনাকে পরাস্ত করতে পারে না, কেননা সব সম্পদ ও সম্মান আপনার কাছ থেকেই আসে।",
          "reference": "Al-Bukhârî [844](1/255) and Muslim [593](1/414)."
        },
        {
          "id": 68,
          "group_id": 25,
          "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
          "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি এক এবং অদ্বিতীয়। তার কোনো শরিক নেই। সমস্ত সাম্রাজ্য এবং প্রশংসা তারই, এবং তিনি সমস্ত কিছুর উপর সর্বশক্তিমান। আল্লাহ ছাড়া আর কোনো শক্তি বা ক্ষমতা নেই। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, এবং আমরা কেবল তারই ইবাদত করি। তারই অনুগ্রহ এবং তারই প্রশংসা। আল্লাহ ছাড়া আর কোনো উপাস্য নেই এবং আমরা তার প্রতি একনিষ্ঠ দাসত্ব স্বীকার করছি, যদিও অবিশ্বাসীরা এটি অপছন্দ করে।",
          "reference": "Muslim [594](1/415)."
        },
        {
          "id": 69,
          "group_id": 25,
          "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
          "translation": "(১) আল্লাহ পবিত্র, সমস্ত প্রশংসা আল্লাহর জন্য, আল্লাহ মহান (ত্রিশ-ত্রিশ বার)(২) আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি এক এবং অদ্বিতীয়। তার কোনো শরিক নেই। সমস্ত সাম্রাজ্য এবং প্রশংসা তারই, এবং তিনি সমস্ত কিছুর উপর সর্বশক্তিমান।",
          "reference": "Muslim [597](1/418)."
        },
        {
          "id": 70,
          "group_id": 25,
          "dua": "(١) (قُلْ هُوَ اللَّهُ أَحَدٌ...)(٢) (قٌلْ أَعُوْذُ بِرَبَّ الْفَلَقِ...)(٣) (قُلْ أَعُوْذُ بِرَبَّ النَّاسِ...)",
          "translation": "নিম্নলিখিত তিনটি সূরা দুপুর, আসর এবং ইশার নামাযের পর একবার এবং ফজর ও মাগরিবের নামাযের পর তিনবার পাঠ করতে হবে:(১) আল-ইখলাস(২) আল-ফালাক(৩) আন-নাস",
          "reference": "Abû Dâwud [1523](2/86) and An-Nisâ'i (3/68). Also see Ŝaĥîĥ At-Tirmidhî (2/8)."
        },
        {
          "id": 71,
          "group_id": 25,
          "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
          "translation": "সালাতের পর আয়াতুল কুরসি পাঠ করাও সুন্নাহ:[আল-বাকারাহ: ২৫৫]",
          "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) and Ibn Sinnî [121]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [6464](5/339) and Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [972](2/697)."
        },
        {
          "id": 72,
          "group_id": 25,
          "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
          "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি এক এবং অদ্বিতীয়। তার কোনো শরিক নেই। সমস্ত সাম্রাজ্য এবং প্রশংসা তারই, তিনি জীবন দান করেন এবং মৃত্যু ঘটান, এবং তিনি সমস্ত কিছুর উপর সর্বশক্তিমান। (মাগরিব এবং ফজরের নামাযের পর দশবার পাঠ করতে হবে)",
          "reference": "At-Tirmidhî [3474]5/515 and Aĥmad (4/227). Also see Zâd Al-Ma'âd (1/300)."
        },
        {
          "id": 73,
          "group_id": 25,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
          "translation": "হে আল্লাহ, আমি আপনার কাছে উপকারী জ্ঞান, পবিত্র রিজিক এবং গ্রহণযোগ্য আমল প্রার্থনা করছি (ফজরের সালাম দেওয়ার পরে)।",
          "reference": "Ibn Mâjah [925]. Also see Ŝaĥîĥ Ibn Mâjah (1/152) and Majmu' Az-Zawâ'id [95](10/111)."
        }
  ]
},
    {
          "group_id": 32,
          "title": "কুনুত আল-উইত্র",
          "duas": [
            {
              "id": 116,
              "group_id": 32,
              "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
              "translation": "হে আল্লাহ, আপনি আমাকে তাদের মধ্যে পথ দেখান যাদের আপনি পথ দেখিয়েছেন, তাদের মধ্যে আমাকে সুস্থ রাখুন যাদের আপনি সুস্থ করেছেন, এবং যাদের আপনি সাহায্য করেছেন তাদের সঙ্গে আমাকে সাহায্য করুন। আপনি যা দিয়েছেন তাতে আমাকে বরকত দিন এবং আমাকে আপনার আদেশের মন্দ থেকে রক্ষা করুন, কারণ আপনি যা আদেশ দেন তা পূর্ণ হয় এবং কেউ তা রদ করতে পারে না। যাকে আপনি সাহায্য করেন সে কখনো অপমানিত হয় না, এবং যাকে আপনি শত্রু হিসেবে নেন সে কখনো সম্মানিত হতে পারে না। হে আমাদের রব, আপনি পবিত্র ও সর্বশক্তিমান।",
              "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). What is between the brackets is from Al-Baihaqî. Also see Ŝaĥîĥ At-Tirmidhî (1/144), Ŝaĥîĥ Ibn Mâjah (1/194), and Irwâ'-ul-Ghalîl (2/172)."
            },
        {
          "id": 117,
          "group_id": 32,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
          "translation": "হে আল্লাহ, আমি আপনার অসন্তুষ্টি থেকে আপনার সন্তুষ্টির আশ্রয় প্রার্থনা করছি এবং আপনার শাস্তি থেকে আপনার ক্ষমার আশ্রয় প্রার্থনা করছি, এবং আমি আপনার কাছেই আপনার আশ্রয় প্রার্থনা করছি। আমি আপনার প্রশংসা করতে অক্ষম। আপনি যেমন নিজের প্রশংসা করেছেন, আপনি তেমনই।",
          "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], and Aĥmad (1/96,118,150). Also see Ŝaĥîĥ At-Tirmidhî (3/180), Ŝaĥîĥ Ibn Mâjah (1/194) and Irwâ'-ul-Ghalîl (2/175)."
        },
        {
          "id": 118,
          "group_id": 32,
          "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
          "translation": "হে আল্লাহ, আমরা আপনার ইবাদত করি, আপনার উদ্দেশ্যে সালাত ও সেজদা করি এবং আপনার দিকে দ্রুত পদক্ষেপ করি ও ছুটে আসি। আমরা আপনার রহমতের আশা করি এবং আপনার শাস্তির ভয় করি। নিঃসন্দেহে আপনার শাস্তি কাফেরদের জন্য অবধারিত। হে আল্লাহ, আমরা আপনার সাহায্য প্রার্থনা করি এবং আপনার কাছে ক্ষমা চাই। আমরা আপনার প্রশংসা করি এবং আপনার অস্বীকার করি না। আমরা আপনার প্রতি বিশ্বাস স্থাপন করি, আপনার কাছে আত্মসমর্পণ করি এবং যারা আপনার সাথে কুফরি করে তাদের থেকে আমরা নিজেকে মুক্ত করি।",
          "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) এবং তিনি এর চেইনকে Ŝaĥîĥ হিসাবে ঘোষণা করেছেন। আল-আলবানী [Irwâ'-ul-Ghalîl](2/170) এ বলেছেন যে এর চেইন Ŝaĥîĥ এবং যে বর্ণনাটি মাওকূফ 'উমার (রাদিয়াল্লাহু ‘আনহু) এর মাধ্যমে এসেছে।"
        }
  ]
},
    {
      "group_id": 33,
      "title": "উইত্র সালামের ঠিক পরেই",
      "duas": [
        {
          "id": 119,
          "group_id": 33,
          "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
          "translation": "পবিত্রতা অর্জনকারী রাজা, মহাপবিত্র সত্তা (তিনবার বলা হতো, এবং তৃতীয়বার উচ্চ কণ্ঠে বলে: [ফেরেশতাদের ও রূহের প্রভু]).",
          "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) এবং বন্ধনীর মধ্যে সংযোজন তার থেকেই এসেছে এবং এর চেইনটি Ŝaĥîĥ। আরো দেখুন: Zâd al-Ma'âd (1/337)।"
        }
      ]
    },
    {
      "group_id": 42,
      "title": "নামাজ বা কোরআন তেলাওয়াতে কুচিন্তা আসলে পড়া উচিত",
      "duas": [
        {
          "id": 138,
          "group_id": 42,
          "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
          "translation": "আমি আল্লাহর কাছে আশ্রয় চাই শয়তান, অভিশপ্ত থেকে, এবং (শুকনো) থুথু ফেলুন আপনার বাম পাশে তিনবার।",
          "reference": "Muslim [2203](4/1729)."
        }
      ]
    }
    ]
  },
  {
  "category_id": 3,
  "title": "আল্লাহর প্রশংসা",
  "group": [
    {
      "group_id": 26,
      "title": "সঠিক সিদ্ধান্ত গ্রহণের জন্য দোয়া",
      "duas": [
        {
          "id": 74,
          "group_id": 26,
          "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
          "translation": "জাবির ইবনে আবদুল্লাহ (রাঃ) থেকে বর্ণিত, তিনি বলেন: ‘রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আমাদের সব কাজে ইস্তিখারার দোয়া শিখাতেন যেভাবে তিনি আমাদের কুরআনের একটি সূরা শিখাতেন। তিনি (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলতেন, 'যদি তোমাদের মধ্যে কেউ কোনো বিষয়ে সিদ্ধান্ত নিতে চায়, তবে সে যেন দু’রাকাত নফল নামাজ আদায় করে এবং এরপর এই দোয়াটি পড়ে: ‘হে আল্লাহ! আমি তোমার জ্ঞানের মাধ্যমে পরামর্শ চাই, তোমার ক্ষমতার মাধ্যমে শক্তি চাই এবং তোমার মহান অনুগ্রহ থেকে প্রার্থনা করি, নিশ্চয়ই তুমি সক্ষম আর আমি অক্ষম, আর তুমি জানো, আমি জানি না, তুমি অদৃশ্য বিষয়গুলোর সর্বজ্ঞ। হে আল্লাহ! যদি তুমি জানো যে এই কাজটি – এবং এখানে সে তার প্রয়োজনের কথা উল্লেখ করবে – আমার জন্য কল্যাণকর, আমার দ্বীনের জন্য, আমার জীবনের জন্য এবং আমার শেষ পরিণতির জন্য, তবে তা আমার জন্য নির্ধারণ করো এবং তা সহজ করে দাও এবং তাতে বরকত দাও। আর যদি তুমি জানো যে এই কাজটি আমার জন্য ক্ষতিকারক, আমার দ্বীনের জন্য, আমার জীবনের জন্য এবং আমার শেষ পরিণতির জন্য, তবে তা আমার থেকে সরিয়ে দাও এবং আমাকে তার থেকে সরিয়ে দাও। এবং তুমি যেখানেই কল্যাণ নির্ধারণ করো, আমাকে তা প্রদান করো এবং আমাকে এতে সন্তুষ্ট করো।'(١)যে ব্যক্তি তার সৃষ্টিকর্তার কাছ থেকে পরামর্শ নেয় এবং বিশ্বাসীদের সঙ্গে পরামর্শ করে এবং তার সিদ্ধান্তে অটল থাকে, সে কখনোই অনুতপ্ত হয় না, কারণ আল্লাহ বলেছেন: {…আর তাদের সঙ্গে পরামর্শ করো বিষয়গুলোতে। তারপর যখন তুমি সিদ্ধান্ত নেবে, আল্লাহর ওপর ভরসা করো…}(٢)",
          "reference": "(1) Al-Bukhârî [1162](7/162).(2) Qur'an Al-'Imran [3:159]."
        }
      ]
    },
    {
      "group_id": 43,
      "title": "যার কাজে কঠিনতা এসেছে তার জন্য দোয়া",
      "duas": [
        {
          "id": 139,
          "group_id": 43,
          "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
          "translation": "হে আল্লাহ! তুমি যে বিষয়কে সহজ করো সেটাই সহজ, আর তুমি ইচ্ছা করলে কঠিনতাকেও সহজ করে দাও।",
          "reference": "Ibn Ĥibbân in his Ŝaĥîĥ [2427], Mawârid and Ibn As-Sunnî [351]. And Ibn Ĥajar said: \"This ĥadîth is Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť also declared it Ŝaĥîĥ in his takrîj of Imam Nawawî 's Athkâr (pg. 106)."
        }
      ]
    },
    {
      "group_id": 44,
      "title": "পাপ করার পরের দোয়া",
      "duas": [
        {
          "id": 140,
          "group_id": 44,
          "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
          "translation": "কোনো বান্দা যদি কোনো পাপ করে এবং তারপর সুন্দরভাবে ওজু করে, তারপর দু’রাকাত নামাজ আদায় করে এবং আল্লাহর কাছে ক্ষমা প্রার্থনা করে, তাহলে আল্লাহ তাকে ক্ষমা করে দেন।",
          "reference": "Abû Dâwud [1521](2/86) and At-Tirmidhî [406,3006](2/257). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 46,
      "title": "কোনো বিপদগ্রস্ত বা সমস্যার সম্মুখীন হলে",
      "duas": [
        {
          "id": 144,
          "group_id": 46,
          "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
          "translation": "আল্লাহর সিদ্ধান্ত, আর তিনি যা চান তা করেন।",
          "reference": "Muslim [2664](4/2052)."
        }
      ]
    },
    {
      "group_id": 88,
      "title": "দাজ্জালের থেকে রক্ষা পাওয়ার দোয়া",
      "duas": [
        {
          "id": 199,
          "group_id": 88,
          "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
          "translation": "যে ব্যক্তি সূরা কাহফের প্রথম দশ আয়াত মুখস্থ করবে, সে দাজ্জালের ফিতনা থেকে সুরক্ষিত থাকবে।",
          "reference": "Muslim [809](1/555)."
        }
      ]
    },
    {
      "group_id": 107,
      "title": "রাসূল (সা.) এর উপর দরূদ পাঠানোর ফজিলত",
      "duas": [
        {
          "id": 219,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'যে আমার উপর একবার দরূদ পাঠায়, আল্লাহ তার উপর দশবার রহমত বর্ষণ করেন।'",
          "reference": "Muslim [408](1/288)."
        },
        {
          "id": 220,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'আমার কবরকে উৎসবের স্থান বানিও না। আমার উপর দরূদ পাঠাও, নিশ্চয়ই তোমাদের দরূদ যেখানেই থাকো আমার কাছে পৌঁছে।'",
          "reference": "Abû Dâwud [2042](2/218) and Aĥmad (2/367). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/383)."
        },
        {
          "id": 221,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : 'সে কৃপণ, যার কাছে আমার নাম উচ্চারিত হয় কিন্তু সে আমার উপর দরূদ পাঠায় না।'",
          "reference": "At-Tirmidhî [3546](5/551). Also see Ŝaĥîĥ Al-Jâmi' [2787](3/25) and Ŝaĥîĥ At-Tirmidhî (3/177)."
        },
        {
          "id": 222,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'নিশ্চয়ই আল্লাহর ফেরেশতারা পৃথিবীতে ঘুরে বেড়ায় এবং আমার উম্মতের সালাম আমার কাছে পৌঁছে দেয়।'",
          "reference": "An-Nisâ'i (3/43) and Al-Hâkim (2/421). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/274)."
        },
        {
          "id": 223,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'যখনই কেউ আমাকে সালাম দেয়, আল্লাহ আমার আত্মাকে ফিরিয়ে দেন যাতে আমি সালামের জবাব দিতে পারি।'",
          "reference": "Abû Dâwud (2041). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 129,
      "title": "ক্ষমা প্রার্থনা এবং তওবা",
      "duas": [
        {
          "id": 248,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : 'আল্লাহর শপথ, আমি প্রতিদিন আল্লাহর কাছে ক্ষমা প্রার্থনা করি এবং তওবা করি, দিনে সত্তরেরও বেশি বার।'",
          "reference": "Al-Bukhârî [6307](11/101)."
        },
        {
          "id": 249,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : ‘হে মানুষ! আল্লাহর কাছে তওবা করো, নিশ্চয়ই আমি দিনে একশত বার তওবা করি।'",
          "reference": "Muslim [2702](4/2076)."
        },
        {
          "id": 250,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
          "translation": "যে ব্যক্তি বলে: ‘আমি মহান আল্লাহর কাছে ক্ষমা প্রার্থনা করি, যিনি ছাড়া আর কোনো মাবুদ নেই, তিনি চিরঞ্জীব ও চিরস্থায়ী, এবং আমি তাঁর দিকে ফিরে আসি (তওবা করি)’— আল্লাহ তাকে ক্ষমা করবেন, এমনকি যদি সে যুদ্ধক্ষেত্র থেকে পালিয়ে থাকে।'",
          "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511)  and he authenticated it and Adh-Dhahabî agreed with him. Al-Albânî authenticated it, see Ŝaĥîĥ At-Tirmidhî (3/182) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/389-390) with research by Arnâ'ûť."
        },
        {
          "id": 251,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : ‘আল্লাহ বান্দার সবচেয়ে কাছাকাছি থাকেন রাতের শেষ প্রহরে। যদি তোমার পক্ষে সম্ভব হয় সেই সময়ে আল্লাহকে স্মরণকারীদের অন্তর্ভুক্ত হওয়া, তবে তুমি তা করো।’",
          "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), and Al-Hâkim. Also see Ŝaĥîĥ At-Tirmidhî (3/183) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/144) with research by Arnâ'ûť."
        },
        {
          "id": 252,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন : ‘বান্দা তার প্রভুর সবচেয়ে কাছাকাছি অবস্থান করে যখন সে সিজদায় থাকে, তাই সিজদায় বেশি বেশি দোয়া করো।’",
          "reference": "Muslim [482](1/350)."
        },
        {
          "id": 253,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: ‘নিশ্চয়ই আমার অন্তরে মেঘাচ্ছন্নতা আসে, এবং নিশ্চয়ই আমি দিনে একশত বার আল্লাহর কাছে ক্ষমা প্রার্থনা করি।’",
          "reference": "Muslim [2702](4/2075). Also see Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/386)."
        }
      ]
    },
    {
      "group_id": 130,
      "title": "আল্লাহকে স্মরণ ও প্রশংসা করার ফজিলত",
      "duas": [
        {
          "id": 254,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
          "translation": "আল্লাহ কত নিখুঁত এবং আমি তাঁকে প্রশংসা করি। (প্রতিদিন একশোবার)",
          "reference": "Al-Bukhârî [6405](7/168) and Muslim [2691](4/2071)."
        },
        {
          "id": 255,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
          "translation": "আল্লাহ ছাড়া কেউ ইবাদত করার অধিকার রাখে না, তিনি একক, কোনো অংশীদার ছাড়া। তাঁরই সমস্ত সার্বভৌমত্ব এবং প্রশংসা, এবং তিনি সব কিছুর প্রতি সামর্থ্যশালী। (দশবার)",
          "reference": "Al-Bukhârî (7/67) and Muslim (4/2017)."
        },
        {
          "id": 256,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيمِ»",
          "translation": "আল্লাহর রসূল (সাল্লা আল্লাহু আলাইহি ওয়া সাল্লাম) বলেছেন: 'দুটি কথা (বাক্য) রয়েছে, যা জিহ্বায় হালকা, নেসাবের মাপে ভারী এবং দয়ালুর কাছে প্রিয়: 'আল্লাহ কত নিখুঁত এবং আমি তাঁকে প্রশংসা করি।' (এবং) 'আল্লাহ কত নিখুঁত, মহিমান্বিত।'",
          "reference": "Al-Bukhârî [3462](7/168) and Muslim [2694](4/2072)."
        },
        {
          "id": 257,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'সুবহানাল্লাহ, আলহামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ এবং আল্লাহু আকবর বলা আমার কাছে সূর্য যেসব জিনিসের ওপর উদিত হয়েছে তার চেয়ে অধিক প্রিয়।'",
          "reference": "Muslim [2695](4/2072)."
        },
        {
          "id": 258,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'তোমাদের মধ্যে কেউ প্রতিদিন এক হাজার নেকি অর্জন করতে অপারগ হবে কেন?' একজন সাহাবি প্রশ্ন করলেন: ‘কিভাবে আমরা এক হাজার নেকি অর্জন করতে পারি?’ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন: 'যদি কেউ একশত বার তাসবীহ পড়ে, তবে তার জন্য এক হাজার নেকি লেখা হয়, অথবা এক হাজার গুনাহ মাফ করা হয়।'",
          "reference": "Muslim [2698](4/2073)."
        },
        {
          "id": 259,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
          "translation": "যে ব্যক্তি বলে: 'আল্লাহ কত নিখুঁত, মহিমান্বিত, এবং আমি তাঁকে প্রশংসা করি', তার জন্য জান্নাতে একটি তাল গাছ রোপণ করা হয়।",
          "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [6429](5/531) and Ŝaĥîĥ At-Tirmidhî (3/160)."
        },
        {
          "id": 260,
          "group_id": 130,
          "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'হে আব্দুল্লাহ ইবনে কায়েস! আমি কি তোমাকে জান্নাতের খেজানাগুলোর একটি সম্পর্কে জানাবো না?' আমি বললাম: ‘হ্যাঁ, হে আল্লাহর রাসূল।’ তিনি বললেন: 'লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ বলো।'",
          "reference": "Al-Bukhârî [4205](11/213) and Muslim [2704](4/2076)."
        },
        {
          "id": 261,
          "group_id": 130,
          "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
          "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেন: 'আল্লাহর কাছে চারটি কথা সবচেয়ে প্রিয়: সুবহানাল্লাহ, আলহামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ, এবং আল্লাহু আকবর। তুমি যেকোনো একটির মাধ্যমে শুরু করো, তাতে কোনো সমস্যা নেই।'",
          "reference": "Muslim [2137](3/1685)."
        },
        {
          "id": 262,
          "group_id": 130,
          "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
          "translation": "একজন বেদুঈন রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-এর কাছে এসে বলল: 'আমাকে কিছু শেখাও যা আমি বলতে পারি।' রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন: 'লা ইলাহা ইল্লাল্লাহু ওয়াহদাহু লা শারিকা লাহু, আল্লাহু আকবার কাবীরা, আলহামদুলিল্লাহি কাথীরা, সুবহানাল্লাহি রাব্বিল আলামীন, লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহিল আজিজিল হাকীম।' বেদুঈন বলল: ‘এগুলো তো আমার প্রভুর জন্য, আমার জন্য কী আছে?’ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেন: 'তুমি বলো: আল্লাহুম্মা ইঘফিরলি, ওয়ারহামনি, ওয়াহদিনি, ওয়ারযুকনি।'",
          "reference": "Muslim [2696](4/2072)."
        },
        {
          "id": 263,
          "group_id": 130,
          "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
          "translation": "যখন কোনো ব্যক্তি ইসলাম গ্রহণ করত, রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) তাকে সালাত শেখাতেন এবং তাকে এই কথাগুলো পড়তে বলতেন: 'আল্লাহুম্মা ইঘফিরলি, ওয়ারহামনি, ওয়াহদিনি, ওয়া আফিনি, ওয়ারযুকনি।'",
          "reference": "Muslim [2697](4/2073)."
        },
        {
          "id": 264,
          "group_id": 130,
          "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
          "translation": "নিশ্চয়ই সর্বোত্তম দোয়া হল: আলহামদুলিল্লাহ, এবং সর্বোত্তম জিকির হল: লা ইলাহা ইল্লাল্লাহ।",
          "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), and Al-Hâkim (1/503) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [1104](1/362)."
        },
        {
          "id": 265,
          "group_id": 130,
          "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
          "translation": "সবচেয়ে স্থায়ী ও কল্যাণকর আমল হলো: সুবহানাল্লাহ, আলহামদুলিল্লাহ, লা ইলাহা ইল্লাল্লাহ, আল্লাহু আকবর এবং লা হাওলা ওয়ালা কুওয়াতা ইল্লা বিল্লাহ।",
          "reference": "Aĥmad [513](3/75) according to the order of Aĥmad Shâkir and its chain is authentic. Also see Majma' Az-Zawâ'id (1/297)."
        }
      ]
    },
    {
      "group_id": 131,
      "title": "রাসূল (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) তাসবীহ কিভাবে পাঠ করতেন",
      "duas": [
        {
          "id": 266,
          "group_id": 131,
          "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
          "translation": "'আব্দুল্লাহ ইবনে আমর (রাঃ) বলেছেন: আমি রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে তার ডান হাত দিয়ে তাসবীহ গণনা করতে দেখেছি।'",
          "reference": "Abû Dâwud [1502](2/81) and At-Tirmidhî [3486](5/521). Also see Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
        }
      ]
    }
  ]
},
  {
    "category_id": 4,
    "title": "হজ্জ ও ওমরাহ",
    "group": [
      {
        "group_id": 115,
        "title": "হজ বা ওমরাহ পালনকারীর জন্য তালবিয়া",
        "duas": [
          {
            "id": 233,
            "group_id": 115,
            "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
            "translation": "আমি হাজির, হে আল্লাহ! আমি হাজির, আমি হাজির, আপনার কোনো শরিক নেই, আমি হাজির। নিশ্চয়ই সকল প্রশংসা, অনুগ্রহ এবং রাজত্ব আপনার, আপনার কোনো শরিক নেই।",
            "reference": "Al-Bukhârî [1549](3/408) and Muslim [1184](2/841)."
          }
        ]
      },
      {
        "group_id": 116,
        "title": "কালো পাথর স্পর্শ করার সময় তাকবীর",
        "duas": [
          {
            "id": 234,
            "group_id": 116,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "আল্লাহ মহান।",
            "reference": "Al-Bukhârî [1612](1/476)."
          }
        ]
      },
      {
        "group_id": 117,
        "title": "ইয়ামেনি কোণ এবং কালো পাথরের মধ্যবর্তী স্থানে",
        "duas": [
          {
            "id": 235,
            "group_id": 117,
            "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
            "translation": "হে আমাদের প্রতিপালক! আমাদেরকে দুনিয়ায় কল্যাণ দান করুন এবং আখিরাতে কল্যাণ দান করুন এবং আমাদেরকে আগুনের শাস্তি থেকে রক্ষা করুন।",
            "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) and Al-Baghawî in Sharĥ As-Sunnah (7/128). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/354).(2) Sûrah Al-Baqarah: 201."
          }
        ]
      },
      {
        "group_id": 118,
        "title": "সাফা ও মারওয়াহ পাহাড়ে অবস্থানকালে",
        "duas": [
          {
            "id": 236,
            "group_id": 118,
            "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
            "translation": "নিশ্চয়ই সাফা ও মারওয়াহ আল্লাহর ইবাদতের স্থানসমূহের অন্তর্ভুক্ত…আল্লাহ ছাড়া আর কোনো উপাস্য নেই, আল্লাহ মহান। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি একক, তার কোনো শরিক নেই। সকল রাজত্ব এবং প্রশংসা তাঁর, এবং তিনি সর্বশক্তিমান। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি একক। তিনি তাঁর প্রতিশ্রুতি পূরণ করেছেন, তাঁর বান্দাকে সাহায্য করেছেন এবং একাই শত্রুদের পরাজিত করেছেন।",
            "reference": "Muslim [1218](2/888)."
          }
        ]
      },
      {
        "group_id": 119,
        "title": "আরাফাহ দিবসে",
        "duas": [
          {
            "id": 237,
            "group_id": 119,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি একক, তার কোনো শরিক নেই। সকল রাজত্ব এবং প্রশংসা তাঁর, এবং তিনি সর্বশক্তিমান।",
            "reference": "At-Tirmidhî [3585]. Al-Albânî authenticated it in Ŝaĥîĥ At-Tirmidhî (3/184) and Al-Aĥâdîth Aŝ-Ŝaĥîĥah (4/6)."
          }
        ]
      },
      {
        "group_id": 120,
        "title": "মুযদালিফায় অবস্থানকালে",
        "duas": [
          {
            "id": 238,
            "group_id": 120,
            "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
            "translation": "রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) আল-কাসওয়া নামক উটে আরোহণ করলেন এবং মাশ'আর আল-হারাম পৌঁছালেন। তিনি কিবলার দিকে মুখ করে আল্লাহর কাছে দোয়া করলেন, আল্লাহর মহত্ত্ব ও একত্ব ঘোষণা করলেন এবং দাঁড়িয়ে রইলেন যতক্ষণ না সূর্য উদয় হওয়ার আগে তিনি সেখান থেকে চলে গেলেন।",
            "reference": "Muslim [1218](2/891)."
          }
        ]
      },
      {
        "group_id": 121,
        "title": "জমরাতে পাথর নিক্ষেপকালে",
        "duas": [
          {
            "id": 239,
            "group_id": 121,
            "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
            "translation": "প্রত্যেক পাথর নিক্ষেপের সময় তিনি তাকবীর বলতেন, তারপর প্রথম এবং দ্বিতীয় জমরাতে পাথর নিক্ষেপের পর কিবলার দিকে মুখ করে দাঁড়িয়ে দোয়া করতেন এবং তার হাত উঠাতেন। তবে জমরাত আল-আকাবাতে নিক্ষেপের সময় তিনি তাকবীর বলতেন এবং আর দাঁড়াতেন না।",
            "reference": "Al-Bukhârî [1752, 1753](3/583-584) and see his wording there, Al-Bukhârî [1750](3/581) and Muslim [1296]."
          }
        ]
      },
      {
        "group_id": 127,
        "title": "যবাই বা কুরবানির সময়",
        "duas": [
          {
            "id": 246,
            "group_id": 127,
            "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
            "translation": "আল্লাহর নামে, এবং আল্লাহ মহান। হে আল্লাহ, (এটি) আপনার কাছ থেকে এবং আপনার জন্য, হে আল্লাহ, এটি আমার পক্ষ থেকে কবুল করুন।",
            "reference": "Muslim [1966](3/1557) and Baihaqî (9/287). What is between the brackets is from Baihaqî and others."
          }
        ]
      }
  ]
},
  {
    "category_id": 5,
    "title": "ভ্রমণ",
    "group": [
      {
        "group_id": 95,
        "title": "যানবাহনে আরোহনের সময়",
        "duas": [
          {
            "id": 206,
            "group_id": 95,
            "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
            "translation": "আল্লাহর নামে, এবং সকল প্রশংসা আল্লাহর জন্য। মহিমান্বিত তিনি, যিনি আমাদের জন্য এই যানটি আমাদের খেদমতে দিয়েছেন, যদিও আমরা নিজেরা এর সামর্থ্য রাখতাম না, এবং আমাদের শেষ পরিণতি আমাদের প্রভুর দিকে। সকল প্রশংসা আল্লাহর জন্য, আল্লাহ মহান। হে আল্লাহ, আমি অবশ্যই নিজের প্রতি অন্যায় করেছি, তাই তুমি আমাকে ক্ষমা করো, কারণ তোমার ছাড়া কেউ গুনাহ মাফ করতে পারে না।",
            "reference": "Abû Dâwud [2602](3/34) and At-Tirmidhî [3446](5/510). Also see Ŝaĥîĥ At-Tirmidhî (3/156)."
          }
        ]
      },
      {
        "group_id": 96,
        "title": "ভ্রমণের জন্য",
        "duas": [
          {
            "id": 207,
            "group_id": 96,
            "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
            "translation": "(১) আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান, মহিমান্বিত তিনি, যিনি আমাদের এই বাহন দিয়েছেন, যদিও আমরা তা সামলানোর সামর্থ্য রাখতাম না, এবং আমাদের পরিণতি আমাদের প্রভুর দিকে। হে আল্লাহ, আমরা তোমার নিকট এই ভ্রমণে নেক কাজ এবং তাকওয়া চাই, এবং আমরা এমন কাজ চাই যা তোমাকে সন্তুষ্ট করে। হে আল্লাহ, আমাদের ভ্রমণকে সহজ করে দাও এবং এর দূরত্বকে আমাদের জন্য সংক্ষিপ্ত করে দাও। হে আল্লাহ, তুমি ভ্রমণের সঙ্গী এবং পরিবারে আমাদের জন্য উত্তরাধিকারী। হে আল্লাহ, আমি তোমার কাছে আশ্রয় চাই ভ্রমণের কঠিনতা থেকে, দুঃখজনক দৃশ্য থেকে এবং সম্পদ ও পরিবারের খারাপ পরিস্থিতি থেকে।ফিরে আসার সময় একই দোয়া পড়া হয়, এবং এতে এই অংশটি যুক্ত করা হয়:(২) 'আমরা ফিরছি, তওবা করছি, ইবাদত করছি এবং আমাদের প্রভুর প্রশংসা করছি।'",
            "reference": "Muslim [1342](2/998)."
          }
        ]
      },
      {
        "group_id": 97,
        "title": "কোনো শহর বা গ্রামে প্রবেশের সময়",
        "duas": [
          {
            "id": 208,
            "group_id": 97,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
            "translation": "হে আল্লাহ, সাত আকাশের প্রভু এবং সবকিছু যা তারা ঢেকে রাখে, সাত জমিনের প্রভু এবং যা কিছু তারা বহন করে, শয়তানদের প্রভু এবং যাদের তারা পথভ্রষ্ট করে, বাতাসের প্রভু এবং যাদের তারা বহন করে। আমি তোমার কাছে এই গ্রামের কল্যাণ, এর অধিবাসীদের কল্যাণ এবং এর মধ্যে থাকা সব কিছুর কল্যাণ প্রার্থনা করি এবং আমি তোমার কাছে আশ্রয় চাই এই গ্রামের মন্দ থেকে, এর অধিবাসীদের মন্দ থেকে এবং এর মধ্যে থাকা সব মন্দ থেকে।",
            "reference": "Al-Hâkim (2/100) and he authenticated it and Adh-Dhahabî agreed with him, Ibn As-Sunnî [524], Al-Hâfiž declared it Ĥasan in Takrîj Al-Athkâr (5/154). Shaykh Ibn Bâz said that it has been narrated by An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548] with a Ĥasan chain. Also see Tuĥfat Al-Akhyâr (pg. 37)."
          }
        ]
      },
      {
        "group_id": 98,
        "title": "বাজারে প্রবেশের সময়",
        "duas": [
          {
            "id": 209,
            "group_id": 98,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি একক, তার কোনো শরিক নেই। সকল রাজত্ব এবং প্রশংসা তাঁর, তিনিই জীবন দেন এবং মৃত্যু দেন, এবং তিনি চিরঞ্জীব, তিনি কখনো মারা যান না। তাঁর হাতে সব কল্যাণ রয়েছে এবং তিনি সবকিছুর উপর ক্ষমতাশালী।",
            "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) and Ibn Mâjah [2235]. Al-Albânî classed it as Ĥasan in Ŝaĥîĥ Ibn Mâjah (2/21) and Ŝaĥîĥ At-Tirmidhî (3/152)."
          }
        ]
      },
      {
        "group_id": 99,
        "title": "যানবাহন হোঁচট খেলে",
        "duas": [
          {
            "id": 210,
            "group_id": 99,
            "dua": "بِسْمِ اللهِ",
            "translation": "আল্লাহর নামে।",
            "reference": "Abû Dâwud [4982](4/296). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/941)."
          }
        ]
      },
      {
        "group_id": 100,
        "title": "ভ্রমণকারীর জন্য বাসিন্দার দোয়া",
        "duas": [
          {
            "id": 211,
            "group_id": 100,
            "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
            "translation": "আমি তোমাদেরকে আল্লাহর আমানতে রাখছি, যার আমানত কখনোই ক্ষয়প্রাপ্ত হয় না।",
            "reference": "Aĥmad (2/403) and Ibn Mâjah [2825](2/943). Also see Ŝaĥîĥ Ibn Mâjah (2/133)."
          }
        ]
      },
      {
        "group_id": 101,
        "title": "বাসিন্দার জন্য ভ্রমণকারীর দোয়া",
        "duas": [
          {
            "id": 212,
            "group_id": 101,
            "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
            "translation": "আমি তোমার দ্বীন, তোমার আমানত এবং তোমার কাজের পরিণতি আল্লাহর আমানতে রাখছি।",
            "reference": "Aĥmad (2/7) and At-Tirmidhî [3443](5/499). Also see Ŝaĥîĥ At-Tirmidhî (2/155)."
          },
          {
            "id": 213,
            "group_id": 101,
            "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
            "translation": "আল্লাহ তোমাকে তাকওয়ার মাধ্যমে সমৃদ্ধ করুন, তোমার গুনাহ ক্ষমা করুন এবং তুমি যেখানেই থাকো আল্লাহ তোমার জন্য কল্যাণের পথ সহজ করে দিন।",
            "reference": "At-Tirmidhî [3444]. Also see Ŝaĥîĥ At-Tirmidhî (3/155)."
          }
        ]
      },
      {
        "group_id": 102,
        "title": "উঁচুতে উঠা বা নিচে নামার সময় দোয়া",
        "duas": [
          {
            "id": 214,
            "group_id": 102,
            "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
            "translation": "উঁচুতে উঠার সময় দোয়া (১) 'আল্লাহ মহান', এবং নিচে নামার সময় দোয়া (২) 'আল্লাহ পবিত্র'।",
            "reference": "Al-Bukhârî [2993](6/135)."
          }
        ]
      },
      {
        "group_id": 103,
        "title": "ফজরের আগে ভ্রমণকারীর দোয়া",
        "duas": [
          {
            "id": 215,
            "group_id": 103,
            "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
            "translation": "কেউ শুনুক আমাদের আল্লাহর প্রশংসা এবং তার বদান্যতার সাক্ষ্য হিসেবে। হে আমাদের প্রভু, আমাদের রক্ষা করো, আমাদের উপর অনুগ্রহ করো এবং আমাদের সব অনিষ্ট থেকে মুক্তি দাও। আমি আগুন থেকে আল্লাহর কাছে আশ্রয় চাই।",
            "reference": "Muslim [2718](4/2086)."
          }
        ]
      },
      {
        "group_id": 104,
        "title": "কোথাও থামা বা অবস্থান করার সময় দোয়া",
        "duas": [
          {
            "id": 216,
            "group_id": 104,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "translation": "আমি আল্লাহর পরিপূর্ণ বাক্যের মাধ্যমে আশ্রয় চাই তাঁর সৃষ্ট সব মন্দ থেকে।",
            "reference": "Muslim [2708](4/2080)."
          }
        ]
      },
      {
        "group_id": 105,
        "title": "ভ্রমণ থেকে ফিরে আসার সময় দোয়া",
        "duas": [
          {
            "id": 217,
            "group_id": 105,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
            "translation": "আল্লাহ মহান, আল্লাহ মহান, আল্লাহ মহান। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি একক, তার কোনো শরিক নেই। সকল রাজত্ব এবং প্রশংসা তাঁর, এবং তিনি সবকিছুর উপর ক্ষমতাশালী। আমরা ফিরে আসছি, তওবা করছি, ইবাদত করছি এবং আমাদের প্রভুর প্রশংসা করছি। আল্লাহ তাঁর প্রতিশ্রুতি পূরণ করেছেন, তাঁর বান্দাকে সাহায্য করেছেন এবং একাই শত্রুদের পরাজিত করেছেন।",
            "reference": "Al-Bukhârî [1797](7/163) and Muslim [1344](2/980)."
          }
        ]
      }
  ]
},
  {
    "category_id": 6,
    "title": "আনন্দ ও দুঃখ",
    "group": [
      {
        "group_id": 34,
        "title": "উদ্বেগ ও দুঃখের জন্য",
        "duas": [
          {
            "id": 120,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
            "translation": "হে আল্লাহ, আমি আপনার বান্দা, আপনার এক বান্দার পুত্র, আপনার এক দাসীর পুত্র। আমার নিয়ন্ত্রণ আপনার হাতে, আমার উপর আপনার হুকুম কার্যকর এবং আপনার আদেশ ন্যায়বিচার। আমি আপনাকে আপনার প্রতিটি নামের মাধ্যমে আহ্বান জানাই যা আপনি নিজেকে দিয়েছেন, যা আপনি আপনার কিতাবে প্রকাশ করেছেন, যা আপনি আপনার কোনো সৃষ্টিকে শিখিয়েছেন, বা যা আপনি আপনার কাছে অদৃশ্যের জ্ঞান হিসেবে সংরক্ষণ করেছেন, যেন আপনি কুরআনকে আমার হৃদয়ের জীবনীশক্তি, আমার বক্ষের আলো, আমার দুঃখের মুক্তি এবং আমার উদ্বেগের মুক্তি করেন।",
            "reference": "Aĥmad (1/391). Al-Albânî authenticated it in Al-Kalam Ať-Ťayyib [124]."
          },
        {
          "id": 121,
          "group_id": 34,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই উদ্বেগ এবং দুঃখ থেকে, দুর্বলতা এবং অলসতা থেকে, কৃপণতা এবং ভীরুতা থেকে, ঋণের বোঝা এবং মানুষ দ্বারা পরাভূত হওয়া থেকে।",
          "reference": "Al-Bukhârî [6363](7/158), see Fatĥ al-Bârî (11/173)."
        }
      ]
    },
    {
      "group_id": 35,
      "title": "কোনো বিপদে পড়লে",
      "duas": [
        {
          "id": 122,
          "group_id": 35,
          "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
          "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি মহান, তিনি পরম ধৈর্যশীল। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি মহান সিংহাসনের প্রভু। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তিনি আকাশের প্রভু, জমিনের প্রভু এবং মহিমান্বিত সিংহাসনের প্রভু।",
          "reference": "Al-Bukhârî [6346](7/154) and Muslim [2730](4/2092)."
        },
        {
          "id": 123,
          "group_id": 35,
          "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
          "translation": "হে আল্লাহ, আমি আপনার রহমতের আশা করি, তাই আমাকে এক মুহূর্তের জন্যও নিজের উপর নির্ভর করতে দেবেন না এবং আমার সব কাজকে ঠিক করে দিন। আপনি ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Abû Dâwud [5090](4/324) and Aĥmad (5/42). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (3/959)."
        },
        {
          "id": 124,
          "group_id": 35,
          "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
          "translation": "আপনি ছাড়া আর কোনো উপাস্য নেই। আপনি পরম পবিত্র, আমি অবশ্যই জালেমদের অন্তর্ভুক্ত ছিলাম।",
          "reference": "At-Tirmidhî [3505](5/529) and Al-Hâkim (1/505) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Tirmidhî (3/168)."
        },
        {
          "id": 125,
          "group_id": 35,
          "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
          "translation": "আল্লাহ, আল্লাহ আমার প্রভু, আমি তার সাথে কিছুই শরিক করি না।",
          "reference": "Abû Dâwud [1525](2/87). Also see Ŝaĥîĥ Ibn Mâjah (2/335)."
        }
      ]
    },
    {
      "group_id": 36,
      "title": "শত্রু বা ক্ষমতাবানদের সম্মুখীন হলে",
      "duas": [
        {
          "id": 126,
          "group_id": 36,
          "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
          "translation": "হে আল্লাহ, আমরা আপনাকে তাদের সম্মুখে রাখছি এবং আমরা তাদের অনিষ্ট থেকে আপনার কাছে আশ্রয় চাই।",
          "reference": "Abû Dâwud [1537](2/89) and Al-Hâkim (2/142) and he authenticated it and Adh-Dhahabî agreed with him."
        },
        {
          "id": 127,
          "group_id": 36,
          "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
          "translation": "হে আল্লাহ, আপনি আমার সহায়ক এবং আপনি আমার সাহায্যকারী, আপনার মাধ্যমে আমি অগ্রসর হই, আপনার মাধ্যমে আমি আক্রমণ করি এবং আপনার মাধ্যমেই আমি যুদ্ধ করি।",
          "reference": "Abû Dâwud [2632](3/42) and At-Tirmidhî [3584](5/572). Also see Ŝaĥîĥ At-Tirmidhî (3/183)."
        },
        {
          "id": 128,
          "group_id": 36,
          "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
          "translation": "আল্লাহ আমাদের জন্য যথেষ্ট এবং তিনি কতই না উত্তম তত্ত্বাবধায়ক।",
          "reference": "Al-Bukhârî [4563](5/172)."
        }
      ]
    },
    {
      "group_id": 37,
      "title": "শাসকের অত্যাচার থেকে ভীত হলে",
      "duas": [
        {
          "id": 129,
          "group_id": 37,
          "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
          "translation": "হে আল্লাহ, সাত আকাশের এবং মহান সিংহাসনের প্রভু, আমাকে অমুক [ব্যক্তির নাম বলুন] এবং তার সহযোগীদের মন্দ থেকে রক্ষা করুন। তারা আমার উপর অত্যাচার না করে, আপনি যাদের আশ্রয় দেন তারা সম্মানিত, আপনার প্রশংসা মহিমান্বিত, আপনি ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad [545]."
        },
        {
          "id": 130,
          "group_id": 37,
          "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
          "translation": "আল্লাহ মহান, তিনি তার সমস্ত সৃষ্টির চেয়ে শক্তিশালী। আল্লাহ শক্তিশালী তার চেয়ে যাকে আমি ভয় করি এবং যার থেকে আমি আশঙ্কা করি। আমি আল্লাহর কাছে আশ্রয় চাই, যিনি সাত আকাশকে তাদের অনুমতি ছাড়া পৃথিবীতে পতিত হতে দেন না, অমুক ব্যক্তির [নাম বলুন], তার সৈন্যবাহিনী, তার অনুসারী এবং তার সহযোগীদের মন্দ থেকে। হে আল্লাহ, তাদের মন্দ থেকে আমাকে রক্ষা করুন। আপনার প্রশংসা মহিমান্বিত, আপনার আশ্রয় সম্মানিত, আপনার নাম বরকতময়, এবং আপনি ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad (546)."
        }
      ]
    },
    {
      "group_id": 38,
      "title": "শত্রুদের বিরুদ্ধে",
      "duas": [
        {
          "id": 131,
          "group_id": 38,
          "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
          "translation": "হে আল্লাহ, কিতাবের অবতারণকারী, আপনি দ্রুত হিসাব গ্রহণকারী। দলগুলোকে পরাজিত করুন। হে আল্লাহ, তাদের পরাজিত করুন এবং তাদের কাঁপিয়ে দিন।",
          "reference": "Muslim [1742](3/1362)."
        }
      ]
    },
    {
      "group_id": 39,
      "title": "কোনো দলের ভয় পেলে",
      "duas": [
        {
          "id": 132,
          "group_id": 39,
          "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
          "translation": "হে আল্লাহ, আপনি যেভাবে চান, আমাকে তাদের থেকে রক্ষা করুন।",
          "reference": "Muslim [3005](4/2300)."
        }
      ]
    },
    {
      "group_id": 40,
      "title": "যিনি দ্বীনে সন্দেহে পড়েছেন তার জন্য",
      "duas": [
        {
          "id": 133,
          "group_id": 40,
          "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
          "translation": "(১) শয়তানের অনিষ্ট থেকে আল্লাহর কাছে আশ্রয় চাওয়া।(২) যা সন্দেহের কারণ তা পরিত্যাগ করা।",
          "reference": "Al-Bukhârî [6/336](6/336) and Muslim [134,214](1/120)."
        },
        {
          "id": 134,
          "group_id": 40,
          "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
          "translation": "আমি আল্লাহ এবং তার রাসুলের উপর ঈমান এনেছি।",
          "reference": "Muslim [134,212](1/119-120)."
        },
        {
          "id": 135,
          "group_id": 40,
          "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
          "translation": "তিনি প্রথম এবং শেষ, প্রকাশ্য এবং গোপনীয় এবং তিনি সবকিছু সম্পর্কে জ্ঞাত।",
          "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abî  Dâwud (3/962)."
        }
      ]
    },
    {
      "group_id": 41,
      "title": "ঋণ পরিশোধের জন্য",
      "duas": [
        {
          "id": 136,
          "group_id": 41,
          "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
          "translation": "হে আল্লাহ, হালালের মাধ্যমে আমাকে হারাম থেকে রক্ষা করুন এবং আপনার অনুগ্রহে আমাকে অন্যের প্রয়োজন থেকে মুক্ত করুন।",
          "reference": "At-Tirmidhî [3563](5/650). Also see Ŝaĥîĥ At-Tirmidhî (3/180)."
        },
        {
          "id": 137,
          "group_id": 41,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
          "translation": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই উদ্বেগ এবং দুঃখ থেকে, দুর্বলতা এবং অলসতা থেকে, কৃপণতা এবং ভীরুতা থেকে, ঋণের বোঝা এবং মানুষ দ্বারা পরাভূত হওয়া থেকে।",
          "reference": "Al-Bukhârî [6363](7/158)."
        }
      ]
    },
    {
      "group_id": 53,
      "title": "যিনি কোনো বিপদে পড়েছেন তার জন্য",
      "duas": [
        {
          "id": 154,
          "group_id": 53,
          "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
          "translation": "আমরা আল্লাহর জন্য এবং আমরা তাঁর দিকে ফিরে যাব। হে আল্লাহ, আমার বিপদে আমাকে পুরস্কৃত করুন এবং আমাকে এর চেয়ে উত্তম কিছু দিয়ে প্রতিস্থাপন করুন।",
          "reference": "Muslim [918](2/632)."
        }
      ]
    },
    {
      "group_id": 92,
      "title": "শিরক থেকে রক্ষা পাওয়ার জন্য",
      "duas": [
        {
          "id": 203,
          "group_id": 92,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
          "translation": "হে আল্লাহ, আমি আপনার কাছে আশ্রয় চাই যেন আমি সচেতনভাবে আপনার সাথে শিরক না করি এবং আমি আপনার কাছে ক্ষমা চাই যা আমি অজান্তেই করেছি।",
          "reference": "Aĥmad (4/403). Also see Ŝaĥîĥ Al-Jâmi' [3731](3/233) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) by Al-Albânî."
        }
      ]
    },
    {
      "group_id": 94,
      "title": "অমঙ্গলজনক জিনিস থেকে বিরত থাকার জন্য",
      "duas": [
        {
          "id": 205,
          "group_id": 94,
          "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
          "translation": "হে আল্লাহ, কোনো অমঙ্গল নেই যা আপনাকে ছাড়া অন্য কিছুর উপর নির্ভর করে, কোনো কল্যাণ নেই যা আপনার কল্যাণ ছাড়া, এবং আপনি ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54). The Prophet (salla Allaahu ʻalayhi wa salaam) liked Al-Fa'al [الفأل](good omens). When he heard a good word from a man, he liked it and said: \"We took your good omens from your mouth\", narrated by Abû Dâwud [3917] and Imâm Aĥmad; and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah](2/363). This narration can also be found in Abu As-Shaykh's book [Akhlâq An-Nabî (salla Allaahu ʻalayhi wa salaam)] (p. 270)."
        }
      ]
    },
    {
      "group_id": 106,
      "title": "সুখবর বা দুঃসংবাদ পাওয়ার সময়",
      "duas": [
        {
          "id": 218,
          "group_id": 106,
          "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
          "translation": "সুখবর পাওয়ার সময় বলুন: (১) 'আলহামদুলিল্লাহ, যার অনুগ্রহে নেক কাজ সম্পন্ন হয়।'দুঃসংবাদ পাওয়ার সময় বলুন: (২) 'আলহামদুলিল্লাহ, সমস্ত অবস্থায়।'",
          "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] and Al-Hâkim (1/499) and he authenticated it. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [4640](4/201)."
        }
      ]
    },
    {
      "group_id": 122,
      "title": "অবিশ্বাস্য বিস্ময় ও আনন্দের সময়",
      "duas": [
        {
          "id": 240,
          "group_id": 122,
          "dua": "سُبْحَانَ اللهِ!",
          "translation": "আল্লাহ কতই না পরিপূর্ণ!",
          "reference": "Al-Bukhârî [155](1/210), [283](1/390) and Muslim [371], [314](414), [332](4/1857)."
        },
        {
          "id": 241,
          "group_id": 122,
          "dua": "اللهُ أَكْبَرُ",
          "translation": "আল্লাহ মহান।",
          "reference": "Al-Bukhârî [4741](8/441). Also see Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) and Aĥmad (5/218)."
        }
      ]
    },
    {
      "group_id": 123,
      "title": "সুখবর পাওয়ার সময়",
      "duas": [
        {
          "id": 242,
          "group_id": 123,
          "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
          "translation": "যখন রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) এমন কোনো সংবাদ পেতেন যা তাকে আনন্দিত করত বা যা তার জন্য আনন্দের কারণ হত, তিনি আল্লাহর প্রতি কৃতজ্ঞতাস্বরূপ সিজদা করতেন।",
          "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] and Ibn Mâjah [1394]. Also see Ŝaĥîĥ Ibn Mâjah (1/233) and Irwâ'-ul-Ghalîl (2/226)."
        }
      ]
    },
    {
      "group_id": 126,
      "title": "আতঙ্কিত হলে",
      "duas": [
        {
          "id": 245,
          "group_id": 126,
          "dua": "لَا إلَهَ إلَّا اللهُ",
          "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই।",
          "reference": "Al-Bukhârî [3346](6/381) and Muslim [2880](4/2208)."
        }
      ]
    }
  ]
},
  {
    "category_id": 7,
    "title": "প্রকৃতি",
    "group": [
      {
        "group_id": 61,
        "title": "ঝড়ো বাতাসের সময়",
        "duas": [
          {
            "id": 166,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
            "translation": "হে আল্লাহ, আমি এর কল্যাণ প্রার্থনা করছি এবং এর অনিষ্ট থেকে আপনার কাছে আশ্রয় চাই।",
            "reference": "Abû Dâwud [5097](4/326) and Ibn Mâjah [3727](2/1228). Also see Ŝaĥîĥ Ibn Mâjah (2/305)."
          },
          {
            "id": 167,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
            "translation": "হে আল্লাহ, আমি এর কল্যাণ, এর মধ্যে যা কল্যাণ রয়েছে এবং যে কল্যাণের জন্য এটি পাঠানো হয়েছে তা প্রার্থনা করছি এবং এর অনিষ্ট, এর মধ্যে যা অনিষ্ট রয়েছে এবং যে অনিষ্টের জন্য এটি পাঠানো হয়েছে তা থেকে আপনার কাছে আশ্রয় চাই।",
            "reference": "Muslim [899](2/616) and Al-Bukhârî [3206](4/76)."
          }
        ]
      },
      {
        "group_id": 62,
        "title": "বজ্রপাত শোনার সময়",
        "duas": [
          {
            "id": 168,
            "group_id": 62,
            "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
            "translation": "পরম পবিত্র সেই মহান সত্তা, যার প্রশংসা সহকারে বজ্রধ্বনি এবং ফেরেশতারা তাঁর ভয়ে তাঁকে মহিমান্বিত করে।",
            "reference": "Al-Muwaťťa' (2/992) and Al-Albânî declared its chain to be Ŝaĥîĥ and Mawqûf."
          }
        ]
      },
      {
        "group_id": 63,
        "title": "বৃষ্টির জন্য প্রার্থনা",
        "duas": [
          {
            "id": 169,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
            "translation": "হে আল্লাহ, আমাদের জন্য উপকারী, স্বাস্থ্যকর এবং ভালো বৃষ্টি দিন, যা ক্ষতিকর নয় এবং দ্রুত আসুক, দেরি না করে।",
            "reference": "Abû Dâwud [1169](1/303). Al-Albânî declared it authentic in Ŝaĥîĥ Abû Dâwud (1/216)."
          },
          {
            "id": 170,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
            "translation": "হে আল্লাহ, আমাদের মুক্তি দিন, হে আল্লাহ, আমাদের মুক্তি দিন, হে আল্লাহ, আমাদের মুক্তি দিন।",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/613)."
          },
          {
            "id": 171,
            "group_id": 63,
            "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
            "translation": "হে আল্লাহ, আপনার বান্দাদের এবং তাদের পশুদের পানি দিন, আপনার রহমত ছড়িয়ে দিন এবং আপনার মৃত জমিকে পুনরুজ্জীবিত করুন।",
            "reference": "Abû Dâwud [1176](1/305) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/218)."
          }
        ]
      },
      {
        "group_id": 64,
        "title": "বৃষ্টির সময়",
        "duas": [
          {
            "id": 172,
            "group_id": 64,
            "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
            "translation": "হে আল্লাহ, এটি যেন একটি উপকারী বৃষ্টির মেঘ হয়।",
            "reference": "Al-Bukhârî [1032](2/518)."
          }
        ]
      },
      {
        "group_id": 65,
        "title": "বৃষ্টি হওয়ার পরে",
        "duas": [
          {
            "id": 173,
            "group_id": 65,
            "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
            "translation": "আমরা আল্লাহর অনুগ্রহ এবং করুণা দ্বারা বৃষ্টিপ্রাপ্ত হয়েছি।",
            "reference": "Al-Bukhârî [846](1/205) and Muslim [71](1/83)."
          }
        ]
      },
      {
        "group_id": 66,
        "title": "আকাশ পরিষ্কার করার প্রার্থনা",
        "duas": [
          {
            "id": 174,
            "group_id": 66,
            "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
            "translation": "হে আল্লাহ, আমাদের চারপাশে বৃষ্টি বর্ষিত করুন, আমাদের উপর নয়। হে আল্লাহ, এটি পাহাড়ের ঢালে, উপত্যকায় এবং গাছের শিকড়ের দিকে বর্ষিত করুন।",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/614)."
          }
        ]
      },
      {
        "group_id": 67,
        "title": "চাঁদ দেখা গেলে",
        "duas": [
          {
            "id": 175,
            "group_id": 67,
            "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
            "translation": "আল্লাহ মহান। হে আল্লাহ, আমাদের উপর এই চাঁদকে নিরাপত্তা, ঈমান, শান্তি এবং ইসলামের সাথে নিয়ে আসুন এবং আমাদেরকে সেই সব কাজে সফলতা দিন যা আপনি পছন্দ করেন এবং যা আপনার সন্তুষ্টি আনে। আমাদের প্রভু এবং তোমার প্রভু আল্লাহ।",
            "reference": "At-Tirmidhî [3451](5/405) and Ad-Dârimî (1/336) and the wording is his. Also see Ŝaĥîĥ At-Tirmidhî (3/157)."
          }
        ]
      },
      {
        "group_id": 76,
        "title": "প্রথম বা অসময়ের ফল দেখতে পেলে",
        "duas": [
          {
            "id": 187,
            "group_id": 76,
            "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
            "translation": "হে আল্লাহ, আমাদের ফলের মধ্যে বরকত দিন, আমাদের শহরের মধ্যে বরকত দিন, আমাদের সা' (পরিমাপের একক) এর মধ্যে বরকত দিন এবং আমাদের মুদ্দ (পরিমাপের একক) এর মধ্যে বরকত দিন।",
            "reference": "Muslim [1373](2/1000)."
          }
        ]
      },
      {
        "group_id": 110,
        "title": "মোরগের ডাক বা গাধার চিৎকার শুনলে",
        "duas": [
          {
            "id": 228,
            "group_id": 110,
            "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
            "translation": "যখন তোমরা মোরগের ডাক শুনবে, তখন আল্লাহর অনুগ্রহ প্রার্থনা করো, কারণ মোরগটি একজন ফেরেশতাকে দেখেছে। আর যখন তোমরা গাধার ডাক শুনবে, তখন শয়তান থেকে আল্লাহর কাছে আশ্রয় প্রার্থনা করো, কারণ গাধাটি শয়তানকে দেখেছে।",
            "reference": "Al-Bukhârî [3303](6/350) and Muslim [2729](4/2092)."
          }
        ]
      },
      {
        "group_id": 111,
        "title": "রাতে কুকুরের ঘেউ ঘেউ বা গাধার চিৎকার শুনলে",
        "duas": [
          {
            "id": 229,
            "group_id": 111,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "translation": "যদি রাতে কুকুরের ঘেউ ঘেউ বা গাধার চিৎকার শোনো, তাহলে শয়তান থেকে আল্লাহর কাছে আশ্রয় প্রার্থনা করো, কারণ তারা এমন কিছু দেখে যা তোমরা দেখতে পাও না।",
            "reference": "Abû Dâwud [5103](4/327) and Aĥmad (3/306). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/961)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 8,
    "title": "ভাল আচরণ",
    "group": [
      {
        "group_id": 47,
        "title": "সন্তান জন্মের উপলক্ষে অভিনন্দন",
        "duas": [
          {
            "id": 145,
            "group_id": 47,
            "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
            "translation": "'আল্লাহ আপনার জন্য যে সন্তান দিয়েছেন তার প্রতি বরকত দিন এবং আপনি যিনি এই সন্তানকে দিয়েছেন তার প্রতি কৃতজ্ঞতা প্রকাশ করুন। তিনি (এই সন্তান) যেন পরিপক্কতায় পৌঁছায় এবং আল্লাহ যেন তাকে আপনার প্রতি সদাচারী করেন।'প্রত্যুত্তর: 'আল্লাহ আপনার যা কিছু দিয়েছেন তাতে বরকত দিন! আল্লাহ আপনাকে ক্ষমা করে পুরস্কৃত করুন এবং আপনাকে একটি সন্তান দান করুন এবং আপনাকে প্রাচুর্যপূর্ণ প্রতিদান দান করুন।'",
            "reference": "An-Nawawî [Al-Athkâr](pg. 349). Also see Ŝaĥîĥ Al-Athkâr of Imam An-Nawawî (2/713) by Shaykh Salîm Al-Hilâlî."
          }
        ]
      },
      {
        "group_id": 75,
        "title": "রোজা অবস্থায় অপমানিত হলে",
        "duas": [
          {
            "id": 186,
            "group_id": 75,
            "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
            "translation": "আমি রোজা রাখছি, আমি রোজা রাখছি।",
            "reference": "Al-Bukhârî [1894](4/103) and Muslim [1151](2/806)."
          }
        ]
      },
      {
        "group_id": 77,
        "title": "হাঁচি দেওয়ার সময়",
        "duas": [
          {
            "id": 188,
            "group_id": 77,
            "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
            "translation": "তোমাদের মধ্যে কেউ হাঁচি দিলে বলুন: (১) 'আলহামদুলিল্লাহ', তার ভাই বা সাথীকে বলা উচিত: (২) 'আল্লাহ আপনার প্রতি দয়া করুন', এবং হাঁচি দেওয়া ব্যক্তি (৩) 'আল্লাহ আপনাকে সঠিক পথে চালিত করুন এবং আপনার অবস্থা সংশোধন করুন' বলে প্রত্যুত্তর দেবে।",
            "reference": "Al-Bukhârî [6224](7/125)."
          }
        ]
      },
      {
        "group_id": 78,
        "title": "অবিশ্বাসী হাঁচির পর আল্লাহর প্রশংসা করলে",
        "duas": [
          {
            "id": 189,
            "group_id": 78,
            "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
            "translation": "আল্লাহ আপনাকে সঠিক পথে চালিত করুন এবং আপনার অবস্থা সংশোধন করুন।",
            "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) and Abû Dâwud [5038](4/308). Also see Ŝaĥîĥ At-Tirmidhî (2/354)."
          }
        ]
      },
      {
        "group_id": 80,
        "title": "বিবাহের রাতে বা পশু ক্রয়ের সময়",
        "duas": [
          {
            "id": 191,
            "group_id": 80,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
            "translation": "হে আল্লাহ, আমি আপনার কাছে তার মধ্যে থাকা কল্যাণ এবং আপনি তাকে যে ভালো প্রবণতার দিকে চালিত করেছেন তা প্রার্থনা করছি এবং তার মধ্যে থাকা অকল্যাণ এবং আপনি তাকে যে অকল্যাণের দিকে চালিত করেছেন তা থেকে আপনার কাছে আশ্রয় চাই।",
            "reference": "Abû Dâwud [2160](2/248) and Ibn Mâjah [1918](1/617). Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
          }
        ]
      },
      {
        "group_id": 82,
        "title": "রাগ হলে",
        "duas": [
          {
            "id": 193,
            "group_id": 82,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "translation": "আমি বিতাড়িত শয়তান থেকে আল্লাহর কাছে আশ্রয় প্রার্থনা করছি।",
            "reference": "Al-Bukhârî [6048](7/99) and Muslim [2610](5/2015)."
          }
        ]
      },
      {
        "group_id": 83,
        "title": "কারও ওপর পরীক্ষা বা বিপদ এলে",
        "duas": [
          {
            "id": 194,
            "group_id": 83,
            "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
            "translation": "আলহামদুলিল্লাহ, যিনি আমাকে সেই কষ্ট থেকে রক্ষা করেছেন যা দ্বারা তিনি আপনাকে পরীক্ষা করেছেন এবং যিনি অবশ্যই আমাকে তাঁর সৃষ্টির অনেকের ওপরে বিশেষভাবে সম্মানিত করেছেন।",
            "reference": "At-Tirmidhî [3432](5/493,494). Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
          }
        ]
      },
      {
        "group_id": 84,
        "title": "মজলিস বা জমায়েতে বসলে",
        "duas": [
          {
            "id": 195,
            "group_id": 84,
            "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
            "translation": "হে আমার প্রভু, আমাকে ক্ষমা করুন এবং আমার প্রতি ফিরুন (আমার তওবা গ্রহণ করুন)। নিশ্চয়ই আপনি তওবা কবুলকারী এবং অতিশয় ক্ষমাশীল।",
            "reference": "At-Tirmidhî [3432]. Also see Ŝaĥîĥ At-Tirmidhî (3/153) and Ŝaĥîĥ Ibn Mâjah (2/321) and the wording is At-Tirmidhî's."
          }
        ]
      },
      {
        "group_id": 85,
        "title": "মজলিস বা জমায়েত শেষে পাপমুক্তির জন্য প্রার্থনা",
        "duas": [
          {
            "id": 196,
            "group_id": 85,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
            "translation": "আপনি কতই না পরিপূর্ণ, হে আল্লাহ! এবং আমি আপনার প্রশংসা করি। আমি সাক্ষ্য দিচ্ছি যে আল্লাহ ছাড়া আর কোনো উপাস্য নেই। আমি আপনার কাছে ক্ষমা চাই এবং আপনার দিকে তওবা করি।",
            "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
          }
        ]
      },
      {
        "group_id": 86,
        "title": "ক্ষমা প্রার্থনার দোয়া ফিরিয়ে দেওয়া",
        "duas": [
          {
            "id": 197,
            "group_id": 86,
            "dua": "وَلَكَ",
            "translation": "আর আপনার জন্যও (ক্ষমা কামনা করছি)।",
            "reference": "Aĥmad (5/82) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
          }
        ]
      },
      {
        "group_id": 87,
        "title": "কাউকে উপকার করলে প্রত্যুত্তর",
        "duas": [
          {
            "id": 198,
            "group_id": 87,
            "dua": "جَزَاكَ اللهُ خَيْراً",
            "translation": "আল্লাহ আপনাকে উত্তম প্রতিদান দান করুন।",
            "reference": "At-Tirmidhî [2035]. Also see Ŝaĥîĥ Al-Jâmi' [6244] and Ŝaĥîĥ At-Tirmidhî (2/200)."
          }
        ]
      },
      {
        "group_id": 89,
        "title": "যে আপনাকে আল্লাহর জন্য ভালোবাসে বলে জানায়",
        "duas": [
          {
            "id": 200,
            "group_id": 89,
            "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
            "translation": "যিনি আমাকে ভালোবাসেন তার জন্য আল্লাহ আপনাকে ভালোবাসুন।",
            "reference": "Abû Dâwud [5125](4/333) and Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/965)."
          }
        ]
      },
      {
        "group_id": 90,
        "title": "যে ব্যক্তি আপনাকে তার সম্পদ থেকে কিছু দান করে",
        "duas": [
          {
            "id": 201,
            "group_id": 90,
            "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
            "translation": "আল্লাহ আপনার পরিবার এবং সম্পদে বরকত দিন।",
            "reference": "Abû Dâwud [5125](4/333) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (3/965)."
          }
        ]
      },
      {
        "group_id": 91,
        "title": "ঋণ পরিশোধের সময়",
        "duas": [
          {
            "id": 202,
            "group_id": 91,
            "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
            "translation": "আল্লাহ আপনার পরিবার এবং সম্পদে বরকত দিন। নিশ্চয়ই ঋণের প্রতিদান হলো প্রশংসা এবং পরিশোধ।",
            "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) and Ibn Mâjah [2424](2/809). Also see Ŝaĥîĥ Ibn Mâjah (2/55)."
          }
        ]
      },
      {
        "group_id": 93,
        "title": "দান বা দাতব্য করার পর প্রার্থনা",
        "duas": [
          {
            "id": 204,
            "group_id": 93,
            "dua": "وَفِيْكَ بَارَكَ اللهُ",
            "translation": "আল্লাহ আপনার ওপর বরকত দান করুন।",
            "reference": "Ibn As-Sunnî [278](pg. 138). Also see Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) with research by Bashîr Muĥammad 'Uyun. "
          }
        ]
      },
      {
        "group_id": 108,
        "title": "ইসলামিক সালাম প্রচারের গুরুত্ব",
        "duas": [
          {
            "id": 224,
            "group_id": 108,
            "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
            "translation": "নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন: 'তোমরা তখনই জান্নাতে প্রবেশ করবে, যখন তোমাদের ঈমান পূর্ণ হবে। আর তোমাদের ঈমান পূর্ণ হবে তখনই, যখন তোমরা একে অপরকে ভালোবাসবে। আমি কি তোমাদের এমন কিছু সম্পর্কে জানাব না, যা করলে তোমরা একে অপরকে ভালোবাসবে? নিজেদের মধ্যে সালাম ছড়িয়ে দাও।'",
            "reference": "Muslim [54](1/74)."
          },
          {
            "id": 225,
            "group_id": 108,
            "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
            "translation": "'আম্মার ইবন ইয়াসির (রাদিয়াল্লাহু আনহু) বলেছেন: 'তিনটি গুণাবলী, যে এগুলো একত্রিত করে, তার ঈমান পূর্ণ হয়: নিজেকে ন্যায্যভাবে পরিচালনা করা, বিশ্বের প্রতি সালাম প্রচার করা এবং অল্প পরিমাণে থাকার পরও দান করা।'",
            "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
          },
          {
            "id": 226,
            "group_id": 108,
            "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
            "translation": "'আব্দুল্লাহ ইবন আমর (রাদিয়াল্লাহু আনহু) বলেছেন যে একজন ব্যক্তি নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)কে জিজ্ঞাসা করেছিলেন: 'কোন ইসলাম উত্তম?' তিনি (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বললেন: 'ক্ষুধার্তদের খাবার খাওয়াও এবং যাদের চেনো বা না চেনো সবাইকে সালাম দাও।'",
            "reference": "Al-Bukhârî [12](1/55) and Muslim [39](1/65)."
          }
        ]
      },
      {
        "group_id": 109,
        "title": "অবিশ্বাসীকে সালামের উত্তর দেওয়া",
        "duas": [
          {
            "id": 227,
            "group_id": 109,
            "dua": "وَ عَلَيْكُمْ",
            "translation": "আর তোমাদের ওপরও।",
            "reference": "Al-Bukhârî [6258](11/42) and Muslim [2163](4/1705)."
          }
        ]
      },
      {
        "group_id": 112,
        "title": "যে ব্যক্তিকে আপনি অপমান করেছেন",
        "duas": [
          {
            "id": 230,
            "group_id": 112,
            "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
            "translation": "হে আল্লাহ, যেকোনো মুমিনকে যদি আমি অপমান করে থাকি, তবে সেটি কিয়ামতের দিনে তাকে আপনার নৈকট্য লাভের কারণ বানিয়ে দিন।",
            "reference": "Al-Bukhârî [6361](11/171) and Muslim [2601](4/2007)."
          }
        ]
      },
      {
        "group_id": 113,
        "title": "একজন মুসলিম ভাইয়ের প্রশংসা করার শিষ্টাচার",
        "duas": [
          {
            "id": 231,
            "group_id": 113,
            "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
            "translation": "নবী (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম) বলেছেন: 'যদি তোমাদের কেউ তার সাথীর প্রশংসা করতে চায়, তবে সে বলুক: 'আমি অমুককে (সৎ ব্যক্তি হিসেবে) জানি, আল্লাহ তার হিসাব গ্রহণকারী। আমি আল্লাহর চেয়ে কোনো কারও প্রশংসা সামনে রাখতে পারি না। আমি তাকে এমন এবং এমন হিসেবে জানি।'",
            "reference": "Muslim [3000](4/2296) and Al-Bukhârî [2662]."
          }
        ]
      },
      {
        "group_id": 114,
        "title": "যাকে প্রশংসা করা হয়েছে",
        "duas": [
          {
            "id": 232,
            "group_id": 114,
            "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
            "translation": "হে আল্লাহ, তারা যা বলে তার জন্য আমাকে শাস্তি দেবেন না এবং তারা যা জানে না তার জন্য আমাকে ক্ষমা করুন (এবং আমাকে তাদের ধারণার চেয়েও উত্তম করুন)।",
            "reference": "Al-Bukhârî [Adab Al-Mufrad][761] and Al-Albânî declared its chain Ĥasan in Ŝaĥîĥ Adab Al-Mufrad [585]. What is between the brackets is an extension from Al-Baihaqî [Shu'ab Al-Imân](4/228) through a different way."
          }
        ]
      }
    ]
  },
  {
    "category_id": 9,
    "title": "বাড়ি ও পরিবার",
    "group": [
      {
        "group_id": 2,
        "title": "পোশাক পরার সময়",
        "duas": [
          {
            "id": 5,
            "group_id": 2,
            "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
            "translation": "প্রশংসা আল্লাহর, যিনি আমাকে এই (পোশাক) পরিধান করিয়েছেন এবং আমাকে এটি দিয়েছেন, যদিও আমার নিজের কোনো শক্তি বা সামর্থ্য ছিল না।",
            "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] and Ibn Mâjah [3285]. Also see Irwâ'-ul-Ghalîl (7/47)."
          }
        ]
      },
      {
        "group_id": 3,
        "title": "নতুন পোশাক পরার সময়",
        "duas": [
          {
            "id": 6,
            "group_id": 3,
            "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
            "translation": "হে আল্লাহ, সমস্ত প্রশংসা তোমার জন্য। তুমি আমাকে এটি পরিয়েছ, আমি তোমার কাছে এর ভালো দিক এবং যার জন্য এটি তৈরি করা হয়েছে তার ভালো দিক চাইছি। আমি তোমার কাছে এর মন্দ দিক এবং যার জন্য এটি তৈরি করা হয়েছে তার মন্দ দিক থেকে আশ্রয় চাইছি।",
            "reference": "Abû Dâwud [4020] and At-Tirmidhî [1767] and Al-Baghawî. The wording is from Abû Dâwud. Also see Mukhtaŝar Shama'il At-Tirmidhî by Al-Albânî (p. 47)."
          }
        ]
      },
      {
        "group_id": 4,
        "title": "কাউকে নতুন পোশাক পরতে দেখলে",
        "duas": [
          {
            "id": 7,
            "group_id": 4,
            "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
            "translation": "আল্লাহ তোমাকে দীর্ঘস্থায়ী করুক এবং আল্লাহ এর পরিবর্তে অন্যটি প্রদান করুন।",
            "reference": "Abû Dâwud [4020](4/41). Also see Ŝaĥiĥ Abû Dâwud (2/760)."
          },
          {
            "id": 8,
            "group_id": 4,
            "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
            "translation": "নতুন পরিধান করো, সুনামের সাথে বাঁচো এবং শহীদ হয়ে মারা যাও।",
            "reference": "Ibn Mâjah [3558](2/1178) and Al-Baghawî (12/41). Also see Ŝaĥiĥ Ibn Mâjah (2/275)."
          }
        ]
      },
      {
        "group_id": 5,
        "title": "পোশাক খোলার সময়",
        "duas": [
          {
            "id": 9,
            "group_id": 5,
            "dua": "بِسْمِ اللهِ",
            "translation": "আল্লাহর নামে।",
            "reference": "At-Tirmidhî [606](2/505) and Sahîh Al-Jâmi' [3210](3/203). Also see Irwâ'-ul-Ghalîl [50]."
          }
        ]
      },
      {
        "group_id": 6,
        "title": "টয়লেটে প্রবেশের আগে",
        "duas": [
          {
            "id": 10,
            "group_id": 6,
            "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
            "translation": "(আল্লাহর নামে) হে আল্লাহ, আমি তোমার কাছে সমস্ত মন্দ ও মন্দকারীদের থেকে আশ্রয় চাই।",
            "reference": "Al-Bukhârî [142](1/45) and Muslim [375](1/283). The narration with the extension \"In the name of Allah\" has been collected by Sa'eed bin Manŝoor, see Fatĥ al-Bârî (1/244)."
          }
        ]
      },
      {
        "group_id": 7,
        "title": "টয়লেট থেকে বের হওয়ার পর",
        "duas": [
          {
            "id": 11,
            "group_id": 7,
            "dua": "غُفْرَانَكَ",
            "translation": "আমি আপনার কাছে ক্ষমা প্রার্থনা করছি (আল্লাহ)।",
            "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
          }
        ]
      },
      {
        "group_id": 10,
        "title": "বাড়িতে প্রবেশের সময়",
        "duas": [
          {
            "id": 16,
            "group_id": 10,
            "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "আল্লাহর নামে, আমি আল্লাহর ওপর ভরসা রাখি, এবং আল্লাহ ছাড়া কোনো শক্তি বা ক্ষমতা নেই।",
            "reference": "Abû Dâwud [5094](4/325) and At-Tirmidhî [3427](5/490). Also see Ŝaĥiĥ At-Tirmidhî (3/151)."
          },
          {
            "id": 17,
            "group_id": 10,
            "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
            "translation": "হে আল্লাহ, আমি তোমার কাছে আশ্রয় চাই যেন আমি পথভ্রষ্ট না হই বা আমাকে পথভ্রষ্ট করা না হয়, যেন আমি পা না পিছলাই বা কেউ আমাকে পিছলায় না, যেন আমি কাউকে অত্যাচার না করি বা আমাকে অত্যাচার করা না হয়, যেন আমি মূর্খতা না করি বা আমার প্রতি মূর্খতা করা না হয়।",
            "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) and Ibn Mâjah [3884]. Also see Ŝaĥiĥ At-Tirmidhî (3/152) and Ŝaĥiĥ Ibn Mâjah (2/336)."
          }
        ]
      },
      {
        "group_id": 11,
        "title": "বাড়ি থেকে বের হওয়ার সময়",
        "duas": [
          {
            "id": 18,
            "group_id": 11,
            "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
            "translation": "আল্লাহর নামে আমরা প্রবেশ করি এবং আল্লাহর নামে আমরা বের হই এবং আমাদের প্রভুর ওপর আমরা ভরসা রাখি।",
            "reference": "Abû Dâwud [5096](4/325) and Shaykh Abdul 'Azîz bin Bâz graded its chain ĥasan in [Tuĥfat al-Akhyâr](28)."
          }
        ]
      },
      {
        "group_id": 45,
        "title": "শয়তান এবং তার কুমন্ত্রণা দূর করার জন্য",
        "duas": [
          {
            "id": 141,
            "group_id": 45,
            "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
            "translation": "শয়তানের বিরুদ্ধে আল্লাহর কাছে আশ্রয় প্রার্থনা করুন।",
            "reference": "Abû Dâwud (1/206) and At-Tirmidhî. Also see Ŝaĥîĥ At-Tirmidhî (1/77)."
          },
          {
            "id": 142,
            "group_id": 45,
            "dua": "الأذَانُ",
            "translation": "আযান (নামাযের আহ্বান)।",
            "reference": "Al-Bukhârî [608](1/151) and Muslim [389](1/291)."
          },
          {
            "id": 143,
            "group_id": 45,
            "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
            "translation": "যিকিরের সহীহ পঠিত পাঠ এবং কুরআন তিলাওয়াত।",
            "reference": "Muslim [780](1/539)."
          }
        ]
      },
      {
        "group_id": 79,
        "title": "নবদম্পতিকে",
        "duas": [
          {
            "id": 190,
            "group_id": 79,
            "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
            "translation": "আল্লাহ তোমার জন্য বরকতময় করুন এবং তোমাদের একত্রীকরণে কল্যাণ প্রদান করুন।",
            "reference": "Abû Dâwud [2130], At-Tirmidhî [1091], and Ibn Mâjah [1905]. Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
          }
        ]
      },
      {
        "group_id": 81,
        "title": "যৌন মিলনের আগে",
        "duas": [
          {
            "id": 192,
            "group_id": 81,
            "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
            "translation": "আল্লাহর নামে। হে আল্লাহ, আমাদের থেকে শয়তানকে দূরে রাখো এবং আমাদের যে সন্তান তুমি দান করেছো, তাতেও শয়তানকে দূরে রাখো।",
            "reference": "Al-Bukhârî [3271](6/141) and Muslim [1434](2/1028)."
          }
        ]
      },
      {
        "group_id": 125,
        "title": "কারো বা কোনো কিছুর প্রতি নজর লাগার ভয় হলে",
        "duas": [
          {
            "id": 244,
            "group_id": 125,
            "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
            "translation": "যদি আপনি আপনার ভাই, নিজের বা ধন-সম্পদের মধ্যে কিছু দেখে মুগ্ধ হন, তবে এর জন্য বরকত প্রার্থনা করুন, কারণ নজর লাগা সত্য।",
            "reference": "Aĥmad (4/447), Ibn Mâjah [3509] and Mâlik [1697-1698]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [556](1/212). Also see research of Zâd al-Ma'âd by Al-Arnâ'ûť."
          }
        ]
      },
      {
        "group_id": 128,
        "title": "অ obstinate শয়তানদের প্রতারণা থেকে রক্ষা পেতে",
        "duas": [
          {
            "id": 247,
            "group_id": 128,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
            "translation": "আমি আল্লাহর পরিপূর্ণ শব্দগুলোর মধ্যে আশ্রয় চাই, যেগুলোকে কোনো ন্যায়পরায়ণ বা অন্যায়পরায়ণ অতিক্রম করতে পারে না, যা তিনি সৃষ্টি করেছেন, তৈরি করেছেন, এবং উদ্ভাবন করেছেন, সমস্ত মন্দ থেকে। (আমি আশ্রয় চাই) আকাশ থেকে যা নেমে আসে তার মন্দ থেকে এবং যা সেখানে উঠে যায় তার মন্দ থেকে। (আমি আশ্রয় চাই) মাটিতে ছড়িয়ে পড়া মন্দ থেকে এবং যা মাটি থেকে বের হয় তার মন্দ থেকে। আমি রাত্রি ও দিনের সমস্ত বিপদের মন্দ থেকে এবং সেই একজনের মন্দ থেকে, যারা রাতের বেলায় আগমন করে, শুধু সেই যারা কল্যাণ নিয়ে আসে তাদের থেকে নয়, হে দয়াময়।",
            "reference": "Aĥmad (3/419) with a Ŝaĥîĥ chain, Ibn As-Sunnî [637]. Al-Arnâ'ûť declared its chain Ŝaĥîĥ in his research of Ať-Ťaĥawiyyah (pg. 133). Also see Majma' Az-Zawâ'id (10/127)."
          }
        ]
      },
      {
        "group_id": 132,
        "title": "সাধারণ এবং কল্যাণকর নিয়মাবলী",
        "duas": [
          {
            "id": 267,
            "group_id": 132,
            "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
            "translation": "যখন রাত্রি হয় বা সন্ধ্যা হয়, তখন তোমাদের শিশুদের ভিতরে রাখো, কারণ শয়তান তখন চারিদিকে ছড়িয়ে পড়ে। কিছু সময় পর, তাদেরকে ছেড়ে দাও। তোমাদের দরজাগুলো বন্ধ করো এবং আল্লাহর নাম উল্লেখ করো, কারণ শয়তান বন্ধ দরজা খুলতে পারে না। তোমাদের পানির পাত্রগুলো বন্ধ করো এবং আল্লাহর নাম উল্লেখ করো, তোমাদের পাত্রগুলো ঢেকে রাখো এবং আল্লাহর নাম উল্লেখ করো, এবং তোমাদের প্রদীপ নিভিয়ে দাও।",
            "reference": "Al-Bukhârî [5623](10/88) and Muslim [2012](3/1595)."
          }
        ]
      }
  ]
},
  {
    "category_id": 10,
    "title": "খাদ্য ও পানীয়",
    "group": [
      {
        "group_id": 68,
        "title": "রোজা ভাঙার সময়",
        "duas": [
          {
            "id": 176,
            "group_id": 68,
            "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
            "translation": "তৃষ্ণা চলে গেছে এবং শিরাগুলো সতেজ হয়েছে, আর পুরস্কার নিশ্চিত, যদি আল্লাহ চান।",
            "reference": "Abû Dâwud [2357](2/306). Also see Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
          },
          {
            "id": 177,
            "group_id": 68,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
            "translation": "হে আল্লাহ, আমি আপনার রহমতের মাধ্যমে যা সমস্ত কিছু আচ্ছন্ন করেছে, আপনার কাছে ক্ষমা প্রার্থনা করছি।",
            "reference": "Ibn Mâjah [1753](1/557) and Al-Hâfiž declared it Ĥasan in this takhrîj of Al-Athkâr. Also see Sharĥ Al-Athkâr (4/342)."
          }
        ]
      },
      {
        "group_id": 69,
        "title": "খাওয়ার আগে",
        "duas": [
          {
            "id": 178,
            "group_id": 69,
            "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
            "translation": "আল্লাহর নামে (এর শুরুতে এবং শেষে)*।",
            "reference": "* যদি কেউ খাওয়ার আগে দোয়া পড়া ভুলে যায় এবং খাওয়ার সময় মনে পড়ে, তখন ব্র্যাকেটে উল্লেখিত অংশটি পড়তে হবে।Abû Dâwud [3767](3/347) and At-Tirmidhî [1858](4/288). Also see Ŝaĥîĥ At-Tirmidhî (2/167)."
          },
          {
            "id": 179,
            "group_id": 69,
            "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
            "translation": "(1) 'হে আল্লাহ, আমাদের জন্য এতে বরকত দাও এবং এর চেয়েও উত্তম খাবার দাও।'যদি দুধ দেওয়া হয়, তবে নিম্নলিখিত পড়ুন:(2) 'হে আল্লাহ, এতে আমাদের জন্য বরকত দাও এবং আরও বেশি দাও।'",
            "reference": "Abû Dâwud [3767] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî declared it weak, see Al-Kalam Ať-Ťayyib [184]."
          }
        ]
      },
      {
        "group_id": 70,
        "title": "খাওয়া শেষ করার পর",
        "duas": [
          {
            "id": 180,
            "group_id": 70,
            "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
            "translation": "সমস্ত প্রশংসা আল্লাহর জন্য, যিনি আমাকে এটি খেতে দিয়েছেন এবং আমাকে এটি প্রদান করেছেন, যদিও আমার কোনো ক্ষমতা বা শক্তি ছিল না।",
            "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] and Ibn Mâjah [3285]. Also see Ŝaĥîĥ At-Tirmidhî (3/159)."
          },
          {
            "id": 181,
            "group_id": 70,
            "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
            "translation": "আল্লাহকে প্রচুর সুন্দর ও বরকতময় প্রশংসা করি, এক অন্তহীন প্রশংসা, এমন একটি প্রশংসা যা কখনো বিদায় হবে না, যা কখনো অপ্রয়োজনীয় হবে না, তিনি আমাদের প্রভু।",
            "reference": "Al-Bukhârî [5458](6/214) and At-Tirmidhî [3456](5/507) and the wording is his."
          }
        ]
      },
      {
        "group_id": 71,
        "title": "অতিথির পক্ষ থেকে আতিথেয়তাকারীর জন্য",
        "duas": [
          {
            "id": 182,
            "group_id": 71,
            "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
            "translation": "হে আল্লাহ, আপনি তাদের যা প্রদান করেছেন তাতে বরকত দান করুন, তাদের ক্ষমা করুন এবং তাদের প্রতি দয়া করুন।",
            "reference": "Muslim [2042](3/1615)."
          }
        ]
      },
      {
        "group_id": 72,
        "title": "যে পানীয় প্রদান করে বা যা প্রদান করার উদ্দেশ্য ছিল",
        "duas": [
          {
            "id": 183,
            "group_id": 72,
            "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
            "translation": "হে আল্লাহ, যে আমাকে খাওয়ালো তাকে খাওয়াও এবং যে আমাকে পানীয় প্রদান করলো তাকে পানীয় প্রদান করো।",
            "reference": "Muslim [2055](3/1626)."
          }
        ]
      },
      {
        "group_id": 73,
        "title": "কাউকে বাড়িতে ইফতারের জন্য নিমন্ত্রণ করার পর",
        "duas": [
          {
            "id": 184,
            "group_id": 73,
            "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
            "translation": "সিয়াম পালনকারীরা যেন আপনার বাড়িতে ইফতার করেন, সৎ এবং ধর্মপ্রাণ লোকেরা যেন আপনার খাবার খান, আর ফেরেশতারা যেন আপনার জন্য দোয়া করেন।",
            "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/730)."
          }
        ]
      },
      {
        "group_id": 74,
        "title": "যে রোজা রেখে খাবারের নিমন্ত্রণে যোগ দেয় কিন্তু রোজা ভাঙ্গে না",
        "duas": [
          {
            "id": 185,
            "group_id": 74,
            "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
            "translation": "যদি তোমাদের কাউকে (খাবারের) নিমন্ত্রণ দেওয়া হয়, তাহলে গ্রহণ করো। যদি তুমি রোজাদার হও, তাহলে তাদের জন্য দোয়া করো (যারা খাবারের আয়োজন করেছে), আর যদি তুমি রোজাদার না হও, তাহলে খাও। (এখানে 'দোয়া করো' অর্থে 'আশীর্বাদ করো' বলা হয়েছে)।",
            "reference": "Muslim [1431](2/1054)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 11,
    "title": "রোগ ও মৃত্যু",
    "group": [
      {
        "group_id": 48,
        "title": "শিশুদের আল্লাহর আশ্রয়ে রাখার দোয়া",
        "duas": [
          {
            "id": 146,
            "group_id": 48,
            "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
            "translation": "আমি তোমাদেরকে আল্লাহর পরিপূর্ণ বাণীর দ্বারা প্রতিরক্ষা করি, প্রত্যেক শয়তান, ক্ষতিকারক প্রাণী ও প্রত্যেক কুদৃষ্টি থেকে।",
            "reference": "Al-Bukhârî [3371](4/119)."
          }
        ]
      },
      {
        "group_id": 49,
        "title": "রোগীকে দেখতে গেলে",
        "duas": [
          {
            "id": 147,
            "group_id": 49,
            "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
            "translation": "কোনও সমস্যা নেই, এটি পরিশুদ্ধি হিসেবে হোক, যদি আল্লাহ চান।",
            "reference": "Al-Bukhârî [3616](10/118)."
          },
          {
            "id": 148,
            "group_id": 49,
            "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
            "translation": "আমি মহান আল্লাহর কাছে প্রার্থনা করছি, মহিমান্বিত আরশের প্রভু যেন আপনাকে সুস্থ করেন। (সাতবার)",
            "reference": "At-Tirmidhî [2083] and Abû Dâwud [3106]. Also see Ŝaĥîĥ At-Tirmidhî (2/210) and Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
          }
        ]
      },
      {
        "group_id": 50,
        "title": "রোগীকে দেখার ফজিলত",
        "duas": [
          {
            "id": 149,
            "group_id": 50,
            "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
            "translation": "যদি কোনো ব্যক্তি তার মুসলিম ভাইকে দেখতে যান, তবে এটি এমন হবে যেন সে জান্নাতের ফল সংগ্রহ করছে যতক্ষণ না সে বসে। যখন সে বসে, তখন তার উপর রহমত বর্ষিত হয়। যদি তা সকালে হয়, সত্তর হাজার ফেরেশতা সন্ধ্যা পর্যন্ত তার জন্য দোয়া করে এবং যদি তা সন্ধ্যায় হয়, তবে সত্তর হাজার ফেরেশতা সকালে পর্যন্ত তার জন্য দোয়া করে।",
            "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] and Aĥmad (1/97). Also see Ŝaĥîĥ Ibn Mâjah (1/244) and Ŝaĥîĥ At-Tirmidhî (1/286). Shaykh Aĥmad Shâkir also authenticated it."
          }
        ]
      },
      {
        "group_id": 51,
        "title": "রোগী যখন জীবনের আশা ত্যাগ করে",
        "duas": [
          {
            "id": 150,
            "group_id": 51,
            "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
            "translation": "হে আল্লাহ, আমাকে ক্ষমা করুন, আমার উপর দয়া করুন এবং আমাকে উচ্চ মর্যাদাপ্রাপ্ত সঙ্গীদের সাথে মিলিত করুন।",
            "reference": "Al-Bukhârî [4440](7/10) and Muslim [2444](4/1893)."
          },
          {
            "id": 151,
            "group_id": 51,
            "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
            "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই, মৃত্যুতে সত্যিই কষ্ট রয়েছে।",
            "reference": "Al-Bukhârî [4449](8/144)."
          },
          {
            "id": 152,
            "group_id": 51,
            "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "আল্লাহ ছাড়া আর কোনো উপাস্য নেই এবং আল্লাহ মহান। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, একমাত্র তিনি। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, একমাত্র তিনি, তার কোনো শরিক নেই। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, তারই সকল ক্ষমতা ও প্রশংসা। আল্লাহ ছাড়া আর কোনো উপাস্য নেই, এবং আল্লাহ ছাড়া কোনো শক্তি বা ক্ষমতা নেই।",
            "reference": "At-Tirmidhî [3430] and Ibn Mâjah [3794]. Al-Albânî authenticated it. Also see Ŝaĥîĥ At-Tirmidhî (3/152) and Ŝaĥîĥ Ibn Mâjah (2/317)."
          }
        ]
      },
      {
        "group_id": 52,
        "title": "মৃত্যুর কাছাকাছি সময়ে নির্দেশনা",
        "duas": [
          {
            "id": 153,
            "group_id": 52,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "যার শেষ কথা হবে 'আল্লাহ ছাড়া আর কোনো উপাস্য নেই', সে জান্নাতে প্রবেশ করবে।",
            "reference": "Abû Dâwud [3116](3/190). Also See Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
          }
        ]
      },
      {
        "group_id": 54,
        "title": "মৃতের চোখ বন্ধ করার সময়",
        "duas": [
          {
            "id": 155,
            "group_id": 54,
            "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
            "translation": "হে আল্লাহ, (মৃত ব্যক্তির নাম) কে ক্ষমা করুন এবং তাকে সৎ পথে পরিচালিতদের মধ্যে উঁচু মর্যাদা প্রদান করুন। যারা তাকে রেখে গেছে তাদের জন্য আপনার নিকট উত্তরাধিকার হিসেবে থেকে যান। হে প্রভু, তাকে ক্ষমা করুন এবং আমাদেরকেও ক্ষমা করুন। তার কবরে প্রশস্ততা দিন এবং সেখানে তাকে আলো দান করুন।",
            "reference": "Muslim [920](2/634)."
          }
        ]
      },
      {
        "group_id": 55,
        "title": "মৃতের জন্য জানাজার সময় দোয়া",
        "duas": [
          {
            "id": 156,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
            "translation": "হে আল্লাহ, তাকে ক্ষমা করুন এবং তার উপর দয়া করুন। তার প্রতি স্নেহশীল হন এবং তাকে সম্মানিত অভ্যর্থনা দিন। তার কবরকে প্রশস্ত করুন এবং তাকে পানি, বরফ ও শীতল জল দিয়ে পরিশুদ্ধ করুন। তাকে পাপ থেকে এমনভাবে পবিত্র করুন যেমন সাদা কাপড় ময়লা থেকে পরিষ্কার করা হয়। তাকে তার বাড়ির পরিবর্তে একটি উত্তম বাড়ি, তার পরিবারের পরিবর্তে একটি উত্তম পরিবার এবং তার সঙ্গীর পরিবর্তে একটি উত্তম সঙ্গী দিন। তাকে জান্নাতে প্রবেশ করান এবং তাকে কবরে ও জাহান্নামের শাস্তি থেকে রক্ষা করুন।",
            "reference": "Muslim [963](2/663)."
          },
          {
            "id": 157,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
            "translation": "হে আল্লাহ, আমাদের জীবিত এবং মৃতদের, উপস্থিত এবং অনুপস্থিতদের, আমাদের ছোট এবং বড়দের, আমাদের পুরুষ এবং নারীদের ক্ষমা করুন। হে আল্লাহ, আমাদের মধ্যে যাদেরকে আপনি জীবিত রাখবেন তাদেরকে ইসলামের উপর জীবিত রাখুন, এবং যাদেরকে আপনি মৃত্যু দান করবেন তাদেরকে ঈমানের উপর মৃত্যু দান করুন। হে আল্লাহ, আমাদেরকে তার পুরস্কার থেকে বঞ্চিত করবেন না এবং আমাদেরকে তার পরে পথভ্রষ্ট করবেন না।",
            "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] and Aĥmad (2/368). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
           {
          "id": 158,
          "group_id": 55,
          "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
          "translation": "হে আল্লাহ, অমুক ব্যক্তির নাম (ফুলান ইবনে ফুলান) আপনার সুরক্ষায় এবং আপনার আস্থায় রয়েছে। তাকে কবরের পরীক্ষা এবং আগুনের শাস্তি থেকে রক্ষা করুন। আপনি সত্যের এবং প্রতিশ্রুতির পরিপূর্ণ পালনকারী। তাকে ক্ষমা করুন এবং তার উপর দয়া করুন, নিশ্চয়ই আপনি ক্ষমাশীল এবং পরম দয়ালু।",
          "reference": "Ibn Mâjah [1499] and Abû Dâwud (3/211). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
        },
        {
          "id": 159,
          "group_id": 55,
          "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
          "translation": "হে আল্লাহ, আপনার বান্দা এবং আপনার দাসীর পুত্র এখন আপনার করুণার প্রয়োজন এবং আপনি তার শাস্তি থেকে মুক্ত। যদি সে সৎকর্মপরায়ণ হয়ে থাকে তবে তার সৎকর্ম বৃদ্ধি করুন এবং যদি সে পাপী হয়ে থাকে তবে তার পাপগুলো ক্ষমা করুন।",
          "reference": "Al-Hâkim (1/359) এবং তিনি এটিকে সহীহ ঘোষণা করেছেন, এবং Adh-Dhahabî এর সাথে একমত হয়েছেন। এছাড়াও দেখুন Aĥkâm Al-Janâ'iz by Al-Albânî (pg. 125)."
        }
      ]
    },
      {
        "group_id": 56,
        "title": "যখন মৃত শিশু, জানাজার সময় দোয়া",
        "duas": [
          {
            "id": 160,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
            "translation": "হে আল্লাহ, তাকে তার পিতামাতার জন্য জান্নাতের একটি সংরক্ষিত ধন এবং একজন সুপারিশকারী হিসেবে তৈরি করুন, এবং তার সুপারিশ গ্রহণযোগ্য হোক। হে আল্লাহ, তার মাধ্যমে তাদের নেকির পাল্লা ভারী করে দিন এবং তাদের জন্য তার মাধ্যমে বেশি প্রতিদান নির্ধারণ করুন। তাকে সৎকর্মপরায়ণ মুমিনদের সাথে যুক্ত করুন, তাকে ইবরাহিম (আলাইহিস সালাম)-এর তত্ত্বাবধানে রাখুন এবং আপনার দয়ার মাধ্যমে তাকে জাহান্নামের শাস্তি থেকে রক্ষা করুন। তাকে তার বাড়ির চেয়ে একটি উত্তম বাড়ি এবং তার পরিবারের চেয়ে একটি উত্তম পরিবার দিন। হে আল্লাহ, আমাদের পূর্বপুরুষদের এবং আমাদের প্রজন্মের সকলকে এবং যারা আমাদের আগে ঈমান নিয়ে এই পৃথিবী থেকে চলে গেছে তাদের ক্ষমা করুন।",
            "reference": "Al-Mughnî by Ibn Qudâmah (3/416) and Ad-Durûs Al-Muhimmah Li'âmah Al-Ummah by Shaykh Ibn Bâz (pg. 15)."
          },
          {
            "id": 161,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
            "translation": "হে আল্লাহ, তাকে আমাদের জন্য একটি সংরক্ষিত ধন, একটি প্রতিদান এবং একটি সঞ্চিত নেকি হিসেবে নির্ধারণ করুন।",
            "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
          }
        ]
      },
      {
        "group_id": 57,
        "title": "শোকবার্তা",
        "duas": [
          {
            "id": 162,
            "group_id": 57,
            "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
            "translation": "নিশ্চয়ই আল্লাহরই মালিকানায় যা তিনি নিয়ে যান এবং যা তিনি প্রদান করেন তা-ও। এবং তার কাছে প্রতিটি জিনিসের জন্য নির্ধারিত একটি সময় রয়েছে।...তাহলে আপনি ধৈর্য ধরুন এবং আল্লাহর কাছে প্রতিদান প্রার্থনা করুন।",
            "reference": "Al-Bukhârî [1284](2/80) and Muslim [923](2/636)."
          }
        ]
      },
      {
        "group_id": 58,
        "title": "মৃতকে কবরে রাখার সময়",
        "duas": [
          {
            "id": 163,
            "group_id": 58,
            "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
            "translation": "আল্লাহর নামে এবং রাসূলুল্লাহ (সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম)-এর সুন্নাহ অনুযায়ী।",
            "reference": "Abû Dâwud [3213](3/314) with a Ŝaĥîĥ chain and Aĥmad (2/40) with the phrase: (بسم الله و على ملة رسول الله) and its chain is Ŝaĥîĥ."
          }
        ]
      },
      {
        "group_id": 59,
        "title": "মৃতকে দাফন করার পর",
        "duas": [
          {
            "id": 164,
            "group_id": 59,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
            "translation": "হে আল্লাহ, তাকে ক্ষমা করুন, হে আল্লাহ, তাকে দৃঢ় রাখুন।",
            "reference": "Abû Dâwud [3221](3/315) and Al-Hâkim (1/370) এবং তিনি এটিকে সহীহ ঘোষণা করেছেন এবং Adh-Dhahabî এর সাথে একমত হয়েছেন।"
          }
        ]
      },
      {
        "group_id": 60,
        "title": "কবর জিয়ারতের সময়",
        "duas": [
          {
            "id": 165,
            "group_id": 60,
            "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
            "translation": "মুসলিম এবং মুমিনদের মধ্যে যারা এখানে রয়েছে তাদের প্রতি শান্তি বর্ষিত হোক, ইনশাআল্লাহ আমরাও শীঘ্রই তোমাদের সাথে মিলিত হব। [আল্লাহ আমাদের মধ্যে যারা আগে গেছে এবং যারা পরে যাবে তাদের প্রতি দয়া করুন] আমি আল্লাহর নিকট তোমাদের এবং আমাদের জন্য কল্যাণ প্রার্থনা করছি।",
            "reference": "Muslim [975](2/671) and Ibn Mâjah [1547](1/494) এবং এই বর্ণনা ইবনু মাজাহর। বন্ধনীর ভিতরের অংশটি আয়িশার (রাদিয়াল্লাহু আনহা)-এর হাদিস থেকে নেওয়া যা মুসলিম [974](2/671) এ বর্ণিত।"
          }
        ]
      },
      {
        "group_id": 124,
        "title": "যখন শরীরে কোন ব্যথা অনুভব হয়",
        "duas": [
          {
            "id": 243,
            "group_id": 124,
            "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
            "translation": "তিনবার 'আল্লাহর নামে' বলুন এবং সাতবার 'আমি আল্লাহর কাছে এবং তাঁর ক্ষমতার মধ্যে আশ্রয় নিচ্ছি, যা কিছু খারাপ আমি অনুভব করছি এবং ভয় পাচ্ছি তা থেকে।'",
            "reference": "Muslim [2202](4/1728)."
          }
        ]
      }
     ]
  }
]

