[
  {
  "category_id": 1,
  "title": "Pagi & Malam",
  "group": [
    {
      "group_id": 1,
      "title": "Saat Bangun Tidur",
      "duas": [
        {
          "id": 1,
          "group_id": 1,
          "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
          "translation": "Segala puji bagi Allah yang memberi kita kehidupan setelah Dia membuat kita mati, dan kepada-Nya kita akan kembali.",
          "reference": "Al-Bukhârî [6312], lihat Fatĥ al-Bârî (11/113) dan Muslim [2711](4/2083)."
        },
        {
          "id": 2,
          "group_id": 1,
          "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
          "translation": "Tidak ada yang berhak disembah kecuali Allah semata, yang tidak memiliki sekutu. Milik-Nya kerajaan dan segala puji bagi-Nya, dan Dia Maha Kuasa atas segala sesuatu. Maha Suci Allah. Segala puji bagi Allah. Tidak ada yang berhak disembah selain Allah. Allah Maha Besar. Tidak ada kekuatan dan kekuasaan kecuali dengan izin Allah, Yang Maha Tinggi, Yang Maha Agung. Tuhanku, ampunilah aku. (Siapa pun yang mengucapkannya akan diampuni, dan jika dia berdoa kepada Allah, doanya akan dikabulkan; jika dia berwudhu dan berdoa, doanya akan diterima).",
          "reference": "Al-Bukhârî [1154], lihat Fatĥ al-Bârî (3/39) dan redaksinya adalah dari Ibn Mâjah (2/335), lihat juga Ŝaĥiĥ Ibn Mâjah (2/335)."
        },
        {
          "id": 3,
          "group_id": 1,
          "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
          "translation": "Segala puji bagi Allah yang memberikan kekuatan pada tubuhku, mengembalikan jiwaku kepadaku dan mengizinkanku untuk mengingat-Nya.",
          "reference": "At-Tirmidhî [3401](5/473), lihat juga Ŝaĥiĥ At-Tirmidhî (3/144)."
        },
        {
          "id": 4,
          "group_id": 1,
          "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
          "translation": "Bacalah Surah Al-'Imran [3:190-200].",
          "reference": "Al-Bukhârî [4572], lihat Fatĥ al-Bârî (8/237) dan Muslim [763](1/530)."
        }
      ]
    },
    {
      "group_id": 27,
      "title": "Pada Pagi dan Malam",
      "duas": [
        {
          "id": 75,
          "group_id": 27,
          "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
          "translation": "Barangsiapa mengucapkan ini (Âyat al-Kursî) saat bangun di pagi hari, akan dilindungi dari jin hingga malam tiba, dan barangsiapa mengucapkannya saat malam tiba, akan dilindungi hingga pagi tiba.",
          "reference": "Al-Hâkim (1/562) dan Al-Albânî mensahihkan dalam Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) dan mengaitkannya dengan An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] dan Ťabarânî [Al-Kabîr][541] serta mengatakan bahwa sanadnya baik."
        },
        {
          "id": 76,
          "group_id": 27,
          "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
          "translation": "Bacalah:1. Surah Ikhlâs (Qur'an: 112)2. Surah Al-Falaq (Qur'an: 113)3. Surah An-Nâs (Qur'an: 114)[3 kali]",
          "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/182)."
        },
        {
          "id": 77,
          "group_id": 27,
          "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
          "translation": "'Kami memasuki pagi dan dengan itu segala kerajaan adalah milik Allah. Segala puji bagi Allah. Tidak ada yang berhak disembah selain Allah, yang tidak memiliki sekutu. Milik Allah kerajaan, dan bagi-Nya segala puji, dan Dia Maha Kuasa atas segala sesuatu. Tuhanku, aku meminta kebaikan hari ini dan kebaikan hari-hari setelahnya, dan aku berlindung kepada-Mu dari keburukan hari ini dan keburukan hari-hari setelahnya. Tuhanku, aku berlindung kepada-Mu dari kemalasan dan ketuaan yang tak berdaya. Tuhanku, aku berlindung kepada-Mu dari siksa api neraka dan siksa kubur.'Pada malam hari, bacalah:'Kami memasuki malam dan dengan itu segala kerajaan adalah milik Allah...'dan:'...Tuhanku, aku meminta kebaikan malam ini dan kebaikan malam-malam setelahnya, dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan malam-malam setelahnya...'",
          "reference": "Muslim [2723](4/2088)."
        },
        {
          "id": 78,
          "group_id": 27,
          "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
          "translation": "'Ya Allah, dengan izin-Mu kami memasuki pagi, dengan izin-Mu kami memasuki malam, dengan izin-Mu kami hidup dan mati, dan kepada-Mu kami dibangkitkan.'Pada malam hari, bacalah:'Ya Allah, dengan izin-Mu kami memasuki malam, dengan izin-Mu kami memasuki pagi, dengan izin-Mu kami hidup dan mati, dan kepada-Mu kami kembali.'",
          "reference": "At-Tirmidhî [3391](5/466). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/142)."
        },
        {
          "id": 79,
          "group_id": 27,
          "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
          "translation": "Ya Allah, Engkaulah Tuhanku, tidak ada yang berhak disembah selain Engkau, Engkau menciptakanku dan aku adalah hamba-Mu, dan aku mematuhi janji-Mu dan perjanjian-Mu semampuku. Aku berlindung kepada-Mu dari keburukan perbuatanku. Aku mengakui nikmat-Mu padaku dan aku mengakui dosa-dosaku, maka ampunilah aku, karena tidak ada yang dapat mengampuni dosa selain Engkau.",
          "reference": "Al-Bukhârî [6306](7/150)."
        },
        {
          "id": 80,
          "group_id": 27,
          "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
          "translation": "Ya Allah, sungguh aku telah memasuki pagi ini dan memanggil-Mu, para pembawa 'Arsy-Mu, para malaikat-Mu, dan seluruh makhluk-Mu untuk menyaksikan bahwa Engkaulah Allah, tidak ada yang berhak disembah selain Engkau, satu-satunya, tanpa sekutu, dan bahwa Muhammad adalah hamba-Mu dan rasul-Mu. [Empat kali]",
          "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] dan Ibn As-Sunnî [70]. Syekh Ibn Bâz menyatakan bahwa sanad An-Nisâ'i dan Abû Dâwud, Hasan dalam [Tuĥfat Al-Akhyâr][hal. 23]. Namun Al-Albânî menyatakannya lemah. Lihat Al-Kalim Ať-Ťayyib [25]."
        },
        {
          "id": 81,
          "group_id": 27,
          "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
          "translation": "Ya Allah, apa pun nikmat yang aku atau siapa pun dari makhluk-Mu bangun bersama, semuanya berasal dari-Mu semata, tanpa sekutu. Maka, bagi-Mu segala puji dan bagi-Mu segala syukur.",
          "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Syekh Ibn Bâz menyatakan sanadnya Hasan dalam [Tuĥfat Al-Akhyâr][hal. 24]. Namun Al-Albânî menyatakannya lemah. Lihat Al-Kalim Ať-Ťayyib [26]."
        },
        {
          "id": 82,
          "group_id": 27,
          "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
          "translation": "Ya Allah, berikanlah kesehatan pada tubuhku, ya Allah, berikanlah kesehatan pada pendengaranku, ya Allah, berikanlah kesehatan pada penglihatanku. Tidak ada yang berhak disembah selain Engkau. Ya Allah, aku berlindung kepada-Mu dari kekafiran dan kemiskinan, dan aku berlindung kepada-Mu dari siksa kubur; tidak ada yang berhak disembah selain Engkau. [Tiga kali]",
          "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Syekh Ibn Bâz menyatakan sanadnya sahih dalam [Tuĥfat Al-Akhyâr][hal. 26]. Al-Albânî menyatakannya lemah. Lihat Ďa'îf Al-J Al-Jâmi' [1210]."
        },
        {
          "id": 83,
          "group_id": 27,
          "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
          "translation": "Cukuplah Allah bagiku, tidak ada yang berhak disembah selain Dia, kepada-Nya aku bertawakkal, dan Dia adalah Tuhan dari 'Arsy yang agung. [Tujuh kali]",
          "reference": "Ibn As-Sunnî [71][Marfû'] dan Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb dan 'Abdul Qadir Al-Arnâ'ûť menyatakan sahih. Lihat juga Zâd al-Ma'âd (2/376). Al-Albânî menyatakannya lemah. Lihat Ďa'îf Abî Dâwud."
        },
        {
          "id": 84,
          "group_id": 27,
          "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
          "translation": "Ya Allah, aku meminta ampunan dan kesehatan kepada-Mu di dunia dan akhirat. Ya Allah, aku meminta ampunan dan kesehatan dalam agama, dunia, keluarga, dan hartaku. Ya Allah, tutupilah kekuranganku dan hilangkanlah kecemasan dariku. Ya Allah, lindungilah aku dari depan, belakang, kanan, kiri, dan atas, dan aku berlindung kepada keagungan-Mu agar tidak ditelan bumi dari bawahku.",
          "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Lihat juga Ŝaĥîĥ Ibn Mâjah (2/332)."
        },
        {
          "id": 85,
          "group_id": 27,
          "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
          "translation": "Ya Allah, Yang Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan dan Penguasa segala sesuatu, aku bersaksi bahwa tidak ada yang berhak disembah selain Engkau. Aku berlindung kepada-Mu dari kejahatan diriku dan dari kejahatan setan dan kesyirikannya, serta dari melakukan keburukan terhadap diriku atau membawanya kepada sesama Muslim.",
          "reference": "At-Tirmidhî [3392] dan Abû Dâwud [5067]. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/142)."
        },
        {
          "id": 86,
          "group_id": 27,
          "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
          "translation": "Dengan nama Allah, yang dengan nama-Nya, tidak ada yang dapat membahayakan di bumi maupun di langit, dan Dia Maha Mendengar, Maha Mengetahui. [Tiga kali]",
          "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Lihat juga Ŝaĥîĥ Ibn Mâjah (2/332). Syekh Ibn Bâz menyatakan sanadnya sahih dalam [Tuĥfat Al-Akhyâr][hal. 39]."
        },
        {
          "id": 87,
          "group_id": 27,
          "dua": " رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
          "translation": "Aku ridha dengan Allah sebagai Tuhanku, Islam sebagai agamaku, dan Muhammad sebagai nabi. [Tiga kali]",
          "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) dan At-Tirmidhî [3389](5/465). Syekh Ibn Bâz menyatakan Hasan dalam [Tuĥfat Al-Akhyâr][39]."
        },
        {
          "id": 88,
          "group_id": 27,
          "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
          "translation": "Ya Yang Maha Hidup, Yang Maha Berdiri sendiri dan penopang segala sesuatu, dengan rahmat-Mu aku memohon pertolongan, perbaikilah seluruh urusanku dan jangan biarkan aku mengurusi diriku sendiri meskipun sekejap mata.",
          "reference": "Al-Hâkim (1/545); dia mensahihkan dan Adh-Dhahabî setuju dengannya. Lihat juga Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
        },
        {
          "id": 89,
          "group_id": 27,
          "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
          "translation": "'Kami memasuki pagi ini dan pada saat ini semua kerajaan adalah milik Allah, Tuhan semesta alam. Ya Allah, aku meminta kebaikan hari ini, kemenangan dan kejayaannya, cahaya dan keberkahannya, dan petunjuknya, dan aku berlindung kepada-Mu dari keburukan hari ini dan keburukan yang mengikutinya.'Pada malam hari, bacalah: 'Kami memasuki malam ini dan pada saat ini semua kerajaan adalah milik Allah, Tuhan semesta alam. Ya Allah, aku meminta kebaikan malam ini, kemenangan dan kejayaannya, cahaya dan keberkahannya, dan petunjuknya, dan aku berlindung kepada-Mu dari keburukan malam ini dan keburukan yang mengikutinya.'",
          "reference": "Abû Dâwud [5084](4/322), Shu'aîb dan 'Abdul Qadir Al-Arnâ'ûť menyatakan sanadnya Hasan dalam penelitian mereka terhadap Zâd al-Ma'âd (2/273)."
        },
        {
          "id": 90,
          "group_id": 27,
          "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
          "translation": "Kami bangun di atas fitrah Islam, dan kalimat ikhlas, dan di atas agama Nabi kita Muhammad ﷺ, dan di atas agama bapak kita Ibrahim, yang seorang Muslim hanif dan bukan dari orang-orang yang musyrik.",
          "reference": "Aĥmad (3/406,407) dan Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Lihat juga Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
        },
        {
          "id": 91,
          "group_id": 27,
          "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
          "translation": "Maha Suci Allah dan aku memuji-Nya. [Seratus kali]",
          "reference": "Muslim [2723](4/2071)."
        },
        {
          "id": 92,
          "group_id": 27,
          "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
          "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu.   atau  .",
          "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] dari hadits Abu Ayûb Al-Anŝârî (Semoga Allah meridainya). Lihat juga Ŝaĥîĥ At-Targhîb wa At-Tarhîb [650](1/272) dan Tuĥfat Al-Akhyâr (hal. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] dan Aĥmad (4/60). Lihat juga Ŝaĥîĥ At-Targhîb wa At-Tarhîb (1/270), Ŝaĥîĥ Abî Dâwud (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) dan Zâd Al-Ma'âd (2/377)."
        },
        {
          "id": 93,
          "group_id": 27,
          "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
          "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu. [Seratus kali di pagi hari]",
          "reference": "Al-Bukhârî [3293](4/95) dan Muslim [2691](4/2071)."
        },
        {
          "id": 94,
          "group_id": 27,
          "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
          "translation": "Maha Suci Allah dan aku memuji-Nya sebanyak ciptaan-Nya, dengan keridhaan-Nya, seberat Arsy-Nya, dan sebanyak tinta kalimat-Nya. [Tiga kali di pagi hari]",
          "reference": "Muslim [2726](4/2090)."
        },
        {
          "id": 95,
          "group_id": 27,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
          "translation": "Ya Allah, aku meminta ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima. [Di pagi hari]",
          "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] dan Ibn Mâjah [925]. Shu'aîb dan 'Abdul Qadir Al-Arnâ'ûť menyatakan sahih dalam penelitian mereka terhadap Zâd al-Ma'âd (2/375)."
        },
        {
          "id": 96,
          "group_id": 27,
          "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
          "translation": "Aku memohon ampun kepada Allah dan bertobat kepada-Nya. [Seratus kali dalam sehari]",
          "reference": "Al-Bukhârî [6307](11/101) dan Muslim [2702](4/2075)."
        },
        {
          "id": 97,
          "group_id": 27,
          "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
          "translation": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan yang Dia ciptakan. [Tiga kali di malam hari]",
          "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) dan Tuĥfat Al-Akhyâr (hal. 45)"
        },
        {
          "id": 98,
          "group_id": 27,
          "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
          "translation": "Ya Allah, berilah shalawat dan salam kepada nabi kami Muhammad. [Sepuluh kali]",
          "reference": "Ať-Ťabarânî melalui dua rantai, salah satunya baik. Lihat Majm'u Az-Zawâ 'id (10/120) dan Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
        }
      ]
    },
    {
      "group_id": 28,
      "title": "Sebelum Tidur",
      "duas": [
        {
          "id": 99,
          "group_id": 28,
          "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
          "translation": "Ketika berbaring di tempat tidur setiap malam, Nabi (salla Allaahu ʻalayhi wa salaam) akan menyatukan telapak tangannya, meludah kering ke dalamnya, membaca tiga surat terakhir dari Qur'an, lalu mengusap seluruh tubuhnya dengan tangannya, dimulai dari kepala dan wajahnya, kemudian seluruh bagian tubuhnya; beliau melakukan ini tiga kali.",
          "reference": "Al-Bukhârî [5017](9/62) dan Muslim [2192](4/1723)."
        },
        {
          "id": 100,
          "group_id": 28,
          "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
          "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) juga bersabda: 'Ketika hendak tidur, bacalah Ayat Al-Kursî, karena akan ada perlindungan dari Allah atasmu dan tidak ada setan yang mendekatimu hingga pagi.'",
          "reference": "Al-Bukhârî [2311](4/487)."
        },
        {
          "id": 101,
          "group_id": 28,
          "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
          "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) juga bersabda: 'Barangsiapa membaca dua ayat terakhir dari Surah Al-Baqarah di malam hari; dua ayat tersebut akan cukup baginya.'",
          "reference": "Al-Bukhârî [4008](9/94) dan Muslim [808](1/554)."
        },
        {
          "id": 102,
          "group_id": 28,
          "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
          "translation": "Jika salah seorang dari kalian bangkit dari tempat tidurnya lalu kembali lagi, hendaklah dia membersihkannya dengan pinggir pakaiannya tiga kali karena dia tidak tahu apa yang terjadi di tempat tidur saat dia tidak ada, dan ketika dia berbaring hendaknya dia berdoa: 'Dengan nama-Mu Tuhanku, aku berbaring dan dengan nama-Mu aku bangkit, jadi jika Engkau mengambil jiwaku, maka rahmatilah dia, dan jika Engkau mengembalikannya, lindungilah dia seperti Engkau melindungi hamba-hamba-Mu yang saleh.'",
          "reference": "Al-Bukhârî [6320](11/126) dan Muslim [2714](4/2084)."
        },
        {
          "id": 103,
          "group_id": 28,
          "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
          "translation": "Ya Allah, sungguh Engkau telah menciptakan jiwaku dan Engkau akan mengambil hidupnya, kepada-Mu milik hidup dan matinya. Jika Engkau menjaganya tetap hidup, maka lindungilah, dan jika Engkau mengambil hidupnya, maka ampunilah. Ya Allah, aku meminta kepada-Mu kesehatan yang baik.",
          "reference": "Muslim [2712](4/2083) dan Aĥmad (2/79)."
        },
        {
          "id": 104,
          "group_id": 28,
          "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
          "translation": "Ya Allah, lindungilah aku dari siksa-Mu pada hari ketika Engkau membangkitkan hamba-hamba-Mu.",
          "reference": "Abû Dâwud [5045](4/311). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/143)."
        },
        {
          "id": 105,
          "group_id": 28,
          "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
          "translation": "Dengan nama-Mu, ya Allah, aku hidup dan mati.",
          "reference": "Abû Dâwud [5045](4/311). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/143)."
        },
        {
          "id": 106,
          "group_id": 28,
          "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
          "translation": "Maha Suci Allah [Tiga puluh tiga kali].Segala puji bagi Allah [Tiga puluh tiga kali].Allah Maha Besar [Tiga puluh empat kali].",
          "reference": "Al-Bukhârî [3705](7/71) dan Muslim [2727](4/2091)."
        },
        {
          "id": 107,
          "group_id": 28,
          "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
          "translation": "Ya Allah, Tuhan tujuh langit dan bumi, Tuhan Arsy yang agung, Tuhan kami dan Tuhan segala sesuatu, Yang membelah biji dan inti, Yang menurunkan Taurat, Injil, dan Al-Furqan, aku berlindung kepada-Mu dari keburukan segala sesuatu yang Engkau kendalikan. Ya Allah, Engkau Yang Pertama, tidak ada yang mendahului-Mu, dan Engkau Yang Terakhir, tidak ada yang setelah-Mu. Engkau Yang Maha Tinggi, tidak ada yang lebih tinggi dari-Mu, dan Engkau Yang Maha Dekat, tidak ada yang lebih dekat dari-Mu. Lunasilah utang kami dan hindarkan kami dari kemiskinan.",
          "reference": "Muslim [2713](4/2084)."
        },
        {
          "id": 108,
          "group_id": 28,
          "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
          "translation": "Segala puji bagi Allah, yang memberi kami makan dan minum, yang mencukupi kami dan melindungi kami, karena betapa banyak yang tidak memiliki kecukupan dan perlindungan.",
          "reference": "Muslim [2715](4/2085)."
        },
        {
          "id": 109,
          "group_id": 28,
          "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
          "translation": "Ya Allah, Yang Mengetahui yang ghaib dan yang nyata, Pencipta langit dan bumi, Tuhan dan Penguasa segala sesuatu, aku bersaksi bahwa tidak ada yang berhak disembah selain Engkau. Aku berlindung kepada-Mu dari keburukan diriku, dari keburukan setan dan kesyirikannya, dan dari melakukan keburukan terhadap diriku atau membawanya kepada Muslim lain.",
          "reference": "Abû Dâwud [5083](4/317). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/142)."
        },
        {
          "id": 110,
          "group_id": 28,
          "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
          "translation": "Bacalah Surah As-Sajdah dan Surah Al-Mulk.",
          "reference": "At-Tirmidhî [3404] dan An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]. Lihat juga Ŝaĥîĥ Al-Jâmi' [4873](4/255)."
        },
        {
          "id": 111,
          "group_id": 28,
          "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
          "translation": "Ya Allah, aku serahkan jiwaku kepada-Mu, aku percayakan urusanku kepada-Mu, aku hadapkan wajahku kepada-Mu, dan aku sepenuhnya bergantung kepada-Mu, dengan harapan dan ketakutan kepada-Mu. Sungguh tidak ada perlindungan maupun tempat berlindung dari-Mu kecuali kepada-Mu. Aku beriman kepada Kitab-Mu yang telah Engkau turunkan dan kepada Nabi-Mu yang telah Engkau utus.",
          "reference": "Al-Bukhârî [6313,6315,7488](11/113) dan Muslim [2710](4/2081)."
        }
      ]
    },
    {
      "group_id": 29,
      "title": "Saat Membalikkan Badan di Malam Hari",
      "duas": [
        {
          "id": 112,
          "group_id": 29,
          "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
          "translation": "Tidak ada yang berhak disembah selain Allah, Yang Maha Esa, Al-Qahhar. Tuhan langit dan bumi serta segala sesuatu di antara keduanya, Yang Maha Perkasa, Maha Pengampun.",
          "reference": "Al-Hâkim (1/540) dan dia mensahihkannya, Adh-Dhahabî setuju dengannya, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] dan Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757). Lihat juga Ŝaĥîĥ Al-Jâmi' [4693](4/213)."
        }
      ]
    },
    {
      "group_id": 30,
      "title": "Saat Merasa Gelisah, Takut, Khawatir... Selama Tidur",
      "duas": [
        {
          "id": 113,
          "group_id": 30,
          "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
          "translation": "Aku berlindung dengan kalimat-kalimat sempurna dari Allah dari murka-Nya dan siksa-Nya, dari kejahatan hamba-hamba-Nya, dari bisikan setan, dan dari kehadiran mereka.",
          "reference": "Abû Dâwud [3893](4/12). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/171)."
        }
      ]
    },
    {
      "group_id": 31,
      "title": "Saat Melihat Mimpi Baik atau Buruk",
      "duas": [
        {
          "id": 114,
          "group_id": 31,
          "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
          "translation": "Ringkasan tindakan setelah melihat mimpi buruk:(1) Meludah ke kiri tiga kali.(2) Memohon perlindungan kepada Allah dari setan dan kejahatan yang dilihat, tiga kali.(3) Jangan menceritakan mimpi tersebut kepada siapa pun.(4) Berbalik dan tidur di sisi yang berlawanan dari sisi yang sebelumnya.",
          "reference": "Al-Bukhârî [7044] dan Muslim [2261](4/1772)."
        },
        {
          "id": 115,
          "group_id": 31,
          "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
          "translation": "Bangun dan sholat jika kamu ingin melakukannya.",
          "reference": "Muslim [2263](4/1773)."
        }
      ]
    }
  ]
},
  {
    "category_id": 2,
    "title": "Doa-doa Sholat",
    "group": [
      {
        "group_id": 8,
        "title": "Ketika Memulai Wudhu",
        "duas": [
          {
            "id": 12,
            "group_id": 8,
            "dua": "بِسْمِ اللهِ",
            "translation": "Dengan nama Allah.",
            "reference": "Abû Dâwud [101], Ibn Mâjah [399] dan Aĥmad (2/418). Lihat juga Irwâ'-ul-Ghalîl (1/122)."
          }
        ]
      },
      {
        "group_id": 9,
        "title": "Setelah Menyelesaikan Wudhu",
        "duas": [
          {
            "id": 13,
            "group_id": 9,
            "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
            "translation": "Aku bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah, sendiri, tanpa sekutu, dan aku bersaksi bahwa Muhammad adalah hamba dan Rasul-Nya.",
            "reference": "Muslim [234](1/209)."
          },
          {
            "id": 14,
            "group_id": 9,
            "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
            "translation": "Ya Allah, jadikanlah aku termasuk orang-orang yang sering bertaubat dan jadikanlah aku termasuk orang-orang yang bersuci.",
            "reference": "At-Tirmidhî [55](1/78). Lihat juga Ŝaĥiĥ At-Tirmidhî (1/18)."
          },
          {
            "id": 15,
            "group_id": 9,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
            "translation": "Maha Suci Engkau ya Allah, dan segala puji bagi-Mu, aku bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Engkau, aku memohon ampun kepada-Mu dan bertaubat kepada-Mu.",
            "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)."
          }
        ]
      },
      {
        "group_id": 12,
        "title": "Ketika Menuju Masjid",
        "duas": [
          {
            "id": 19,
            "group_id": 12,
            "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
            "translation": "Ya Allah, tempatkan cahaya dalam hatiku, di lidahku cahaya, dan di pendengaranku cahaya, dan di penglihatanku cahaya, dan di atasku cahaya, dan di bawahku cahaya, di kananku cahaya, dan di kiriku cahaya, dan di depanku cahaya, dan di belakangku cahaya. Tempatkan di jiwaku cahaya. Besarkanlah bagiku cahaya, dan tambahkanlah bagiku cahaya. Jadikanlah aku cahaya, dan tambahkanlah cahaya kepadaku. Ya Allah, berilah aku cahaya, dan tempatkan cahaya di saraf-sarafku, di tubuhku cahaya, di darahku cahaya, di rambutku cahaya, dan di kulitku cahaya. [Ya Allah, tempatkan bagiku cahaya di kuburku... dan cahaya di tulang-tulangku] [Tambahkanlah aku cahaya, tambahkanlah aku cahaya, tambahkanlah aku cahaya.]",
            "reference": "(1) Al-Bukhârî [6316](11/116) dan Muslim [763](1/526,529,530).(2) At-Tirmidhî [3419](5/483)."
          }
        ]
      },
      {
        "group_id": 13,
        "title": "Ketika Masuk Masjid",
        "duas": [
          {
            "id": 20,
            "group_id": 13,
            "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
            "translation": "(Masuklah dengan kaki kananmu)(١), dan kemudian katakan: (Aku berlindung kepada Allah, Yang Maha Agung dan dengan Wajah-Nya Yang Mulia, dan kekuasaan-Nya yang kekal dari syaitan yang terkutuk.)(٢), (Dengan nama Allah, dan shalat)(٣)[dan salam sejahtera kepada Rasul Allah](٤), (Ya Allah, bukakanlah untukku pintu-pintu rahmat-Mu)(٥)",
            "reference": "(1) Al-Hakim (1/218) dan dia mengautentikasinya dengan syarat Muslim dan Adh-Dhahabî menyetujuinya, Al-Baihaqî (2/442), dan Al-Albânî menganggapnya hasan dalam Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624).(2) Abû Dâwud [466]. Lihat juga Ŝaĥîĥ Al-Jâmi' [4591].(3) An-Nisâ'i [88] dan Al-Albânî menganggapnya hasan.(4) Abû Dâwud [465](1/126). Lihat juga Ŝaĥîĥ Al-Jâmi' [514](1/528).(5) Muslim [713](1/494), Ibn Mâjah [771] dan Al-Albânî menganggapnya shahih karena shawâhid-nya; lihat Ŝaĥîĥ Ibn Mâjah (1/128-129)."
          }
        ]
      },
      {
        "group_id": 14,
        "title": "Ketika Keluar Masjid",
        "duas": [
          {
            "id": 21,
            "group_id": 14,
            "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢) ",
            "translation": "(Keluar dengan kaki kirimu)(١), dan kemudian katakan: (Dengan nama Allah, dan doa serta salam sejahtera bagi Rasulullah. Ya Allah, aku memohon karunia-Mu. Ya Allah, lindungilah aku dari syaitan yang terkutuk)(٢)",
            "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) dan Al-Albânî menganggapnya hasan dalam Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624)(2) Lihat takhrîj hadits sebelumnya (du'a #20) dan tambahan(اللهم اعصمني من الشيطان الرجيم) dari Ibn Mâjah [773], lihat Ŝaĥîĥ Ibn Mâjah (1/129)."
          }
        ]
      },
      {
        "group_id": 15,
        "title": "Tentang Adzan (seruan untuk sholat)",
        "duas": [
          {
            "id": 22,
            "group_id": 15,
            "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
            "translation": "Seseorang mengulangi apa yang dikatakan oleh muadzin (orang yang mengumandangkan adzan), kecuali ketika dia mengatakan “marilah sholat” atau “marilah menuju kemenangan”, seseorang harus mengatakan “Tidak ada daya dan kekuatan kecuali dengan Allah”.",
            "reference": "Al-Bukhârî [611](1/152) dan Muslim [383](1/288)."
          },
          {
            "id": 23,
            "group_id": 15,
            "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
            "translation": "Segera setelah deklarasi iman yang diserukan oleh muadzin, seseorang mengatakan:(1) ‘Dan aku juga bersaksi bahwa tidak ada Tuhan yang berhak disembah kecuali Allah, sendiri, tanpa sekutu, dan bahwa Muhammad adalah hamba dan Rasul-Nya. Aku ridha Allah sebagai Tuhanku, Muhammad sebagai Rasul-Nya, dan Islam sebagai agamaku.’",
            "reference": "(1) Muslim [386](1/290).(2) Ibn Khuzaîymah [422](1/220)."
          },
          {
            "id": 24,
            "group_id": 15,
            "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
            "translation": "Seseorang harus mengucapkan shalawat kepada Nabi (salla Allaahu ʻalayhi wa salaam) setelah menjawab seruan muadzin.",
            "reference": "Muslim [384](1/288)."
          },
          {
            "id": 25,
            "group_id": 15,
            "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
            "translation": "Katakan: ‘Ya Allah, Pemilik seruan sempurna ini dan Pemilik sholat yang akan didirikan, berikanlah kepada Muhammad Al-Wasîlah dan Al-Faďîlah dan bangkitkanlah dia di maqam yang terpuji yang Engkau janjikan kepadanya. [Sungguh, Engkau tidak pernah menyalahi janji-Mu.]’",
            "reference": "Al-Bukhârî [614](1/152) dan apa yang ada dalam tanda kurung dari Al-Baihaqî (1/410). Shaykh Abdul 'Azîz bin Bâz mengautentikasi sanad dari riwayat terakhir ini dalam Tuĥfah Al-Akhbâr (hal. 38)."
          },
          {
            "id": 26,
            "group_id": 15,
            "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
            "translation": "Seseorang juga harus memohon kepada dirinya sendiri di antara waktu adzan dan iqomah karena doa pada waktu itu tidak ditolak.",
            "reference": "At-Tirmidhî [212], Abû Dâwud [521] dan Ahmad [3/119]. Lihat juga Irwâ'-ul-Ghalîl (1/262)."
          }
        ]
      },
      {
        "group_id": 16,
        "title": "Pada Awal Sholat (setelah takbir)",
        "duas": [
          {
            "id": 27,
            "group_id": 16,
            "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
            "translation": "Ya Allah, jauhkanlah aku dari dosa-dosaku seperti Engkau menjauhkan Timur dari Barat, Ya Allah, sucikanlah aku dari dosa-dosaku seperti baju putih yang dibersihkan dari noda, Ya Allah bersihkanlah aku dari dosa-dosaku dengan salju, air, dan embun.",
            "reference": "Al-Bukhârî [744](1/181) dan Muslim [598](1/419)."
          },
          {
            "id": 28,
            "group_id": 16,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
            "translation": "Maha Suci Engkau ya Allah, dan segala puji bagi-Mu. Maha Suci nama-Mu, Maha Tinggi derajat-Mu dan tidak ada Tuhan selain Engkau.",
            "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), dan Ibn Mâjah [804, 806]. Lihat juga Ŝaĥîĥ At-Tirmidhî (1/77) dan Ŝaĥîĥ Ibn Mâjah (1/135)."
          },
          {
            "id": 29,
            "group_id": 16,
            "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
            "translation": "Aku hadapkan wajahku dengan tulus kepada Yang telah menciptakan langit dan bumi dan aku bukanlah dari orang-orang yang mempersekutukan Allah. Sesungguhnya sholatku, ibadahku, hidupku dan matiku hanyalah untuk Allah, Tuhan seluruh alam, tiada sekutu bagi-Nya, dengan demikian aku diperintahkan dan aku termasuk orang-orang yang berserah diri. Ya Allah, Engkaulah Raja, tiada Tuhan selain Engkau. Engkaulah Tuhanku dan aku adalah hamba-Mu, aku telah menzalimi diriku sendiri dan mengakui dosa-dosaku, maka ampunilah semua dosa-dosaku karena tidak ada yang mengampuni dosa kecuali Engkau. Bimbinglah aku ke akhlak yang terbaik karena tidak ada yang dapat membimbing ke akhlak yang terbaik kecuali Engkau, dan jauhkanlah aku dari keburukan akhlak, karena tidak ada yang dapat menjauhkan aku dari keburukan kecuali Engkau. Ini aku di hadapan-Mu, siap melayani-Mu. Semua kebaikan ada di tangan-Mu dan keburukan tidak berasal dari-Mu. Aku ada dengan kehendak-Mu dan akan kembali kepada-Mu. Maha Suci Engkau, Maha Tinggi, aku memohon ampun kepada-Mu dan bertaubat kepada-Mu.",
            "reference": "Muslim [771](1/534)."
          },
          {
            "id": 30,
            "group_id": 16,
            "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
            "translation": "Ya Allah, Tuhannya Jibril, Mikail dan Israfil (Malaikat Agung), Pencipta langit dan bumi, Yang mengetahui yang gaib dan yang nyata. Engkaulah yang mengadili hamba-hamba-Mu dalam apa yang mereka perselisihkan. Tunjukkanlah aku kepada kebenaran dengan izin-Mu, karena sesungguhnya Engkau membimbing siapa yang Engkau kehendaki ke jalan yang lurus.",
            "reference": "Muslim [770](1/534)."
          },
          {
            "id": 31,
            "group_id": 16,
            "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
            "translation": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, segala puji bagi Allah, segala puji bagi Allah, segala puji bagi Allah, dan aku menyucikan Allah di pagi hari dan di sore hari.’ (tiga kali)‘Aku berlindung kepada Allah dari setan: dari kesombongannya, puisinya dan kegilaannya.",
            "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), dan Muslim [601](1/420) dengan tambahan: (مِنْ نَفْحِهِ )."
          },
          {
            "id": 32,
            "group_id": 16,
            "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ، وَ لِقَاؤُكَ الحَقُّ، وَ الجَنَّةُ حَقٌّ، وَ النَّارُ حَقٌّ، وَ النَّبِيُّونَ حَقٌّ، وَ مُحَمَّدٌﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ][اللهم لَكَ أسْلَمْتُ، وَ عَلَيْكَ تَوَكَّلْتُ، وَ بِكَ آمَنْتُ، وَ إلَيْكَ أنَبْتُ، وَ بِكَ خَاصَمْتُ، وَ إلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، و أخَّرْتُ، وَ مَا أسْرَرْتُ، وَ مَا أعْلَنْتُ][أنْتَ المُقَدِّمُ، وَ أنْتَ المُؤَخِّرُ لَا إله إلَّا أنْتَ][أنْتَ إلَهِي لَا إله إلَّا أنْتَ].",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) akan mengatakan (sebagai doa pembukaan dalam sholat) ketika bangun dari tidur untuk melaksanakan sholat di malam hari:‘Ya Allah, segala puji bagi-Mu, Engkaulah Cahaya langit dan bumi serta segala yang ada di dalamnya. Segala puji bagi-Mu, Engkaulah Pemelihara langit dan bumi serta segala yang ada di dalamnya. Segala puji bagi-Mu. Engkaulah Tuhan langit dan bumi serta segala yang ada di dalamnya. Segala puji bagi-Mu dan kerajaan langit dan bumi serta segala yang ada di dalamnya. Segala puji bagi-Mu, Engkaulah Raja langit dan bumi dan segala yang ada di dalamnya. Segala puji bagi-Mu. Engkaulah yang benar, janji-Mu adalah benar, Firman-Mu adalah benar, dan hari di mana kami akan menemui-Mu adalah benar, surga adalah benar, neraka adalah benar, para nabi adalah benar, Muhammad (salla Allaahu ʻalayhi wa salaam) adalah benar, dan hari kiamat adalah benar. Ya Allah, kepada-Mu aku telah menyerah, kepada-Mu aku telah bergantung, dan kepada-Mu aku telah beriman, dan kepada-Mu aku telah bertobat, dan kepada-Mu aku mengajukan argumen, dan kepada-Mu aku mengajukan penghakiman. Maka ampunilah aku atas dosa-dosa yang telah aku lakukan dan yang akan aku lakukan, dan apa yang aku sembunyikan dan apa yang aku nyatakan. Engkaulah Al-Muqqaddim dan Al-Mu’akhkhir. Tidak ada Tuhan yang berhak disembah kecuali Engkau, Engkaulah Tuhanku, tidak ada Tuhan yang berhak disembah kecuali Engkau.’",
            "reference": "Al-Bukhârî (3/3), (11/116), dan [1120](13/371, 423, 465) dan Muslim [769](1/532) dalam bentuk yang diringkas."
          }
        ]
      },
      {
    "group_id": 17,
    "title": "Ketika Ruku' Dalam Sholat",
    "duas": [
      {
        "id": 33,
        "group_id": 17,
        "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
        "translation": "Maha Suci Tuhanku Yang Maha Agung. (Tiga kali)",
        "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) dan Aĥmad (5/382, 394). Lihat juga Ŝaĥîĥ At-Tirmidhî (1/83)."
      },
      {
        "id": 34,
        "group_id": 17,
        "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
        "translation": "Maha Suci Engkau ya Allah, Tuhan kami dan segala puji bagi-Mu. Ya Allah, ampunilah aku.",
        "reference": "Al-Bukhârî [794](1/99) dan Muslim [484](1/350)."
      },
      {
        "id": 35,
        "group_id": 17,
        "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
        "translation": "Maha Suci dan Maha Suci (Dia), Tuhan para malaikat dan Ruh (yaitu Jibril).",
        "reference": "Muslim [487](1/353) dan Abû Dâwud [872](1/230)."
      },
      {
        "id": 36,
        "group_id": 17,
        "dua": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
        "translation": "Ya Allah, kepada-Mu aku ruku', kepada-Mu aku beriman, kepada-Mu aku berserah diri. Pendengaranku, penglihatanku, pikiranku, tulangku, uratku, dan apa yang ditopang oleh kakiku, semuanya tunduk kepada-Mu.",
        "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] dan An-Nisâ'i [2/130]. Tambahan ditemukan dalam Ibn Ĥibân, lihat Ŝaĥîĥ Ibn Ĥibân [1901] dan Ŝaĥîĥ Ibn Khuzaîmah [607]."
      },
      {
        "id": 37,
        "group_id": 17,
        "dua": "سُبْحَانَ ذِي الْجَبَروتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
        "translation": "Maha Suci Dia, Pemilik kekuasaan penuh, kerajaan, kemuliaan, dan kebesaran.",
        "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) dan Aĥmad (6/24)."
      }
    ]
  },
      {
        "group_id": 18,
        "title": "Ketika Bangkit Dari Ruku'",
        "duas": [
          {
            "id": 38,
            "group_id": 18,
            "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
            "translation": "Semoga Allah mendengar orang yang memuji-Nya.",
            "reference": "Al-Bukhârî [795](2/282)."
          },
          {
            "id": 39,
            "group_id": 18,
            "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
            "translation": "Ya Tuhan kami, bagi-Mu segala puji, pujian yang banyak, baik, dan diberkahi.",
            "reference": "Al-Bukhârî [799](2/284)."
          },
          {
            "id": 40,
            "group_id": 18,
            "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
            "translation": "Langit dan bumi serta segala yang ada di antara keduanya penuh dengan pujian-Mu, dan segala yang Engkau kehendaki setelah itu juga penuh dengan pujian-Mu. Wahai Pemilik pujian dan keagungan, ucapan terbaik yang diucapkan oleh seorang hamba. Kami semua adalah hamba-Mu. Ya Allah, tidak ada yang dapat menghalangi apa yang Engkau beri, dan tidak ada yang dapat memberi apa yang Engkau cegah, dan kekayaan tidak bermanfaat bagi siapa pun dari-Mu, kecuali kekayaan yang berasal dari-Mu.",
            "reference": "Muslim [477](1/346)."
          }
        ]
      },
      {
        "group_id": 19,
        "title": "Ketika Sujud Dalam Sholat",
        "duas": [
          {
            "id": 41,
            "group_id": 19,
            "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
            "translation": "Maha Suci Tuhanku Yang Maha Tinggi. (Tiga kali)",
            "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] dan Aĥmad (5/382, 394). Lihat juga Ŝaĥîĥ At-Tirmidhî (1/83)."
      },
          {
            "id": 42,
            "group_id": 19,
            "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
            "translation": "Maha Suci Engkau ya Allah, Tuhan kami dan segala puji bagi-Mu. Ya Allah, ampunilah aku.",
            "reference": "Al-Bukhârî [794](1/99) dan Muslim [484](1/350)."
          },
          {
            "id": 43,
            "group_id": 19,
            "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ",
            "translation": "Maha Suci dan Maha Suci (Dia), Tuhan para malaikat dan Ruh (yaitu Jibril).",
            "reference": "Muslim (1/533)."
          },
          {
            "id": 44,
            "group_id": 19,
            "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
            "translation": "Ya Allah, kepada-Mu aku sujud, kepada-Mu aku beriman, dan kepada-Mu aku berserah diri. Wajahku bersujud di hadapan Dia yang menciptakannya, membentuknya, dan mengaruniakan pendengaran dan penglihatannya. Maha Suci Allah, sebaik-baik pencipta.",
            "reference": "Muslim [771](1/534)."
          },
          {
        "id": 45,
        "group_id": 19,
        "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ",
        "translation": "Maha Suci Dia yang memiliki keagungan, kerajaan, kebesaran, dan kemuliaan.",
        "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), dan An-Nisâ'i (2/191). Al-Albânî mengesahkannya dalam Ŝaĥîĥ Abî Dâwud (1/166)."
      },
          {
            "id": 46,
            "group_id": 19,
            "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
            "translation": "Ya Allah, ampunilah semua dosaku, baik yang kecil maupun besar, yang pertama dan terakhir, yang tampak dan yang tersembunyi.",
            "reference": "Muslim [483](1/350)."
          },
          {
            "id": 47,
            "group_id": 19,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
            "translation": "Ya Allah, aku berlindung dengan keridhaan-Mu dari murka-Mu, dan dengan keselamatan-Mu dari hukuman-Mu, dan aku berlindung kepada-Mu dari-Mu. Aku tidak dapat menghitung pujian untuk-Mu, Engkau sebagaimana yang telah Engkau puji atas diri-Mu sendiri.",
            "reference": "Muslim [486](1/352)."
          }
    ]
  },
      {
        "group_id": 20,
        "title": "Di Antara Dua Sujud",
        "duas": [
          {
            "id": 48,
            "group_id": 20,
            "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
            "translation": "Tuhanku, ampunilah aku, Tuhanku, ampunilah aku.",
            "reference": "Abû Dâwud [874](1/231). Lihat juga Ŝaĥîĥ Ibn Mâjah (1/148)."
          },
          {
            "id": 49,
            "group_id": 20,
            "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
            "translation": "Ya Allah, ampunilah aku, rahmatilah aku, berilah petunjuk kepadaku, perbaikilah aku, sehatkanlah aku, berilah rezeki kepadaku, dan tinggikanlah derajatku.",
            "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]. Lihat juga Ŝaĥîĥ At-Tirmidhî (1/90) dan Ŝaĥîĥ Ibn Mâjah (1/148)."
          }
        ]
      },
      {
        "group_id": 21,
        "title": "Ketika Sujud Karena Bacaan Al-Quran",
        "duas": [
          {
            "id": 50,
            "group_id": 21,
            "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
            "translation": "Wajahku sujud kepada Dia yang menciptakannya, yang membuka pendengaran dan penglihatannya dengan kekuatan-Nya (Maha Suci Allah, Pencipta terbaik).",
            "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) dan Al-Hâkim menyatakan sahih, Adz-Dzahabi menyetujuinya (1/220). Bagian yang di dalam tanda kurung berasal dari Surah Al-Mu’minun."
      },
      {
        "id": 51,
        "group_id": 21,
        "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
        "translation": "Ya Allah, catatlah bagiku pahala atas sujud ini, dan hapuslah dosa dariku karenanya. Jadikanlah sujud ini sebagai simpanan di sisi-Mu, dan terimalah ia dariku sebagaimana Engkau menerimanya dari hamba-Mu Daud.",
        "reference": "At-Tirmidhî [579](2/473) dan Al-Hâkim menyatakan sahih, Adz-Dzahabi menyetujuinya (1/219)."
      }
    ]
  },
      {
        "group_id": 22,
        "title": "Tasyahhud",
        "duas": [
          {
            "id": 52,
            "group_id": 22,
            "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
            "translation": "Penghormatan adalah milik Allah. Segala bentuk ibadah dan kebaikan adalah untuk-Nya. Semoga kesejahteraan, rahmat Allah, dan keberkahan-Nya terlimpah atasmu, wahai Nabi. Semoga kesejahteraan tercurah kepada kami dan hamba-hamba Allah yang saleh. Aku bersaksi bahwa tiada Tuhan selain Allah, dan aku bersaksi bahwa Muhammad adalah hamba dan Rasul-Nya.",
            "reference": "Al-Bukhârî [831](2/311) dan Muslim [402](1/301)."
          }
        ]
      },
      {
        "group_id": 23,
        "title": "Shalawat Kepada Nabi Setelah Tasyahhud",
        "duas": [
          {
            "id": 53,
            "group_id": 23,
            "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
            "translation": "Ya Allah, limpahkanlah shalawat kepada Muhammad dan keluarganya, sebagaimana Engkau melimpahkan shalawat kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji, Maha Mulia. Ya Allah, limpahkanlah berkah kepada Muhammad dan keluarganya, sebagaimana Engkau melimpahkan berkah kepada Ibrahim dan keluarganya. Sesungguhnya Engkau Maha Terpuji, Maha Mulia.",
            "reference": "Al-Bukhârî [337](6/408)."
          },
          {
            "id": 54,
            "group_id": 23,
            "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
            "translation": "Ya Allah, limpahkanlah shalawat kepada Muhammad, istri-istrinya, dan keturunannya, sebagaimana Engkau melimpahkan shalawat kepada keluarga Ibrahim. Dan limpahkanlah berkah kepada Muhammad, istri-istrinya, dan keturunannya, sebagaimana Engkau melimpahkan berkah kepada keluarga Ibrahim. Sesungguhnya Engkau Maha Terpuji, Maha Mulia.",
            "reference": "Al-Bukhârî [3369](2/407) dan Muslim [407](1/306)."
          }
        ]
      },
      {
        "group_id": 24,
        "title": "Setelah Tasyahhud Terakhir dan Sebelum Salam",
        "duas": [
          {
            "id": 55,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
            "translation": "Ya Allah, aku berlindung kepada-Mu dari siksa kubur, dari siksa neraka Jahannam, dari fitnah kehidupan dan kematian, serta dari kejahatan fitnah Al-Masih Ad-Dajjal.",
            "reference": "Al-Bukhârî 2/102 dan Muslim 1/412."
          },
          {
            "id": 56,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
            "translation": "Ya Allah, aku berlindung kepada-Mu dari siksa kubur, dan aku berlindung kepada-Mu dari fitnah Al-Masih Ad-Dajjal, serta aku berlindung kepada-Mu dari fitnah kehidupan dan kematian. Ya Allah, aku berlindung kepada-Mu dari dosa dan utang.",
            "reference": "Al-Bukhârî [832](2/102) dan Muslim [589](1/412)."
          },
          {
            "id": 57,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
            "translation": "Ya Allah, sesungguhnya aku telah menzalimi diriku dengan kezhaliman yang banyak, dan tidak ada yang dapat mengampuni dosa selain Engkau, maka ampunilah aku dengan ampunan dari sisi-Mu, dan kasihanilah aku. Sesungguhnya Engkau Maha Pengampun lagi Maha Penyayang.",
            "reference": "Al-Bukhârî [7387](8/168) dan Muslim [2705](4/2078)."
  },
          {
            "id": 58,
            "group_id": 24,
            "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
            "translation": "Ya Allah, ampunilah dosaku yang telah lalu, yang akan datang, yang aku sembunyikan, yang aku tampakkan, dan apa saja yang aku telah berlebihan dalam melakukannya, dan apa yang lebih Engkau ketahui daripadaku. Engkau adalah Al-Muqaddim dan Al-Mu’akhkhir. Tidak ada Tuhan selain Engkau.",
            "reference": "Muslim [771](1/534)."
          },
          {
            "id": 59,
            "group_id": 24,
            "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
            "translation": "Ya Allah, bantulah aku untuk mengingat-Mu, bersyukur kepada-Mu, dan beribadah dengan cara yang terbaik kepada-Mu.",
            "reference": "Abû Dâwud [1522](2/86) dan An-Nisâ'i (3/53). Al-Albânî mengesahkan hadits ini dalam Ŝaĥîĥ Abî Dâwud (1/284)."
          },
          {
            "id": 60,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
            "translation": "Ya Allah, aku berlindung kepada-Mu dari sifat kikir, dari sifat pengecut, dari dikembalikan pada usia yang sangat tua, dari fitnah dunia, dan dari siksa kubur.",
            "reference": "Al-Bukhârî [2822](6/35)."
          },
          {
            "id": 61,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
            "translation": "Ya Allah, aku memohon kepada-Mu surga, dan aku berlindung kepada-Mu dari neraka.",
            "reference": "Abû Dâwud [792] dan Ibn Mâjah, lihat Ŝaĥîĥ Ibn Mâjah (2/328)."
          },
          {
            "id": 62,
            "group_id": 24,
            "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
            "translation": "Ya Allah, dengan ilmu-Mu tentang yang gaib dan kekuasaan-Mu atas ciptaan, hidupkanlah aku selama kehidupan itu lebih baik bagiku, dan wafatkanlah aku jika kematian lebih baik bagiku. Ya Allah, aku memohon kepada-Mu rasa takut kepada-Mu dalam keadaan gaib maupun terang, aku memohon kepada-Mu kalimat yang benar saat ridha maupun marah, dan aku memohon kepada-Mu sikap moderat saat kaya maupun miskin. Aku memohon kepada-Mu kenikmatan yang tidak pernah habis, kesejukan mata yang tidak pernah terputus, dan ridha setelah keputusan-Mu. Aku memohon kepada-Mu kehidupan yang tenang setelah mati, kenikmatan melihat wajah-Mu, dan kerinduan untuk bertemu dengan-Mu tanpa mengalami bahaya yang membahayakan atau fitnah yang menyesatkan. Ya Allah, hiasilah kami dengan perhiasan iman, dan jadikan kami orang-orang yang memberi petunjuk dan mendapat petunjuk.",
            "reference": "An-Nisâ'i (4/54, 55) dan Aĥmad (4/364). Al-Albânî mengesahkan hadits ini dalam Ŝaĥîĥ An-Nisâ'i (1/281)."
          },
          {
            "id": 63,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
            "translation": "Ya Allah, aku memohon kepada-Mu, wahai Allah, karena Engkau adalah Yang Maha Esa, As-Shamad, yang tidak beranak dan tidak dilahirkan, serta tidak ada sesuatu yang setara dengan-Nya, agar Engkau mengampuni dosaku. Sesungguhnya Engkau adalah Maha Pengampun lagi Maha Penyayang.",
            "reference": "An-Nisâ'i (3/52) dan Aĥmad (4/238). Al-Albânî mengesahkan hadits ini dalam Ŝaĥîĥ An-Nisâ'i (1/280)."
          },
          {
            "id": 64,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
            "translation": "Ya Allah, aku memohon kepada-Mu karena segala puji adalah milik-Mu, tidak ada Tuhan selain Engkau, Engkau Maha Esa, tiada sekutu bagi-Mu, Maha Pemberi nikmat, Pencipta langit dan bumi, Pemilik keagungan dan kemuliaan, Yang Maha Hidup, Yang Maha Berdiri sendiri dan mengatur segala sesuatu. Sesungguhnya aku memohon kepada-Mu surga dan aku berlindung kepada-Mu dari neraka.",
            "reference": "Abû Dâwud [1495], An-Nisâ'i (3/52), Ibn Mâjah [3858] dan At-Tirmidhî [3544]. Juga lihat Ŝaĥîĥ Ibn Mâjah (2/329)."
          },
          {
            "id": 65,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
            "translation": "Ya Allah, aku memohon kepada-Mu karena aku bersaksi bahwa Engkau adalah Allah, tiada Tuhan selain Engkau, Yang Maha Esa, As-Shamad, yang tidak beranak dan tidak dilahirkan, serta tidak ada sesuatu yang setara dengan-Nya.",
            "reference": "Abû Dâwud [1493](2/62), At-Tirmidhî [3475](5/515), Ibn Mâjah [3857](2/1267) dan Aĥmad (5/360). Juga lihat Ŝaĥîĥ Ibn Mâjah (2/329) dan Ŝaĥîĥ At-Tirmidhî (3/163)."
          }
        ]
      },
      {
        "group_id": 25,
        "title": "Setelah Salam",
        "duas": [
          {
            "id": 66,
            "group_id": 25,
            "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
            "translation": "(1) Aku memohon ampun kepada Allah (Tiga kali)(2) Ya Allah, Engkau adalah As-Salam dan dari-Mu-lah kedamaian, Maha diberkati Engkau, wahai Pemilik Keagungan dan Kemuliaan.",
            "reference": "Muslim [591](1/414)."
          },
          {
            "id": 67,
            "group_id": 25,
            "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
            "translation": "Tiada Tuhan selain Allah, tiada sekutu bagi-Nya, milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu (Tiga kali). Ya Allah, tidak ada yang dapat mencegah apa yang Engkau berikan, dan tidak ada yang dapat memberikan apa yang Engkau cegah, serta tidak bermanfaat bagi siapa pun kekayaannya jika berasal dari-Mu.",
            "reference": "Al-Bukhârî [844](1/255) dan Muslim [593](1/414)."
          },
          {
            "id": 68,
            "group_id": 25,
            "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
            "translation": "Tiada Tuhan selain Allah, tiada sekutu bagi-Nya, milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu. Tidak ada daya dan kekuatan kecuali dengan Allah. Tiada Tuhan selain Allah, dan kami tidak menyembah kecuali kepada-Nya. Milik-Nya segala nikmat, anugerah, dan pujian yang baik. Tiada Tuhan selain Allah, dan kami mengikhlaskan agama ini kepada-Nya, meskipun orang-orang kafir membencinya.",
            "reference": "Muslim [594](1/415)."
          },
          {
            "id": 69,
            "group_id": 25,
            "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
            "translation": "(1) Maha Suci Allah, segala puji bagi Allah, dan Allah Maha Besar. (Tiga puluh tiga kali)(2) Tiada Tuhan selain Allah, tiada sekutu bagi-Nya, milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu.",
            "reference": "Muslim [597](1/418)."
          },
          {
            "id": 70,
            "group_id": 25,
            "dua": "(١) (قُلْ هُوَ اللَّهُ أَحَدٌ...)(٢) (قٌلْ أَعُوْذُ بِرَبَّ الْفَلَقِ...)(٣) (قُلْ أَعُوْذُ بِرَبَّ النَّاسِ...)",
            "translation": "Tiga surah berikut dibaca sekali setelah salat Zuhur, Asar, dan Isya, serta tiga kali setelah Fajar dan Maghrib:(1) Al-Ikhlas(2) Al-Falaq(3) An-Naas",
            "reference": "Abû Dâwud [1523](2/86) dan An-Nisâ'i (3/68). Juga lihat Ŝaĥîĥ At-Tirmidhî (2/8)."
          },
          {
            "id": 71,
            "group_id": 25,
            "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
            "translation": "Sunnah juga untuk membaca Ayat al-Kursi setelah setiap salat: [Al-Baqarah: 255]",
            "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) dan Ibn Sinnî [121]. Al-Albânî mengesahkan hadits ini dalam Ŝaĥîĥ Al-Jâmi' [6464](5/339) dan Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [972](2/697)."
          },
          {
            "id": 72,
            "group_id": 25,
            "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
            "translation": "Tiada Tuhan selain Allah, tiada sekutu bagi-Nya, milik-Nya segala kerajaan dan pujian, Dia Yang Menghidupkan dan Mematikan, dan Dia Maha Kuasa atas segala sesuatu. (Sepuluh kali setelah salat Maghrib dan Fajar)",
            "reference": "At-Tirmidhî [3474](5/515) dan Aĥmad (4/227). Juga lihat Zâd Al-Ma'âd (1/300)."
          },
          {
            "id": 73,
            "group_id": 25,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
            "translation": "Ya Allah, aku memohon kepada-Mu ilmu yang bermanfaat, rezeki yang baik, dan amal yang diterima (Setelah salam dari salat Fajar).",
            "reference": "Ibn Mâjah [925]. Juga lihat Ŝaĥîĥ Ibn Mâjah (1/152) dan Majmu' Az-Zawâ'id [95](10/111)."
          }
        ]
      },
      {
        "group_id": 32,
        "title": "Qunoot Al-Witr",
        "duas": [
          {
            "id": 116,
            "group_id": 32,
            "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
            "translation": "Ya Allah, tunjukilah aku bersama orang-orang yang Engkau beri petunjuk, lindungilah aku bersama orang-orang yang Engkau lindungi, jadilah pelindung bagiku seperti kepada orang-orang yang Engkau lindungi, berkahilah bagiku atas apa yang Engkau karuniakan. Jauhkan aku dari keburukan yang telah Engkau takdirkan, karena Engkau menetapkan dan tidak ada yang dapat menetapkan di atas Engkau. Barangsiapa yang Engkau beri perlindungan tidak akan terhina dan barangsiapa yang Engkau musuhi tidak akan pernah mulia. Maha Berkah Engkau wahai Tuhan kami, Maha Tinggi Engkau.",
            "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). Yang ada dalam tanda kurung berasal dari Al-Baihaqî. Juga lihat Ŝaĥîĥ At-Tirmidhî (1/144), Ŝaĥîĥ Ibn Mâjah (1/194), dan Irwâ'-ul-Ghalîl (2/172)."
          },
          {
            "id": 117,
            "group_id": 32,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
            "translation": "Ya Allah, aku berlindung dengan ridha-Mu dari kemurkaan-Mu, dan dengan ampunan-Mu dari hukuman-Mu, serta aku berlindung pada-Mu dari-Mu. Aku tidak bisa menghitung pujian terhadap-Mu. Engkau sebagaimana yang Engkau puji untuk diri-Mu sendiri.",
            "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], dan Aĥmad (1/96,118,150). Juga lihat Ŝaĥîĥ At-Tirmidhî (3/180), Ŝaĥîĥ Ibn Mâjah (1/194) dan Irwâ'-ul-Ghalîl (2/175)."
          },
          {
            "id": 118,
            "group_id": 32,
            "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
            "translation": "Ya Allah, hanya kepada-Mu kami menyembah, kepada-Mu kami salat dan sujud, kepada-Mu kami bersegera, dan kami mengabdi. Kami mengharapkan rahmat-Mu dan takut akan azab-Mu. Sesungguhnya azab-Mu akan menimpa orang-orang kafir. Ya Allah, kami meminta pertolongan kepada-Mu, kami memohon ampunan-Mu, kami memuji-Mu dengan segala kebaikan, kami tidak mengingkari-Mu. Kami beriman kepada-Mu, kami tunduk kepada-Mu, dan kami memisahkan diri dari orang-orang yang ingkar kepada-Mu.",
            "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) dan dia menyatakan sanadnya Ŝaĥîĥ. Al-Albânî mengatakan dalam [Irwâ'-ul-Ghalîl](2/170) bahwa sanadnya Ŝaĥîĥ dan riwayat tersebut mawqûf dari 'Umar (RadiAllah ʻanhu)."
          }
        ]
      },
      {
        "group_id": 33,
        "title": "Segera Setelah Salam Dari Salat Witr",
        "duas": [
          {
            "id": 119,
            "group_id": 33,
            "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
            "translation": "Mahasuci Sang Raja, Yang Maha Suci (Tiga kali, dan pada kali ketiga Nabi ﷺ mengeraskan suara dan memanjangkannya sambil mengatakan: [Tuhan para malaikat dan Ruh]).",
            "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) dan tambahan dalam kurung berasal darinya serta sanadnya sahih. Juga lihat penelitian Shu'aîb dan 'Abdul Qadir Al-Arnâ'ûť dalam Zâd al-Ma'âd (1/337)."
          }
        ]
      },
      {
        "group_id": 42,
        "title": "Untuk Orang Yang Terganggu Bisikan Dalam Salat Atau Bacaan",
        "duas": [
          {
            "id": 138,
            "group_id": 42,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
            "translation": "Aku berlindung kepada Allah dari setan yang terkutuk', dan (meludah kering) ke kiri tiga kali.",
            "reference": "Muslim [2203](4/1729)."
          }
        ]
      }
      ]
},
  {
    "category_id": 3,
    "title": "Memuji Allah",
    "group": [
      {
        "group_id": 26,
        "title": "Untuk Meminta Petunjuk Dalam Membuat Keputusan Atau Memilih Jalan Yang Tepat",
        "duas": [
          {
            "id": 74,
            "group_id": 26,
            "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
            "translation": "Dari Jabir Ibn ‘Abdullah (RA), ia berkata: ‘Rasulullah (salla Allaahu ʻalayhi wa salaam) mengajarkan kepada kami untuk memohon petunjuk dalam segala urusan kami, sebagaimana ia mengajarkan kepada kami satu bab dari Al-Qur'an. Dia (salla Allaahu ʻalayhi wa salaam) berkata ‘Jika salah seorang dari kalian berniat untuk melakukan sesuatu, maka hendaklah ia melaksanakan dua rakaat salat sunnah (dua rakaat nâfilah) dan setelah itu ia harus berdoa:‘Ya Allah, aku memohon petunjuk-Mu dengan ilmu-Mu, dan dengan kekuatan-Mu aku memohon kekuatan, dan aku meminta dari keutamaan-Mu yang agung, karena sesungguhnya Engkau mampu sementara aku tidak, dan sesungguhnya Engkau mengetahui sementara aku tidak, dan Engkau adalah Maha Mengetahui yang ghaib. Ya Allah, jika Engkau mengetahui urusan ini - dan di sini ia menyebutkan keperluannya - baik bagiku dalam hal agamaku, kehidupanku, dan akhiratku, maka takdirkanlah dan mudahkanlah bagiku, kemudian berkahilah aku di dalamnya. Dan jika Engkau mengetahui bahwa urusan ini buruk bagiku dalam hal agamaku, kehidupanku, dan akhiratku, maka jauhkanlah urusan ini dariku dan jauhkanlah aku darinya, dan takdirkanlah kebaikan bagiku di mana pun itu berada dan buatlah aku ridha dengannya.'",
            "reference": "(1) Al-Bukhârî [1162](7/162).(2) Qur'an Al-'Imran [3:159]."
          }
        ]
      },
      {
        "group_id": 43,
        "title": "Bagi Orang Yang Urusannya Menjadi Sulit",
        "duas": [
          {
            "id": 139,
            "group_id": 43,
            "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
            "translation": "Ya Allah, tidak ada kemudahan kecuali yang Engkau buat mudah, dan Engkau menjadikan kesulitan, jika Engkau menghendaki, menjadi mudah.",
            "reference": "Ibn Ĥibbân dalam Ŝaĥîĥ [2427], Mawârid dan Ibn As-Sunnî [351]. Dan Ibn Ĥajar berkata: \"Hadis ini adalah Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť juga menyatakannya sebagai Ŝaĥîĥ dalam takhrîj Athkâr Imam Nawawi (hal. 106)."
          }
        ]
      },
      {
        "group_id": 44,
        "title": "Ketika Melakukan Dosa",
        "duas": [
          {
            "id": 140,
            "group_id": 44,
            "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
            "translation": "Setiap hamba yang melakukan dosa dan kemudian melakukan wudhu dengan baik, melaksanakan dua rakaat salat, lalu memohon ampun kepada Allah, maka Allah akan mengampuninya.",
            "reference": "Abû Dâwud [1521](2/86) dan At-Tirmidhî [406,3006](2/257). Al-Albânî menyatakan hadis ini sahih dalam Ŝaĥîĥ Abî Dâwud (1/283)."
          }
        ]
      },
      {
        "group_id": 46,
        "title": "Ketika Ditimpa Musibah atau Dihadapkan pada Sebuah Urusan",
        "duas": [
          {
            "id": 144,
            "group_id": 46,
            "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
            "translation": "Takdir Allah, dan apa yang Dia kehendaki, Dia lakukan.",
            "reference": "Muslim [2664](4/2052)."
          }
        ]
      },
      {
        "group_id": 88,
        "title": "Perlindungan Dari Dajjal",
        "duas": [
          {
            "id": 199,
            "group_id": 88,
            "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
            "translation": "Barangsiapa yang menghafal sepuluh ayat pertama dari Surah Al-Kahf, dia akan terlindungi dari Dajjal.",
            "reference": "Muslim [809](1/555)."
          }
        ]
      },
      {
        "group_id": 107,
        "title": "Keutamaan Mengirimkan Shalawat Atas Nabi (SAW)",
        "duas": [
          {
            "id": 219,
            "group_id": 107,
            "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: 'Barangsiapa yang mengirimkan satu shalawat kepadaku, Allah akan mengirimkan sepuluh shalawat kepadanya.'",
            "reference": "Muslim [408](1/288)."
          },
          {
            "id": 220,
            "group_id": 107,
            "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: 'Jangan jadikan kuburanku sebagai tempat perayaan. Kirimkan shalawat kepadaku, karena sesungguhnya shalawat kalian akan sampai kepadaku di mana pun kalian berada.'",
            "reference": "Abû Dâwud [2042](2/218) dan Aĥmad (2/367). Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Abû Dâwud (2/383)."
          },
          {
            "id": 221,
            "group_id": 107,
            "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: 'Seorang yang pelit adalah dia yang ketika namaku disebut di hadapannya, dia tidak mengirimkan shalawat kepadaku.'",
            "reference": "At-Tirmidhî [3546](5/551). Lihat juga Ŝaĥîĥ Al-Jâmi' [2787](3/25) dan Ŝaĥîĥ At-Tirmidhî (3/177)."
          },
          {
            "id": 222,
            "group_id": 107,
            "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: 'Sesungguhnya Allah memiliki malaikat-malaikat yang berkeliling di bumi untuk menyampaikan salam dari umatku kepadaku.'",
            "reference": "An-Nisâ'i (3/43) dan Al-Hâkim (2/421). Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ An-Nisâ'i (1/274)."
          },
          {
            "id": 223,
            "group_id": 107,
            "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: 'Setiap kali seseorang memberi salam kepadaku, Allah mengembalikan jiwaku agar aku dapat menjawab salam tersebut.'",
            "reference": "Abû Dâwud (2041). Al-Albânî menyatakannya sebagai ĥasan dalam Ŝaĥîĥ Abû Dâwud (1/283)."
          }
        ]
      },
      {
        "group_id": 129,
        "title": "Memohon Ampunan dan Tobat",
        "duas": [
          {
            "id": 248,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: 'Demi Allah, aku memohon ampun kepada Allah dan bertobat kepada-Nya lebih dari tujuh puluh kali dalam sehari.'",
            "reference": "Al-Bukhârî [6307](11/101)."
          },
          {
            "id": 249,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: 'Wahai manusia, bertobatlah kepada Allah, karena sesungguhnya aku bertobat kepada-Nya seratus kali dalam sehari.'",
            "reference": "Muslim [2702](4/2076)."
          },
          {
            "id": 250,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
            "translation": "Aku memohon ampun kepada Allah yang Maha Agung, yang tidak ada Tuhan yang berhak disembah selain Dia, Yang Maha Hidup, Yang Berdiri Sendiri, dan aku bertobat kepada-Nya.",
            "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511) dan dia menyatakannya sahih dan Adh-Dhahabî setuju dengannya. Al-Albânî menyatakannya sahih, lihat Ŝaĥîĥ At-Tirmidhî (3/182) dan Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/389-390) dengan penelitian oleh Arnâ'ûť."
          },
          {
            "id": 251,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: 'Waktu yang paling dekat seorang hamba dengan Tuhannya adalah di tengah malam terakhir, maka jika kamu bisa termasuk dari mereka yang mengingat Allah pada saat itu, maka lakukanlah.'",
            "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), dan Al-Hâkim. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/183) dan Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/144) dengan penelitian oleh Arnâ'ûť."
          },
          {
            "id": 252,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: 'Saat terdekat seorang hamba dengan Tuhannya adalah ketika ia bersujud, maka perbanyaklah doa dalam sujud.'",
            "reference": "Muslim [482](1/350)."
          },
          {
            "id": 253,
            "group_id": 129,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: 'Sesungguhnya hatiku sering merasa terganggu, dan aku benar-benar memohon ampun kepada Allah seratus kali dalam sehari.'",
            "reference": "Muslim [2702](4/2075). Lihat juga Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/386)."
          }
        ]
      },
      {
        "group_id": 130,
        "title": "Keutamaan Mengingat dan Mengagungkan Allah",
        "duas": [
          {
            "id": 254,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
            "translation": "Betapa sempurna Allah dan aku memuji-Nya. (Seratus kali setiap hari)",
            "reference": "Al-Bukhârî [6405](7/168) dan Muslim [2691](4/2071)."
          },
          {
            "id": 255,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
            "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Kepada-Nya semua kerajaan, dan segala puji bagi-Nya, dan Dia Maha Kuasa atas segala sesuatu. (Sepuluh kali)",
            "reference": "Al-Bukhârî (7/67) dan Muslim (4/2017)."
          },
          {
            "id": 256,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: \"Ada dua kalimat (ungkapan), yang ringan di lidah, berat di timbangan, dan dicintai oleh Yang Maha Pemurah: 'Maha Suci Allah dan segala puji bagi-Nya.' (dan) 'Maha Suci Allah Yang Maha Agung.'",
            "reference": "Al-Bukhârî [3462](7/168) dan Muslim [2694](4/2072)."
          },
          {
            "id": 257,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
            "translation": "Rasulullah (salla Allaahu ʻalayhi wa salaam) berkata: \"Mengucapkan 'Maha Suci Allah, dan segala puji bagi Allah. Tidak ada yang berhak disembah selain Allah, dan Allah Maha Besar', lebih aku sukai daripada segala sesuatu yang disinari matahari.\"",
            "reference": "Muslim [2695](4/2072)."
          },
          {
            "id": 258,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
            "translation": "Betapa sempurna Allah dan aku memuji-Nya. (Seratus kali)",
            "reference": "Muslim [2698](4/2073)."
          },
          {
            "id": 259,
            "group_id": 130,
            "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
            "translation": "Barangsiapa yang mengatakan: 'Maha Suci Allah Yang Maha Agung, dan aku memuji-Nya', sebuah pohon kurma ditanam untuknya di surga.",
            "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) dan dia menyatakannya sahih dan Adh-Dhahabî setuju dengannya. Lihat juga Ŝaĥîĥ Al-Jâmi' [6429](5/531) dan Ŝaĥîĥ At-Tirmidhî (3/160)."
          },
          {
            "id": 260,
            "group_id": 130,
            "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
            "translation": "Tidak ada daya upaya maupun kekuatan kecuali dengan Allah.",
            "reference": "Al-Bukhârî [4205](11/213) dan Muslim [2704](4/2076)."
          },
          {
            "id": 261,
            "group_id": 130,
            "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
            "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) berkata: \"Empat kalimat yang paling dicintai Allah: 'Maha Suci Allah', 'Segala puji bagi Allah', 'Tidak ada yang berhak disembah selain Allah', dan 'Allah Maha Besar.'\"",
            "reference": "Muslim [2137](3/1685)."
          },
          {
            "id": 262,
            "group_id": 130,
            "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
            "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Allah Maha Besar, dan segala puji bagi Allah. Maha Suci Allah, Tuhan seluruh alam. Tidak ada daya upaya dan kekuatan kecuali dengan Allah, Yang Maha Perkasa, Maha Bijaksana. Ya Allah, ampunilah aku, rahmatilah aku, berilah aku petunjuk, dan berilah aku rezeki.",
            "reference": "Muslim [2696](4/2072)."
          },
          {
            "id": 263,
            "group_id": 130,
            "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
            "translation": "Jika seseorang masuk Islam, Nabi (salla Allaahu ʻalayhi wa salaam) mengajarinya salat, lalu memerintahkannya untuk berdoa dengan kata-kata ini: 'Ya Allah, ampunilah aku, rahmatilah aku, berilah aku petunjuk, berilah aku kesehatan, dan berilah aku rezeki.'",
            "reference": "Muslim [2697](4/2073)."
          },
          {
            "id": 264,
            "group_id": 130,
            "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
            "translation": "Sesungguhnya doa yang paling utama adalah: 'Segala puji bagi Allah.' dan zikir yang paling utama adalah: 'Tidak ada yang berhak disembah selain Allah.'",
            "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), dan Al-Hâkim (1/503) dan dia menyatakannya sahih dan Adh-Dhahabî setuju dengannya. Lihat juga Ŝaĥîĥ Al-Jâmi' [1104](1/362)."
          },
          {
            "id": 265,
            "group_id": 130,
            "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
            "translation": "Yang abadi dan saleh adalah: Maha Suci Allah, dan segala puji bagi Allah. Tidak ada yang berhak disembah selain Allah, dan Allah Maha Besar. Tidak ada daya upaya dan kekuatan kecuali dengan Allah.",
            "reference": "Aĥmad [513](3/75) menurut urutan Aĥmad Shâkir dan sanadnya sahih. Lihat juga Majma' Az-Zawâ'id (1/297)."
          }
        ]
      },
      {
        "group_id": 131,
        "title": "Bagaimana Rasulullah (SAW) Melakukan Tasbih",
        "duas": [
          {
            "id": 266,
            "group_id": 131,
            "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
            "translation": "'Abdullah ibn 'Amr (RadiAllah ʻanhu) berkata: Aku melihat Nabi (salla Allaahu ʻalayhi wa salaam) melakukan tasbih dengan tangan kanannya.",
            "reference": "Abû Dâwud [1502](2/81) dan At-Tirmidhî [3486](5/521). Lihat juga Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
          }
        ]
      }
    ]
},
  {
    "category_id": 4,
    "title": "Haji & Umrah",
    "group": [
      {
        "group_id": 115,
        "title": "Talbiyah Bagi Yang Melaksanakan Haji Atau Umrah",
        "duas": [
          {
            "id": 233,
            "group_id": 115,
            "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
            "translation": "Aku datang memenuhi panggilan-Mu ya Allah, aku datang memenuhi panggilan-Mu. Aku datang memenuhi panggilan-Mu, tidak ada sekutu bagi-Mu, aku datang memenuhi panggilan-Mu. Sesungguhnya segala puji, nikmat, dan kerajaan hanya milik-Mu. Tidak ada sekutu bagi-Mu.",
            "reference": "Al-Bukhârî [1549](3/408) dan Muslim [1184](2/841)."
          }
        ]
    },
    {
      "group_id": 116,
      "title": "Takbir Saat Melewati Hajar Aswad",
      "duas": [
        {
          "id": 234,
          "group_id": 116,
          "dua": "اللهُ أَكْبَرُ",
          "translation": "Allah Maha Besar.",
          "reference": "Al-Bukhârî [1612](1/476)."
        }
      ]
    },
    {
      "group_id": 117,
      "title": "Antara Rukun Yamani Dan Hajar Aswad",
      "duas": [
        {
          "id": 235,
          "group_id": 117,
          "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
          "translation": "Ya Tuhan kami, berikanlah kami kebaikan di dunia dan kebaikan di akhirat, serta peliharalah kami dari siksa neraka.",
          "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) dan Al-Baghawî dalam Sharĥ As-Sunnah (7/128). Al-Albânî menyatakan sebagai ĥasan dalam Ŝaĥîĥ Abû Dâwud (1/354).(2) Surah Al-Baqarah: 201."
        }
      ]
    },
    {
      "group_id": 118,
      "title": "Ketika Di Bukit Safa Dan Bukit Marwah",
      "duas": [
        {
          "id": 236,
          "group_id": 118,
          "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
          "translation": "Sesungguhnya Safa dan Marwah adalah sebagian dari syiar Allah… Tidak ada yang berhak disembah selain Allah, Allah Maha Besar. Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Kepada-Nya segala kerajaan dan segala puji, dan Dia Maha Kuasa atas segala sesuatu. Tidak ada yang berhak disembah selain Allah, satu-satunya. Dia telah memenuhi janji-Nya, menolong hamba-Nya, dan mengalahkan sekutu-sekutu sendirian.",
          "reference": "Muslim [1218](2/888)."
        }
      ]
    },
    {
      "group_id": 119,
      "title": "Hari Arafah",
      "duas": [
        {
          "id": 237,
          "group_id": 119,
          "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
          "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu. Kepada-Nya segala puji dan kerajaan, dan Dia Maha Kuasa atas segala sesuatu.",
          "reference": "At-Tirmidhî [3585]. Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ At-Tirmidhî (3/184) dan Al-Aĥâdîth Aŝ-Ŝaĥîĥah (4/6)."
        }
      ]
    },
    {
      "group_id": 120,
      "title": "Dzikir Di Muzdalifah",
      "duas": [
        {
          "id": 238,
          "group_id": 120,
          "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
          "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) menaiki Al-Qaswa sampai dia mencapai Al-Mash'ar Al-Haram, kemudian menghadap kiblat, berdoa kepada Allah, mengagungkan kebesaran dan keesaan-Nya. Beliau tetap berdiri sampai matahari mulai terang, lalu berangkat sebelum matahari terbit.",
          "reference": "Muslim [1218](2/891)."
        }
      ]
    },
    {
      "group_id": 121,
      "title": "Ketika Melempar Setiap Batu Di Jamarat",
      "duas": [
        {
          "id": 239,
          "group_id": 121,
          "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
          "translation": "Al-Bukhârî [1752 dan 1753](3/583-584), lihat juga kata-katanya di sana, Al-Bukhârî [1750](3/581) dan Muslim [1296] juga meriwayatkan dari hadits Ibnu Mas'ûd (RA).",
          "reference": "Al-Bukhârî [1752, 1753](3/583-584) dan lihat kata-katanya di sana, Al-Bukhârî [1750](3/581) dan Muslim [1296]."
        }
      ]
    },
    {
      "group_id": 127,
      "title": "Ketika Menyembelih Atau Menawarkan Qurban",
      "duas": [
        {
          "id": 246,
          "group_id": 127,
          "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
          "translation": "Dengan nama Allah, dan Allah Maha Besar. Ya Allah, (ini) dari-Mu dan milik-Mu, ya Allah, terimalah dari aku.",
          "reference": "Muslim [1966](3/1557) dan Baihaqî (9/287). Apa yang ada di dalam kurung berasal dari Baihaqî dan lainnya."
        }
      ]
    }
  ]
},
  {
    "category_id": 5,
    "title": "Perjalanan",
    "group": [
      {
        "group_id": 95,
        "title": "Saat Menunggang Hewan Atau Sarana Transportasi",
        "duas": [
          {
            "id": 206,
            "group_id": 95,
            "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
            "translation": "Dengan nama Allah dan segala puji bagi Allah. Maha Suci Dia, Yang telah menundukkan ini (transportasi) untuk kita dan kita sendiri tidak akan mampu melakukannya, dan kepada Tuhan kita adalah tujuan akhir kita. Segala puji bagi Allah, Segala puji bagi Allah, Segala puji bagi Allah, Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Maha Suci Engkau, ya Allah, sesungguhnya aku telah menzalimi diriku sendiri, maka ampunilah aku, karena sesungguhnya tidak ada yang dapat mengampuni dosa kecuali Engkau.",
            "reference": "Abû Dâwud [2602](3/34) dan At-Tirmidhî [3446](5/510). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/156)."
          }
        ]
      },
      {
        "group_id": 96,
        "title": "Untuk Perjalanan",
        "duas": [
          {
            "id": 207,
            "group_id": 96,
            "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
            "translation": "(1) Allah Maha Besar, Allah Maha Besar, Allah Maha Besar, Maha Suci Dia yang telah menundukkan ini (transportasi) untuk kita, dan kita sendiri tidak akan mampu melakukannya, dan kepada Tuhan kita adalah tujuan akhir kita. Ya Allah, kami memohon kepada-Mu kebajikan dan ketakwaan dalam perjalanan ini, serta amalan yang Engkau ridai. Ya Allah, mudahkanlah perjalanan kami dan dekatkanlah jaraknya. Ya Allah, Engkau adalah Sahabat dalam perjalanan ini dan Pengganti atas keluarga. Ya Allah, aku berlindung kepada-Mu dari kesulitan dalam perjalanan, dari perasaan sedih dan melihat hal yang tidak diinginkan, serta aku berlindung kepada-Mu dari hasil yang buruk terhadap harta dan keluarga.Ketika kembali, doa yang sama diucapkan dengan tambahan berikut:(2) 'Kami kembali, bertaubat, beribadah, dan memuji Tuhan kami.'",
            "reference": "Muslim [1342](2/998)."
          }
        ]
      },
      {
        "group_id": 97,
        "title": "Saat Memasuki Kota Atau Desa",
        "duas": [
          {
            "id": 208,
            "group_id": 97,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
            "translation": "Ya Allah, Tuhan dari tujuh langit dan semua yang ada di bawahnya, Tuhan dari tujuh bumi dan semua yang ditopangnya, Tuhan dari setan-setan dan semua yang mereka sesatkan, Tuhan dari angin dan semua yang mereka bawa. Aku memohon kepada-Mu kebaikan desa ini, kebaikan penduduknya, dan segala kebaikan yang ada di dalamnya, dan aku berlindung kepada-Mu dari kejahatan desa ini, kejahatan penduduknya, dan segala kejahatan yang ada di dalamnya.",
            "reference": "Al-Hâkim (2/100) dan ia menyatakannya sahih dan Adh-Dhahabî setuju dengannya, Ibn As-Sunnî [524], Al-Hâfiž menyatakannya sebagai ĥasan dalam Takrîj Al-Athkâr (5/154). Shaykh Ibn Bâz mengatakan bahwa ini telah diriwayatkan oleh An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548] dengan sanad yang ĥasan. Lihat juga Tuĥfat Al-Akhyâr (hlm. 37)."
          }
        ]
      },
      {
        "group_id": 98,
        "title": "Saat Memasuki Pasar",
        "duas": [
          {
            "id": 209,
            "group_id": 98,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "Tidak ada yang berhak disembah selain Allah, satu-satunya, tanpa sekutu, milik-Nya segala kerajaan dan pujian. Dia yang menghidupkan dan mematikan, dan Dia hidup serta tidak mati. Di tangan-Nya segala kebaikan dan Dia Maha Kuasa atas segala sesuatu.",
            "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) dan Ibn Mâjah [2235]. Al-Albânî menyatakannya sebagai ĥasan dalam Ŝaĥîĥ Ibn Mâjah (2/21) dan Ŝaĥîĥ At-Tirmidhî (3/152)."
          }
        ]
      },
      {
        "group_id": 99,
        "title": "Saat Hewan Tunggang (atau sarana transportasi) Tersandung",
        "duas": [
          {
            "id": 210,
            "group_id": 99,
            "dua": "بِسْمِ اللهِ",
            "translation": "Dengan nama Allah.",
            "reference": "Abû Dâwud [4982](4/296). Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Abû Dâwud (3/941)."
          }
        ]
      },
      {
        "group_id": 100,
        "title": "Doa Musafir Untuk Penduduk Setempat",
        "duas": [
          {
            "id": 211,
            "group_id": 100,
            "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
            "translation": "Aku titipkan kalian kepada Allah, yang titipan-Nya tidak pernah disia-siakan.",
            "reference": "Aĥmad (2/403) dan Ibn Mâjah [2825](2/943). Lihat juga Ŝaĥîĥ Ibn Mâjah (2/133)."
          }
        ]
      },
      {
        "group_id": 101,
        "title": "Doa Penduduk Setempat Untuk Musafir",
        "duas": [
          {
            "id": 212,
            "group_id": 101,
            "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
            "translation": "Aku titipkan agamamu, amanatmu, dan akhir dari amalanmu kepada Allah.",
            "reference": "Aĥmad (2/7) dan At-Tirmidhî [3443](5/499). Lihat juga Ŝaĥîĥ At-Tirmidhî (2/155)."
          },
          {
            "id": 213,
            "group_id": 101,
            "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
            "translation": "Semoga Allah memberimu ketakwaan, mengampuni dosamu, dan mempermudah segala kebaikan bagimu di manapun engkau berada.",
            "reference": "At-Tirmidhî [3444]. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/155)."
          }
        ]
      },
      {
        "group_id": 102,
        "title": "Dzikir Saat Naik atau Turun",
        "duas": [
          {
            "id": 214,
            "group_id": 102,
            "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
            "translation": "Saat naik, ucapkan (1) 'Allah Maha Besar', dan saat turun, ucapkan (2) 'Maha Suci Allah'.",
            "reference": "Al-Bukhârî [2993](6/135)."
          }
        ]
      },
      {
        "group_id": 103,
        "title": "Doa Musafir Saat Fajar Menyingsing",
        "duas": [
          {
            "id": 215,
            "group_id": 103,
            "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
            "translation": "Semoga ada saksi yang bersaksi atas pujian kita kepada Allah atas nikmat dan karunia-Nya kepada kita. Tuhan kami, lindungi kami, berikanlah anugerah-Mu kepada kami, dan jauhkan kami dari segala keburukan. Aku berlindung kepada Allah dari neraka.",
            "reference": "Muslim [2718](4/2086)."
          }
        ]
      },
      {
        "group_id": 104,
        "title": "Saat Berhenti atau Menginap di Suatu Tempat",
        "duas": [
          {
            "id": 216,
            "group_id": 104,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "translation": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna dari kejahatan yang Dia ciptakan.",
            "reference": "Muslim [2708](4/2080)."
          }
        ]
      },
      {
        "group_id": 105,
        "title": "Saat Kembali Dari Perjalanan",
        "duas": [
          {
            "id": 217,
            "group_id": 105,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
            "translation": "Allah Maha Besar, Allah Maha Besar, Allah Maha Besar. Tidak ada yang berhak disembah kecuali Allah, satu-satunya, tanpa sekutu. Milik-Nya segala kerajaan dan pujian, dan Dia Maha Kuasa atas segala sesuatu. Kami kembali, bertaubat, beribadah, dan memuji Tuhan kami. Allah telah memenuhi janji-Nya, menolong hamba-Nya, dan mengalahkan sekutu-sekutu sendirian.",
            "reference": "Al-Bukhârî [1797](7/163) dan Muslim [1344](2/980)."
          }
        ]
      }
    ]
  },
  {
  "category_id": 6,
  "title": "Kegembiraan & Kesusahan",
  "group": [
    {
      "group_id": 34,
      "title": "Untuk Kecemasan Dan Kesedihan",
      "duas": [
        {
          "id": 120,
          "group_id": 34,
          "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
          "translation": "Ya Allah, aku adalah hamba-Mu, anak dari hamba-Mu, anak dari hamba perempuan-Mu, ubun-ubunku berada di tangan-Mu, keputusan-Mu berlaku atas diriku, dan ketetapan-Mu adalah adil. Aku memohon kepada-Mu dengan setiap nama yang Engkau miliki, yang Engkau namakan diri-Mu, atau yang Engkau turunkan dalam Kitab-Mu, atau yang Engkau ajarkan kepada salah satu dari makhluk-Mu, atau yang Engkau simpan dalam ilmu ghaib-Mu, agar Engkau menjadikan Al-Qur'an sebagai kehidupan hatiku, cahaya dadaku, penghilang kesedihanku, dan pengusir kecemasanku.",
          "reference": "Aĥmad (1/391). Al-Albânî mengesahkannya dalam Al-Kalam Ať-Ťayyib [124]."
        },
        {
          "id": 121,
          "group_id": 34,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
          "translation": "Ya Allah, aku berlindung kepada-Mu dari kecemasan dan kesedihan, kelemahan dan kemalasan, kekikiran dan ketakutan, beban utang, dan dari dikuasai oleh orang lain.",
          "reference": "Al-Bukhârî [6363](7/158), lihat Fatĥ al-Bârî (11/173)."
        }
      ]
    },
    {
      "group_id": 35,
      "title": "Untuk Seseorang Yang Tertekan",
      "duas": [
        {
          "id": 122,
          "group_id": 35,
          "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
          "translation": "Tiada yang berhak disembah kecuali Allah yang Maha Agung dan Maha Penyantun. Tiada yang berhak disembah kecuali Allah, Tuhan arsy yang agung. Tiada yang berhak disembah kecuali Allah, Tuhan langit, Tuhan bumi, dan Tuhan arsy yang mulia.",
          "reference": "Al-Bukhârî [6346](7/154) dan Muslim [2730](4/2092)."
        },
        {
          "id": 123,
          "group_id": 35,
          "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
          "translation": "Ya Allah, hanya rahmat-Mu yang kuharapkan, maka janganlah Engkau serahkan urusanku pada diriku walau sekejap mata. Perbaikilah semua urusanku, tiada yang berhak disembah kecuali Engkau.",
          "reference": "Abû Dâwud [5090](4/324) dan Aĥmad (5/42). Al-Albânî mengesahkannya dalam Ŝaĥîĥ Abî Dâwud (3/959)."
        },
        {
          "id": 124,
          "group_id": 35,
          "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
          "translation": "Tiada yang berhak disembah kecuali Engkau. Maha Suci Engkau, sesungguhnya aku termasuk orang-orang yang zalim.",
          "reference": "At-Tirmidhî [3505](5/529) dan Al-Hâkim (1/505) yang menyahkannya dan Adh-Dhahabî menyetujuinya. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/168)."
        },
        {
          "id": 125,
          "group_id": 35,
          "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
          "translation": "Allah, Allah adalah Tuhanku, aku tidak menyekutukan-Nya dengan sesuatu apa pun.",
          "reference": "Abû Dâwud [1525](2/87). Lihat juga Ŝaĥîĥ Ibn Mâjah (2/335)."
        }
      ]
    },
    {
      "group_id": 36,
      "title": "Ketika Menghadapi Musuh Atau Orang Berkuasa",
      "duas": [
        {
          "id": 126,
          "group_id": 36,
          "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
          "translation": "Ya Allah, kami jadikan Engkau di hadapan mereka dan kami berlindung kepada-Mu dari keburukan mereka.",
          "reference": "Abû Dâwud [1537](2/89) dan Al-Hâkim (2/142) yang menyahkannya dan Adh-Dhahabî menyetujuinya."
        },
        {
          "id": 127,
          "group_id": 36,
          "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
          "translation": "Ya Allah, Engkau adalah penolongku dan Engkau adalah pelindungku, dengan-Mu aku bergerak, dengan-Mu aku menyerang, dan dengan-Mu aku bertempur.",
          "reference": "Abû Dâwud [2632](3/42) dan At-Tirmidhî [3584](5/572). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/183)."
        },
        {
          "id": 128,
          "group_id": 36,
          "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
          "translation": "Cukuplah Allah sebagai penolong kami, dan Dia adalah sebaik-baik pelindung.",
          "reference": "Al-Bukhârî [4563](5/172)."
        }
      ]
    },
    {
      "group_id": 37,
      "title": "Untuk Seseorang Yang Takut Ketidakadilan Penguasa",
      "duas": [
        {
          "id": 129,
          "group_id": 37,
          "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
          "translation": "Ya Allah, Tuhan tujuh langit dan arsy yang agung, lindungilah aku dari si fulan bin fulan, dan dari para pendukungnya di antara makhluk-Mu; agar tak seorang pun dari mereka yang melampaui batas terhadapku atau menindasku. Mulia perlindungan-Mu, agung pujian-Mu, tiada yang berhak disembah selain Engkau.",
          "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] dan Al-Albânî mengesahkannya dalam Ŝaĥîĥ Al-Adab Al-Mufrad [545]."
        },
        {
          "id": 130,
          "group_id": 37,
          "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
          "translation": "Allah Maha Besar, Allah lebih agung daripada semua makhluk-Nya, Allah lebih agung dari yang kutakuti dan kuwaspadai. Aku berlindung kepada Allah, tiada yang berhak disembah selain Dia, yang menahan tujuh langit agar tidak jatuh ke bumi kecuali dengan izin-Nya, dari keburukan hamba-Mu fulan, tentaranya, pengikutnya, dan pendukungnya, dari kalangan jin dan manusia. Ya Allah, jadilah pelindungku dari keburukan mereka. Agung pujian-Mu, mulia perlindungan-Mu, diberkatilah nama-Mu, dan tiada yang berhak disembah selain Engkau.",
          "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] dan Al-Albânî mengesahkannya dalam Ŝaĥîĥ Al-Adab Al-Mufrad (546)."
        }
      ]
    },
    {
      "group_id": 38,
      "title": "Menghadapi Musuh",
      "duas": [
        {
          "id": 131,
          "group_id": 38,
          "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
          "translation": "Ya Allah, Penurunkan Kitab, yang Maha Cepat perhitungan, kalahkanlah sekutu-sekutu, ya Allah, kalahkan mereka dan guncangkan mereka.",
          "reference": "Muslim [1742](3/1362)."
        }
      ]
    },
    {
      "group_id": 39,
      "title": "Ketika Takut Pada Sekelompok Orang",
      "duas": [
        {
          "id": 132,
          "group_id": 39,
          "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
          "translation": "Ya Allah, lindungilah aku dari mereka dengan cara yang Engkau kehendaki.",
          "reference": "Muslim [3005](4/2300)."
        }
      ]
    },
    {
      "group_id": 40,
      "title": "Untuk Seseorang Yang Digoda Ragu Dalam Iman",
      "duas": [
        {
          "id": 133,
          "group_id": 40,
          "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
          "translation": "(1) Berlindung kepada Allah dari godaan setan.(2) Menolak apa yang menimbulkan keraguan.",
          "reference": "Al-Bukhârî [6/336](6/336) dan Muslim [134,214](1/120)."
        },
        {
          "id": 134,
          "group_id": 40,
          "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
          "translation": "Aku beriman kepada Allah dan rasul-rasul-Nya.",
          "reference": "Muslim [134,212](1/119-120)."
        },
        {
          "id": 135,
          "group_id": 40,
          "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
          "translation": "Dia adalah Yang Awal dan Yang Akhir, Yang Lahir dan Yang Batin, dan Dia Maha Mengetahui segala sesuatu.",
          "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) dan Al-Albânî mengesahkannya dalam Ŝaĥîĥ Abî  Dâwud (3/962)."
        }
      ]
    },
    {
      "group_id": 41,
      "title": "Membayar Hutang",
      "duas": [
        {
          "id": 136,
          "group_id": 41,
          "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
          "translation": "Ya Allah, cukupkanlah aku dengan yang halal dari yang haram, dan perkayalah aku dengan anugerah-Mu, sehingga aku tidak butuh kepada selain-Mu.",
          "reference": "At-Tirmidhî [3563](5/650). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/180)."
        },
        {
          "id": 137,
          "group_id": 41,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
          "translation": "Ya Allah, aku berlindung kepada-Mu dari kecemasan dan kesedihan, kelemahan dan kemalasan, kekikiran dan ketakutan, beban utang, dan dari dikuasai oleh orang lain.",
          "reference": "Al-Bukhârî [6363](7/158)."
        }
      ]
    },
    {
      "group_id": 53,
      "title": "Untuk Seseorang Yang Ditimpa Musibah",
      "duas": [
        {
          "id": 154,
          "group_id": 53,
          "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
          "translation": "Sesungguhnya kami milik Allah dan kepada-Nya kami akan kembali. Ya Allah, beri aku pahala dalam musibahku, dan gantikanlah dengan yang lebih baik dari itu.",
          "reference": "Muslim [918](2/632)."
        }
      ]
    },
    {
      "group_id": 92,
      "title": "Untuk Ketakutan Terhadap Syirik",
      "duas": [
        {
          "id": 203,
          "group_id": 92,
          "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
          "translation": "Ya Allah, aku berlindung kepada-Mu agar tidak menyekutukan-Mu dengan sengaja, dan aku mohon ampunan-Mu atas apa yang aku tidak ketahui.",
          "reference": "Aĥmad (4/403). Lihat juga Ŝaĥîĥ Al-Jâmi' [3731](3/233) dan Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) oleh Al-Albânî."
        }
      ]
    },
    {
      "group_id": 94,
      "title": "Larangan Menyandarkan Sesuatu Pada Pertanda Buruk",
      "duas": [
        {
          "id": 205,
          "group_id": 94,
          "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
          "translation": "Ya Allah, tidak ada pertanda buruk kecuali pertanda dari-Mu, tidak ada kebaikan kecuali kebaikan dari-Mu, dan tiada yang berhak disembah selain Engkau.",
          "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] dan Al-Albânî mengesahkannya dalam [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54). Nabi (salla Allaahu ʻalayhi wa salaam) menyukai Al-Fa'al [الفأل](pertanda baik). Ketika mendengar kata baik dari seseorang, beliau menyukainya dan berkata: \"Kami mengambil pertanda baik dari mulutmu\", diriwayatkan oleh Abû Dâwud [3917] dan Imâm Aĥmad; dan Al-Albânî mengesahkannya dalam [Al-Aḥâdīth Aŝ-Ŝaĥîĥah](2/363). Riwayat ini juga dapat ditemukan dalam kitab Abu As-Shaykh [Akhlâq An-Nabî (salla Allaahu ʻalayhi wa salaam)] (hal. 270)."
        }
      ]
    },
    {
      "group_id": 106,
      "title": "Apa Yang Diucapkan Ketika Mendapatkan Berita Menyenangkan Atau Tidak Menyenangkan",
      "duas": [
        {
          "id": 218,
          "group_id": 106,
          "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
          "translation": "Saat menerima kabar baik, ucapkan: (1) 'Segala puji bagi Allah dengan nikmat-Nya segala kebaikan sempurna.'Saat menerima kabar buruk, ucapkan: (2) 'Segala puji bagi Allah dalam segala keadaan.'",
          "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] dan Al-Hâkim (1/499) yang menyahkannya. Al-Albânî mengesahkannya dalam Ŝaĥîĥ Al-Jâmi' [4640](4/201)."
        }
      ]
    },
    {
      "group_id": 122,
      "title": "Pada Saat Takjub Dan Kegembiraan",
      "duas": [
        {
          "id": 240,
          "group_id": 122,
          "dua": "سُبْحَانَ اللهِ!",
          "translation": "Maha Suci Allah!",
          "reference": "Al-Bukhârî [155](1/210), [283](1/390) dan Muslim [371], [314](414), [332](4/1857)."
        },
        {
          "id": 241,
          "group_id": 122,
          "dua": "اللهُ أَكْبَرُ",
          "translation": "Allah Maha Besar.",
          "reference": "Al-Bukhârî [4741](8/441). Lihat juga Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) dan Aĥmad (5/218)."
        }
      ]
    },
    {
      "group_id": 123,
      "title": "Saat Mendapatkan Berita Menyenangkan",
      "duas": [
        {
          "id": 242,
          "group_id": 123,
          "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
          "translation": "Nabi (salla Allaahu ʻalayhi wa salaam) akan bersujud sebagai tanda syukur kepada Allah ketika menerima kabar yang menggembirakan atau yang membuatnya gembira.",
          "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] dan Ibn Mâjah [1394]. Lihat juga Ŝaĥîĥ Ibn Mâjah (1/233) dan Irwâ'-ul-Ghalîl (2/226)."
        }
      ]
    },
    {
      "group_id": 126,
      "title": "Ketika Terkejut",
      "duas": [
        {
          "id": 245,
          "group_id": 126,
          "dua": "لَا إلَهَ إلَّا اللهُ",
          "translation": "Tiada yang berhak disembah kecuali Allah.",
          "reference": "Al-Bukhârî [3346](6/381) dan Muslim [2880](4/2208)."
        }
      ]
    }
  ]
},
  {
  "category_id": 7,
  "title": "Alam",
  "group": [
    {
      "group_id": 61,
      "title": "Saat Terjadi Badai Angin",
      "duas": [
        {
          "id": 166,
          "group_id": 61,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
          "translation": "Ya Allah, aku memohon kepada-Mu kebaikannya dan aku berlindung kepada-Mu dari keburukannya.",
          "reference": "Abû Dâwud [5097](4/326) dan Ibn Mâjah [3727](2/1228). Lihat juga Ŝaĥîĥ Ibn Mâjah (2/305)."
        },
        {
          "id": 167,
          "group_id": 61,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
          "translation": "Ya Allah, aku memohon kepada-Mu kebaikannya, kebaikan di dalamnya, dan kebaikan yang dibawa olehnya, dan aku berlindung kepada-Mu dari keburukannya, keburukan di dalamnya, serta keburukan yang dibawa olehnya.",
          "reference": "Muslim [899](2/616) dan Al-Bukhârî [3206](4/76)."
        }
      ]
    },
    {
      "group_id": 62,
      "title": "Saat Mendengar Petir",
      "duas": [
        {
          "id": 168,
          "group_id": 62,
          "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
          "translation": "Maha Suci Dia, (Yang) dengan pujian-Nya, petir bertasbih kepada-Nya, begitu juga malaikat karena takut kepada-Nya.",
          "reference": "Al-Muwaťťa' (2/992) dan Al-Albânî menyatakan sanadnya Ŝaĥîĥ dan Mawqûf."
        }
      ]
    },
    {
      "group_id": 63,
      "title": "Untuk Meminta Hujan",
      "duas": [
        {
          "id": 169,
          "group_id": 63,
          "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
          "translation": "Ya Allah, turunkanlah kepada kami hujan yang menyegarkan, menyehatkan, menguntungkan, tidak membahayakan, sekarang, bukan nanti.",
          "reference": "Abû Dâwud [1169](1/303). Al-Albânî menyatakan hadits ini sahih dalam Ŝaĥîĥ Abû Dâwud (1/216)."
        },
        {
          "id": 170,
          "group_id": 63,
          "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
          "translation": "Ya Allah, turunkan hujan kepada kami, Ya Allah, turunkan hujan kepada kami, Ya Allah, turunkan hujan kepada kami.",
          "reference": "Al-Bukhârî [1013](1/224) dan Muslim [897](2/613)."
        },
        {
          "id": 171,
          "group_id": 63,
          "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
          "translation": "Ya Allah, berikanlah air kepada hamba-hamba-Mu dan hewan ternak-Mu, tebarkanlah rahmat-Mu, dan hidupkanlah negeri-Mu yang mati.",
          "reference": "Abû Dâwud [1176](1/305) dan Al-Albânî menyatakannya Ĥasan dalam Ŝaĥîĥ Abû Dâwud (1/218)."
        }
      ]
    },
    {
      "group_id": 64,
      "title": "Saat Hujan Turun",
      "duas": [
        {
          "id": 172,
          "group_id": 64,
          "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
          "translation": "Ya Allah, semoga ini menjadi hujan yang bermanfaat.",
          "reference": "Al-Bukhârî [1032](2/518)."
        }
      ]
    },
    {
      "group_id": 65,
      "title": "Setelah Hujan",
      "duas": [
        {
          "id": 173,
          "group_id": 65,
          "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
          "translation": "Kami diberi hujan berkat karunia dan rahmat Allah.",
          "reference": "Al-Bukhârî [846](1/205) dan Muslim [71](1/83)."
        }
      ]
    },
    {
      "group_id": 66,
      "title": "Meminta Cuaca Cerah",
      "duas": [
        {
          "id": 174,
          "group_id": 66,
          "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
          "translation": "Ya Allah, biarkanlah hujan turun di sekitar kami dan bukan di atas kami, Ya Allah, (biarkanlah hujan turun) di padang rumput, bukit-bukit, lembah-lembah, dan akar-akar pohon.",
          "reference": "Al-Bukhârî [1013](1/224) dan Muslim [897](2/614)."
        }
      ]
    },
    {
      "group_id": 67,
      "title": "Saat Melihat Hilal (Bulan Sabit)",
      "duas": [
        {
          "id": 175,
          "group_id": 67,
          "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
          "translation": "Allah Maha Besar. Ya Allah, tampakkanlah hilal ini kepada kami dalam keadaan aman, iman, keselamatan, dan Islam, serta dalam keadaan sesuai dengan segala sesuatu yang Engkau cintai dan ridai. Tuhan kami dan Tuhanmu adalah Allah.",
          "reference": "At-Tirmidhî [3451](5/405) dan Ad-Dârimî (1/336) dan lafaz ini adalah miliknya. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/157)."
        }
      ]
    },
    {
      "group_id": 76,
      "title": "Saat Melihat Buah Yang Baru Tumbuh",
      "duas": [
        {
          "id": 187,
          "group_id": 76,
          "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
          "translation": "Ya Allah, berkahilah buah-buahan kami, berkahilah kota kami, berkahilah sha' kami, dan berkahilah mudd kami.",
          "reference": "Muslim [1373](2/1000)."
        }
      ]
    },
    {
      "group_id": 110,
      "title": "Saat Mendengar Ayam Berkokok atau Keledai Meringkik",
      "duas": [
        {
          "id": 228,
          "group_id": 110,
          "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
          "translation": "Jika kalian mendengar ayam berkokok, mintalah karunia Allah, karena ia melihat malaikat. Dan jika kalian mendengar keledai meringkik, berlindunglah kepada Allah dari setan, karena ia melihat setan.",
          "reference": "Al-Bukhârî [3303](6/350) dan Muslim [2729](4/2092)."
        }
      ]
    },
    {
      "group_id": 111,
      "title": "Saat Mendengar Anjing Menggonggong di Malam Hari",
      "duas": [
        {
          "id": 229,
          "group_id": 111,
          "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
          "translation": "Jika kalian mendengar anjing menggonggong atau keledai meringkik di malam hari, berlindunglah kepada Allah, karena mereka melihat apa yang tidak kalian lihat.",
          "reference": "Abû Dâwud [5103](4/327) dan Aĥmad (3/306). Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Abû Dâwud (3/961)."
        }
      ]
    }
  ]
},
  {
  "category_id": 8,
  "title": "Adab yang Baik",
  "group": [
    {
      "group_id": 47,
      "title": "Ucapan Selamat atas Kelahiran",
      "duas": [
        {
          "id": 145,
          "group_id": 47,
          "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
          "translation": "'Semoga Allah memberkati apa yang Dia karuniakan kepadamu (anak ini) dan semoga kamu bersyukur kepada-Nya yang telah mengaruniakan kepadamu. Semoga dia (anak ini) tumbuh dewasa dan semoga Allah memberkatinya dengan akhlak yang baik kepadamu.'Balasan: 'Semoga Allah memberkati segala sesuatu yang Dia karuniakan kepadamu! Semoga Allah membalasmu dengan ampunan-Nya, memberimu anak seperti milikku, dan memberimu ganjaran yang melimpah.'",
          "reference": "An-Nawawî [Al-Athkâr](pg. 349). Lihat juga Ŝaĥîĥ Al-Athkâr dari Imam An-Nawawî (2/713) oleh Shaykh Salîm Al-Hilâlî."
        }
      ]
    },
    {
      "group_id": 75,
      "title": "Ketika Dihina Saat Berpuasa",
      "duas": [
        {
          "id": 186,
          "group_id": 75,
          "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
          "translation": "Aku sedang berpuasa, aku sedang berpuasa.",
          "reference": "Al-Bukhârî [1894](4/103) dan Muslim [1151](2/806)."
        }
      ]
    },
    {
      "group_id": 77,
      "title": "Saat Bersin",
      "duas": [
        {
          "id": 188,
          "group_id": 77,
          "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
          "translation": "Ketika salah satu dari kalian bersin, ucapkanlah: (1) 'Segala puji bagi Allah.', kemudian saudaranya atau temannya menjawab: (2) 'Semoga Allah merahmatimu.' dan orang yang bersin menjawab kembali dengan mengatakan (3) 'Semoga Allah membimbingmu dan memperbaiki keadaanmu.'",
          "reference": "Al-Bukhârî [6224](7/125)."
        }
      ]
    },
    {
      "group_id": 78,
      "title": "Saat Orang Kafir Memuji Allah Setelah Bersin",
      "duas": [
        {
          "id": 189,
          "group_id": 78,
          "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
          "translation": "Semoga Allah membimbingmu dan memperbaiki keadaanmu.",
          "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) dan Abû Dâwud [5038](4/308). Lihat juga Ŝaĥîĥ At-Tirmidhî (2/354)."
        }
      ]
    },
    {
      "group_id": 80,
      "title": "Pada Malam Pernikahan Atau Saat Membeli Hewan",
      "duas": [
        {
          "id": 191,
          "group_id": 80,
          "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
          "translation": "Ya Allah, aku memohon kepada-Mu kebaikan dalam dirinya dan kebaikan yang telah Engkau buat ia condong padanya, dan aku berlindung kepada-Mu dari keburukan dalam dirinya dan keburukan yang telah Engkau buat ia condong padanya.",
          "reference": "Abû Dâwud [2160](2/248) dan Ibn Mâjah [1918](1/617). Lihat juga Ŝaĥîĥ Ibn Mâjah (1/324)."
        }
      ]
    },
    {
      "group_id": 82,
      "title": "Ketika Marah",
      "duas": [
        {
          "id": 193,
          "group_id": 82,
          "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
          "translation": "Aku berlindung kepada Allah dari setan yang terkutuk.",
          "reference": "Al-Bukhârî [6048](7/99) dan Muslim [2610](5/2015)."
        }
      ]
    },
    {
      "group_id": 83,
      "title": "Saat Melihat Seseorang Mengalami Cobaan",
      "duas": [
        {
          "id": 194,
          "group_id": 83,
          "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
          "translation": "Segala puji bagi Allah yang telah menyelamatkanku dari apa yang Dia uji kepadamu dan yang benar-benar telah mengutamakanku di atas banyak makhluk-Nya.",
          "reference": "At-Tirmidhî [3432](5/493,494). Lihat juga Ŝaĥîĥ At-Tirmidhî (3/153)."
        }
      ]
    },
    {
      "group_id": 84,
      "title": "Dalam Sebuah Pertemuan atau Majelis",
      "duas": [
        {
          "id": 195,
          "group_id": 84,
          "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
          "translation": "Ya Tuhanku, ampunilah aku dan terimalah taubatku. Sesungguhnya Engkau adalah Yang Maha Menerima Taubat, Maha Pengampun.",
          "reference": "At-Tirmidhî [3432]. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/153) dan Ŝaĥîĥ Ibn Mâjah (2/321) dan lafadznya adalah milik At-Tirmidhî."
        }
      ]
    },
    {
      "group_id": 85,
      "title": "Untuk Penghapusan Dosa, Dibaca Saat Menutup Majelis atau Pertemuan",
      "duas": [
        {
          "id": 196,
          "group_id": 85,
          "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
          "translation": "Maha Suci Engkau ya Allah, dan aku memuji-Mu. Aku bersaksi bahwa tidak ada yang berhak disembah kecuali Engkau. Aku memohon ampunan-Mu dan aku bertaubat kepada-Mu.",
          "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/153)."
        }
      ]
    },
    {
      "group_id": 86,
      "title": "Menjawab Permohonan Ampunan",
      "duas": [
        {
          "id": 197,
          "group_id": 86,
          "dua": "وَلَكَ",
          "translation": "Dan (semoga Allah mengampunimu).",
          "reference": "Aĥmad (5/82) dan An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
        }
      ]
    },
    {
      "group_id": 87,
      "title": "Kepada Seseorang yang Berbuat Baik Kepadamu",
      "duas": [
        {
          "id": 198,
          "group_id": 87,
          "dua": "جَزَاكَ اللهُ خَيْراً",
          "translation": "Semoga Allah membalasmu dengan kebaikan.",
          "reference": "At-Tirmidhî [2035]. Lihat juga Ŝaĥîĥ Al-Jâmi' [6244] dan Ŝaĥîĥ At-Tirmidhî (2/200)."
        }
      ]
    },
    {
      "group_id": 89,
      "title": "Untuk Orang yang Mengatakan Cinta Kepadamu Karena Allah",
      "duas": [
        {
          "id": 200,
          "group_id": 89,
          "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
          "translation": "Semoga Dia yang karena-Nya kamu mencintaiku, mencintaimu.",
          "reference": "Abû Dâwud [5125](4/333) dan Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Abû Dâwud (3/965)."
        }
      ]
    },
    {
      "group_id": 90,
      "title": "Untuk Orang yang Menawarkan Hartanya",
      "duas": [
        {
          "id": 201,
          "group_id": 90,
          "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
          "translation": "Semoga Allah memberkati keluarga dan hartamu.",
          "reference": "Abû Dâwud [5125](4/333) dan Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Abû Dâwud (3/965)."
        }
      ]
    },
    {
      "group_id": 91,
      "title": "Kepada Orang yang Melunasi Hutangnya",
      "duas": [
        {
          "id": 202,
          "group_id": 91,
          "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
          "translation": "Semoga Allah memberkati keluarga dan hartamu. Sungguh pujian dan pembayaran adalah balasan untuk pinjaman.",
          "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) dan Ibn Mâjah [2424](2/809). Lihat juga Ŝaĥîĥ Ibn Mâjah (2/55)."
        }
      ]
    },
    {
      "group_id": 93,
      "title": "Menjawab Doa Setelah Memberikan Hadiah atau Sedekah kepada Seseorang",
      "duas": [
        {
          "id": 204,
          "group_id": 93,
          "dua": "وَفِيْكَ بَارَكَ اللهُ",
          "translation": "Semoga Allah memberkatimu.",
          "reference": "Ibn As-Sunnî [278](pg. 138). Lihat juga Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) dengan penelitian oleh Bashîr Muĥammad 'Uyun."
        }
      ]
    },
    {
      "group_id": 108,
      "title": "Keutamaan Menyebarkan Salam Islami",
      "duas": [
        {
          "id": 224,
          "group_id": 108,
          "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
          "translation": "Nabi ﷺ bersabda: 'Kamu tidak akan masuk surga sampai kamu beriman, dan kamu tidak akan beriman sampai kamu saling mencintai. Maukah aku memberitahumu sesuatu yang jika kamu melakukannya, kamu akan saling mencintai? Sebarkanlah Salam di antara kamu.'",
          "reference": "Muslim [54](1/74)."
        },
        {
          "id": 225,
          "group_id": 108,
          "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
          "translation": "'Ammâr bin Yâsir (RadiAllah ʻanhu) berkata: 'Tiga sifat, siapa yang menggabungkannya, maka dia telah menyempurnakan imannya: berbuat adil pada diri sendiri, menyebarkan salam kepada semua orang, dan berinfak (secara dermawan) meski dalam kekurangan.'",
          "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
        },
        {
          "id": 226,
          "group_id": 108,
          "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
          "translation": "'Abdullah Ibn 'Amr (RadiAllah ʻanhu) melaporkan bahwa seseorang bertanya kepada Nabi ﷺ: ‘Islam mana yang terbaik?’. Dia ﷺ menjawab: 'Memberi makan (orang miskin), dan menyebarkan salam kepada orang yang kamu kenal maupun yang tidak kamu kenal.’",
          "reference": "Al-Bukhârî [12](1/55) dan Muslim [39](1/65)."
        }
      ]
    },
    {
      "group_id": 109,
      "title": "Mengembalikan Salam Kepada Orang Non-Muslim",
      "duas": [
        {
          "id": 227,
          "group_id": 109,
          "dua": "وَ عَلَيْكُمْ",
          "translation": "Dan atas kalian.",
          "reference": "Al-Bukhârî [6258](11/42) dan Muslim [2163](4/1705)."
        }
      ]
    },
    {
      "group_id": 112,
      "title": "Untuk Seseorang yang Telah Kamu Hina",
      "duas": [
        {
          "id": 230,
          "group_id": 112,
          "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
          "translation": "Ya Allah, kepada siapa pun dari orang beriman yang telah aku hina, jadikanlah itu sebagai sebab baginya untuk mendekat kepada-Mu pada Hari Kiamat.",
          "reference": "Al-Bukhârî [6361](11/171) dan Muslim [2601](4/2007)."
        }
      ]
    },
    {
      "group_id": 113,
      "title": "Etika Memuji Sesama Muslim",
      "duas": [
        {
          "id": 231,
          "group_id": 113,
          "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
          "translation": "Nabi ﷺ bersabda: 'Jika salah seorang dari kalian pasti harus memuji temannya; maka hendaklah ia berkata: ‘Aku berprasangka baik kepada si Fulan, dan Allah adalah pencatat (amalan)nya, dan aku tidak mengutamakan siapa pun di hadapan pujian Allah. Aku berprasangka baik – jika dia mengetahuinya – demikian dan demikian.'",
          "reference": "Muslim [3000](4/2296) dan Al-Bukhârî [2662]."
        }
      ]
    },
    {
      "group_id": 114,
      "title": "Bagi yang Dipuji",
      "duas": [
        {
          "id": 232,
          "group_id": 114,
          "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
          "translation": "Ya Allah, janganlah Engkau menghukumku atas apa yang mereka katakan, ampunilah aku atas apa yang tidak mereka ketahui (dan jadikanlah aku lebih baik dari apa yang mereka kira).",
          "reference": "Al-Bukhârî [Adab Al-Mufrad][761] dan Al-Albânî menyatakannya sahih dalam Ŝaĥîĥ Adab Al-Mufrad [585]. Apa yang berada di antara tanda kurung adalah tambahan dari Al-Baihaqî [Shu'ab Al-Imân](4/228) melalui jalur yang berbeda."
        }
      ]
    }
  ]
},
  {
    "category_id": 9,
    "title": "Rumah & Keluarga",
    "group": [
        {
            "group_id": 2,
            "title": "Ketika Mengenakan Pakaian",
            "duas": [
                {
                    "id": 5,
                    "group_id": 2,
                    "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
                    "translation": "Segala puji bagi Allah yang telah memberi pakaian ini (pakaian) dan menganugerahkannya kepadaku, meskipun aku tidak berdaya dan tidak mampu.",
                    "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] dan Ibn Mâjah [3285]. Juga lihat Irwâ'-ul-Ghalîl (7/47)."
                }
            ]
        },
        {
            "group_id": 3,
            "title": "Ketika Mengenakan Pakaian Baru",
            "duas": [
                {
                    "id": 6,
                    "group_id": 3,
                    "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
                    "translation": "Ya Allah, segala puji hanya untuk-Mu, Engkau telah memberikanku pakaian ini, aku meminta kepada-Mu kebaikan dari pakaian ini dan kebaikan dari tujuan pembuatannya, dan aku berlindung kepada-Mu dari keburukan pakaian ini dan keburukan dari tujuan pembuatannya.",
                    "reference": "Abû Dâwud [4020] dan At-Tirmidhî [1767] serta Al-Baghawî. Redaksi ini berasal dari Abû Dâwud. Juga lihat Mukhtaŝar Shama'il At-Tirmidhî oleh Al-Albânî (hal. 47)."
                }
            ]
        },
        {
            "group_id": 4,
            "title": "Kepada Seseorang Yang Mengenakan Pakaian Baru",
            "duas": [
                {
                    "id": 7,
                    "group_id": 4,
                    "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
                    "translation": "Semoga kamu memakainya sampai usang dan Allah menggantinya dengan yang lain.",
                    "reference": "Abû Dâwud [4020](4/41). Juga lihat Ŝaĥiĥ Abû Dâwud (2/760)."
                },
                {
                    "id": 8,
                    "group_id": 4,
                    "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
                    "translation": "Kenakan yang baru, hiduplah dengan terpuji, dan wafatlah sebagai syahid.",
                    "reference": "Ibn Mâjah [3558](2/1178) dan Al-Baghawî (12/41). Juga lihat Ŝaĥiĥ Ibn Mâjah (2/275)."
                }
            ]
        },
        {
            "group_id": 5,
            "title": "Sebelum Melepaskan Pakaian",
            "duas": [
                {
                    "id": 9,
                    "group_id": 5,
                    "dua": "بِسْمِ اللهِ",
                    "translation": "Dengan nama Allah.",
                    "reference": "At-Tirmidhî [606](2/505) dan Sahîh Al-Jâmi' [3210](3/203). Juga lihat Irwâ'-ul-Ghalîl [50]."
                }
            ]
        },
        {
            "group_id": 6,
            "title": "Sebelum Masuk Kamar Mandi",
            "duas": [
                {
                    "id": 10,
                    "group_id": 6,
                    "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
                    "translation": "(Dengan nama Allah). Ya Allah, aku berlindung kepada-Mu dari segala kejahatan dan pelaku kejahatan.",
                    "reference": "Al-Bukhârî [142](1/45) dan Muslim [375](1/283). Riwayat dengan tambahan \"Dengan nama Allah\" dikumpulkan oleh Sa'eed bin Manŝoor, lihat Fatĥ al-Bârî (1/244)."
                }
            ]
        },
        {
            "group_id": 7,
            "title": "Setelah Keluar Dari Kamar Mandi",
            "duas": [
                {
                    "id": 11,
                    "group_id": 7,
                    "dua": "غُفْرَانَكَ",
                    "translation": "Aku meminta ampun kepada-Mu (ya Allah).",
                    "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] dan An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
                }
            ]
        },
        {
            "group_id": 10,
            "title": "Ketika Masuk Rumah",
            "duas": [
                {
                    "id": 16,
                    "group_id": 10,
                    "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
                    "translation": "Dengan nama Allah, aku bertawakal kepada Allah, dan tiada daya serta kekuatan kecuali dengan Allah.",
                    "reference": "Abû Dâwud [5094](4/325) dan At-Tirmidhî [3427](5/490). Juga lihat Ŝaĥiĥ At-Tirmidhî (3/151)."
                },
                {
                    "id": 17,
                    "group_id": 10,
                    "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
                    "translation": "Ya Allah, aku berlindung kepada-Mu agar aku tidak tersesat atau disesatkan, tergelincir atau dijatuhkan, menindas atau ditindas, bertindak bodoh atau diperlakukan bodoh.",
                    "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) dan Ibn Mâjah [3884]. Juga lihat Ŝaĥiĥ At-Tirmidhî (3/152) dan Ŝaĥiĥ Ibn Mâjah (2/336)."
                }
            ]
        },
        {
            "group_id": 11,
            "title": "Ketika Keluar Rumah",
            "duas": [
                {
                    "id": 18,
                    "group_id": 11,
                    "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
                    "translation": "Dengan nama Allah kami masuk dan dengan nama Allah kami keluar, dan kepada Tuhan kami kami bertawakal.",
                    "reference": "Abû Dâwud [5096](4/325) dan Syaikh Abdul 'Azîz bin Bâz menilai sanadnya ŧaĥan dalam [Tuĥfat al-Akhyâr](28)."
                }
            ]
        },
        {
            "group_id": 45,
            "title": "Untuk Mengusir Setan Dan Bisikannya",
            "duas": [
                {
                    "id": 141,
                    "group_id": 45,
                    "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
                    "translation": "Memohon perlindungan kepada Allah dari godaannya.",
                    "reference": "Abû Dâwud (1/206) dan At-Tirmidhî. Juga lihat Ŝaĥîĥ At-Tirmidhî (1/77)."
                },
                {
                    "id": 142,
                    "group_id": 45,
                    "dua": "الأذَانُ",
                    "translation": "Adzan (Panggilan untuk Sholat).",
                    "reference": "Al-Bukhârî [608](1/151) dan Muslim [389](1/291)."
                },
                {
                    "id": 143,
                    "group_id": 45,
                    "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
                    "translation": "Teks-teks zikir yang sahih dan pembacaan Al-Qur'an.",
                    "reference": "Muslim [780](1/539)."
                }
            ]
        },
        {
            "group_id": 79,
            "title": "Untuk Pengantin Baru",
            "duas": [
                {
                    "id": 190,
                    "group_id": 79,
                    "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
                    "translation": "Semoga Allah memberkatimu dan memberkati kalian berdua serta menyatukan kalian dalam kebaikan.",
                    "reference": "Abû Dâwud [2130], At-Tirmidhî [1091], dan Ibn Mâjah [1905]. Juga lihat Ŝaĥîĥ Ibn Mâjah (1/324)."
                }
            ]
        },
        {
            "group_id": 81,
            "title": "Sebelum Berhubungan Suami Istri",
            "duas": [
                {
                    "id": 192,
                    "group_id": 81,
                    "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
                    "translation": "Dengan nama Allah. Ya Allah, jauhkanlah kami dari setan dan jauhkan setan dari apa yang Engkau karuniakan kepada kami.",
                    "reference": "Al-Bukhârî [3271](6/141) dan Muslim [1434](2/1028)."
                }
            ]
        },
        {
            "group_id": 125,
            "title": "Ketika Takut Mengakibatkan Sesuatu Atau Seseorang Dengan Mata Satu",
            "duas": [
                {
                    "id": 244,
                    "group_id": 125,
                    "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
                    "translation": "Jika kamu melihat sesuatu dari saudaramu, dirimu atau hartamu yang membuatmu kagum, maka doakan berkah baginya, karena mata jahat itu benar adanya.",
                    "reference": "Aĥmad (4/447), Ibn Mâjah [3509] dan Mâlik [1697-1698]. Al-Albânî mengesahkannya dalam Ŝaĥîĥ Al-Jâmi' [556](1/212). Juga lihat penelitian Zâd al-Ma'âd oleh Al-Arnâ'ûť."
                }
            ]
        },
        {
            "group_id": 128,
            "title": "Untuk Menghindari Tipu Daya Setan Yang Keras Kepala",
            "duas": [
                {
                    "id": 247,
                    "group_id": 128,
                    "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
                    "translation": "Aku berlindung dengan kalimat-kalimat Allah yang sempurna yang tidak bisa dilanggar oleh orang baik atau buruk, dari segala keburukan yang Dia ciptakan, buat, dan sebarkan. (Aku berlindung) dari keburukan yang turun dari langit dan keburukan yang naik ke sana. (Aku berlindung) dari keburukan yang tersebar di Bumi dan keburukan yang muncul darinya, serta aku berlindung dari keburukan fitnah malam dan siang, dan keburukan siapa pun yang mengunjungi pada malam hari kecuali yang membawa kebaikan, Wahai Yang Maha Pengasih.",
                    "reference": "Aĥmad (3/419) dengan sanad Ŝaĥîĥ, Ibn As-Sunnî [637]. Al-Arnâ'ûť menyatakan sanadnya Ŝaĥîĥ dalam penelitiannya tentang Ať-Ťaĥawiyyah (hal. 133). Juga lihat Majma' Az-Zawâ'id (10/127)."
                }
            ]
        },
        {
            "group_id": 132,
            "title": "Aturan Umum Dan Manfaat",
            "duas": [
                {
                    "id": 267,
                    "group_id": 132,
                    "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
                    "translation": "Ketika malam tiba, tahanlah anak-anak kalian (agar tidak keluar) karena saat itu setan-setan berkeliaran. Setelah waktu tertentu berlalu, biarkan mereka. Tutup pintu-pintu kalian dan sebutlah nama Allah, karena setan tidak bisa membuka pintu yang tertutup, ikatlah kantong-kantong air kalian dan sebutlah nama Allah, tutuplah wadah-wadah kalian dengan apa pun dan sebutlah nama Allah, serta matikan lampu-lampu kalian.",
                    "reference": "Al-Bukhârî [5623](10/88) dan Muslim [2012](3/1595)."
                }
            ]
        }
    ]
},
  {
      "category_id": 10,
      "title": "Makanan & Minuman",
      "group": [
          {
              "group_id": 68,
              "title": "Ketika Berbuka Puasa",
              "duas": [
                  {
                      "id": 176,
                      "group_id": 68,
                      "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
                      "translation": "Rasa haus telah hilang, urat-urat telah basah, dan pahala telah tetap, insya Allah.",
                      "reference": "Abû Dâwud [2357](2/306). Juga lihat Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
                  },
                  {
                      "id": 177,
                      "group_id": 68,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
                      "translation": "Ya Allah, aku memohon kepada-Mu dengan rahmat-Mu yang meliputi segala sesuatu, agar Engkau mengampuniku.",
                      "reference": "Ibn Mâjah [1753](1/557) dan Al-Hâfiž menyatakannya Ĥasan dalam takhrîj Al-Athkâr. Juga lihat Sharĥ Al-Athkâr (4/342)."
                  }
              ]
          },
          {
              "group_id": 69,
              "title": "Sebelum Makan",
              "duas": [
                  {
                      "id": 178,
                      "group_id": 69,
                      "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
                      "translation": "Dengan nama Allah (di awal dan akhir)*.",
                      "reference": "* Kata-kata dalam tanda kurung diucapkan jika seseorang lupa membaca doa sebelum makan dan mengingatnya saat makan.Abû Dâwud [3767](3/347) dan At-Tirmidhî [1858](4/288). Juga lihat Ŝaĥîĥ At-Tirmidhî (2/167)."
                  },
                  {
                      "id": 179,
                      "group_id": 69,
                      "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
                      "translation": "(1) 'Ya Allah, berkahilah makanan ini bagi kami dan beri kami makanan yang lebih baik darinya.'Jika seseorang diberi susu, bacalah yang berikut sebagai gantinya:(2) 'Ya Allah, berkahilah bagi kami dan berilah kami lebih banyak darinya.'",
                      "reference": "Abû Dâwud [3767] dan An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî menyatakannya lemah, lihat Al-Kalam Ať-Ťayyib [184]."
                  }
              ]
          },
          {
              "group_id": 70,
              "title": "Setelah Makan",
              "duas": [
                  {
                      "id": 180,
                      "group_id": 70,
                      "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
                      "translation": "Segala puji bagi Allah yang memberi makanan ini kepadaku dan memberikannya kepadaku tanpa daya dan upaya dariku.",
                      "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] dan Ibn Mâjah [3285]. Juga lihat Ŝaĥîĥ At-Tirmidhî (3/159)."
                  },
                  {
                      "id": 181,
                      "group_id": 70,
                      "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
                      "translation": "Segala puji bagi Allah dengan pujian yang melimpah, baik, dan diberkahi, yang tidak pernah berakhir, pujian yang tidak pernah kita tinggalkan dan pujian yang sangat kita butuhkan, Dia adalah Tuhan kita.",
                      "reference": "Al-Bukhârî [5458](6/214) dan At-Tirmidhî [3456](5/507) dan redaksi ini berasal darinya."
                  }
              ]
          },
          {
              "group_id": 71,
              "title": "Doa Tamu Untuk Tuan Rumah",
              "duas": [
                  {
                      "id": 182,
                      "group_id": 71,
                      "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
                      "translation": "Ya Allah, berkahilah mereka dalam apa yang Engkau telah berikan kepada mereka, ampunilah mereka, dan rahmatilah mereka.",
                      "reference": "Muslim [2042](3/1615)."
                  }
              ]
          },
          {
              "group_id": 72,
              "title": "Untuk Seseorang Yang Menawarkan Minuman Atau Yang Berniat Melakukannya",
              "duas": [
                  {
                      "id": 183,
                      "group_id": 72,
                      "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                      "translation": "Ya Allah, beri makan kepada orang yang memberi makan kepadaku, dan beri minum kepada orang yang memberi minum kepadaku.",
                      "reference": "Muslim [2055](3/1626)."
                  }
              ]
          },
          {
              "group_id": 73,
              "title": "Ketika Berbuka Puasa Di Rumah Seseorang",
              "duas": [
                  {
                      "id": 184,
                      "group_id": 73,
                      "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
                      "translation": "Semoga orang-orang yang berpuasa berbuka di rumahmu, dan semoga orang-orang yang berbakti dan saleh memakan makananmu, dan semoga para malaikat mengirimkan doa untukmu.",
                      "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) dan An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî mengesahkannya dalam Ŝaĥîĥ Abû Dâwud (2/730)."
                  }
              ]
          },
          {
              "group_id": 74,
              "title": "Bagi Seseorang Yang Berpuasa Ketika Diberi Makanan Tetapi Tidak Membatalkan Puasanya",
              "duas": [
                  {
                      "id": 185,
                      "group_id": 74,
                      "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
                      "translation": "Jika salah seorang dari kalian diundang (untuk makan), maka hadirilah. Jika kalian sedang berpuasa, maka berdoalah (untuk orang-orang yang hadir), dan jika kalian tidak berpuasa, maka makanlah. (Makna 'berdoa' di sini adalah 'memohonkan doa').",
                      "reference": "Muslim [1431](2/1054)."
                  }
              ]
          }
      ]
  },
  {
    "category_id": 11,
    "title": "Sakit & Kematian",
    "group": [
      {
        "group_id": 48,
        "title": "Menempatkan Anak-anak di Bawah Perlindungan Allah",
        "duas": [
          {
            "id": 146,
            "group_id": 48,
            "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
            "translation": "Aku memohonkan perlindungan untuk kalian berdua dengan kalimat-kalimat Allah yang sempurna dari setiap setan, binatang berbahaya, dan dari setiap mata yang jahat.",
            "reference": "Al-Bukhârî [3371](4/119)."
          }
        ]
      },
      {
        "group_id": 49,
        "title": "Ketika Menjenguk Orang Sakit",
        "duas": [
          {
            "id": 147,
            "group_id": 49,
            "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
            "translation": "Tidak apa-apa, semoga penyakit ini menjadi penghapus dosa, jika Allah menghendaki.",
            "reference": "Al-Bukhârî [3616](10/118)."
          },
          {
            "id": 148,
            "group_id": 49,
            "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
            "translation": "Aku memohon kepada Allah Yang Mahaagung, Tuhan Arasy yang agung, agar menyembuhkanmu. (Dibaca tujuh kali)",
            "reference": "At-Tirmidhî [2083] dan Abû Dâwud [3106]. Lihat juga Ŝaĥîĥ At-Tirmidhî (2/210) dan Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
          }
        ]
      },
      {
        "group_id": 50,
        "title": "Keutamaan Menjenguk Orang Sakit",
        "duas": [
          {
            "id": 149,
            "group_id": 50,
            "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
            "translation": "Jika seseorang menjenguk saudaranya yang Muslim yang sedang sakit, ia berjalan seperti memetik buah di surga hingga ia duduk, dan ketika ia duduk, ia diliputi rahmat. Jika ia menjenguk di pagi hari, tujuh puluh ribu malaikat akan mendoakannya hingga sore, dan jika ia menjenguk di sore hari, tujuh puluh ribu malaikat akan mendoakannya hingga pagi.",
            "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] dan Aĥmad (1/97). Lihat juga Ŝaĥîĥ Ibn Mâjah (1/244) dan Ŝaĥîĥ At-Tirmidhî (1/286). Shaykh Aĥmad Shâkir juga menyatakannya sahih."
          }
        ]
      },
      {
        "group_id": 51,
        "title": "Ketika Orang Sakit Telah Menyerah dan Putus Asa dari Kehidupan",
        "duas": [
          {
            "id": 150,
            "group_id": 51,
            "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
            "translation": "Ya Allah, ampunilah aku, rahmatilah aku, dan pertemukan aku dengan para sahabat yang lebih tinggi derajatnya.",
            "reference": "Al-Bukhârî [4440](7/10) dan Muslim [2444](4/1893)."
          },
          {
            "id": 151,
            "group_id": 51,
            "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
            "translation": "Tiada yang berhak disembah selain Allah, sesungguhnya kematian itu memiliki rasa sakit.",
            "reference": "Al-Bukhârî [4449](8/144)."
          },
          {
            "id": 152,
            "group_id": 51,
            "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "Tiada yang berhak disembah selain Allah dan Allah Maha Besar. Tiada yang berhak disembah selain Allah, sendirian. Tiada yang berhak disembah selain Allah, sendirian, tanpa sekutu. Tiada yang berhak disembah selain Allah, milik-Nya seluruh kerajaan dan segala puji. Tiada yang berhak disembah selain Allah, dan tidak ada kekuatan serta daya upaya kecuali dengan Allah.",
            "reference": "At-Tirmidhî [3430] dan Ibn Mâjah [3794]. Al-Albânî menyatakannya sahih. Lihat juga Ŝaĥîĥ At-Tirmidhî (3/152) dan Ŝaĥîĥ Ibn Mâjah (2/317)."
          }
        ]
      },
      {
        "group_id": 52,
        "title": "Instruksi untuk Orang yang Mendekati Kematian",
        "duas": [
          {
            "id": 153,
            "group_id": 52,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "Barangsiapa yang kata-kata terakhirnya adalah 'Tiada yang berhak disembah selain Allah', maka ia akan masuk surga.",
            "reference": "Abû Dâwud [3116](3/190). Lihat juga Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
          }
        ]
      },
      {
        "group_id": 54,
        "title": "Ketika Menutup Mata Orang yang Sudah Meninggal",
        "duas": [
          {
            "id": 155,
            "group_id": 54,
            "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
            "translation": "Ya Allah, ampunilah (nama almarhum), angkatlah derajatnya di antara orang-orang yang diberi petunjuk, gantilah dia di antara keturunannya yang tersisa, ampunilah kami dan dia, wahai Tuhan sekalian alam. Lapangkan kuburnya dan terangilah dia di dalamnya.",
            "reference": "Muslim [920](2/634)."
          }
        ]
      },
      {
        "group_id": 55,
        "title": "Doa untuk Orang yang Sudah Meninggal dalam Shalat Jenazah",
        "duas": [
          {
            "id": 156,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
            "translation": "Ya Allah, ampunilah dia, rahmatilah dia, maafkanlah dia, muliakanlah tempat tinggalnya, lapangkanlah pintu masuknya, bersihkanlah dia dengan air, salju, dan embun, dan sucikanlah dia dari dosa seperti Engkau mensucikan pakaian putih dari kotoran. Gantikanlah rumahnya dengan rumah yang lebih baik, keluarganya dengan keluarga yang lebih baik, dan pasangan hidupnya dengan pasangan hidup yang lebih baik. Masukkanlah dia ke dalam surga dan lindungilah dia dari siksa kubur (dan siksa neraka).",
            "reference": "Muslim [963](2/663)."
          },
          {
            "id": 157,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
            "translation": "Ya Allah, ampunilah orang yang masih hidup dan yang sudah meninggal di antara kami, yang hadir dan yang tidak hadir, yang muda dan yang tua, yang laki-laki dan yang perempuan. Ya Allah, barang siapa yang Engkau hidupkan di antara kami, maka hidupkanlah dia dalam Islam, dan barang siapa yang Engkau wafatkan di antara kami, maka wafatkanlah dia dalam iman. Ya Allah, janganlah Engkau haramkan kami dari pahalanya, dan janganlah Engkau sesatkan kami setelahnya.",
            "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] dan Aĥmad (2/368). Lihat juga Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 158,
            "group_id": 55,
            "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
            "translation": "Ya Allah, si fulan bin fulan ini berada dalam penjagaan dan perlindungan-Mu, maka lindungilah dia dari fitnah kubur dan siksa api neraka. Engkau adalah Dzat yang Maha Pemegang Janji dan Kebenaran. Ampunilah dia, rahmatilah dia, sungguh Engkau adalah Dzat yang Maha Pengampun dan Maha Penyayang.",
            "reference": "Ibn Mâjah [1499] dan Abû Dâwud (3/211). Lihat juga Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 159,
            "group_id": 55,
            "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
            "translation": "Ya Allah, hamba-Mu dan anak hamba perempuan-Mu ini memerlukan rahmat-Mu, sedangkan Engkau tidak memerlukan azabnya. Jika ia adalah orang yang berbuat baik, tambahkanlah kebaikan kepadanya, dan jika ia adalah orang yang berbuat buruk, maafkanlah kesalahannya.",
            "reference": "Al-Hâkim (1/359) dan beliau menyatakannya sahih dan Adh-Dhahabî setuju dengannya. Lihat juga Aĥkâm Al-Janâ'iz oleh Al-Albânî (hlm. 125)."
          }
        ]
      },
      {
        "group_id": 56,
        "title": "Ketika Yang Meninggal Adalah Seorang Anak, Saat Shalat Jenazah",
        "duas": [
          {
            "id": 160,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
            "translation": "Ya Allah, jadikanlah dia sebagai simpanan dan tabungan untuk kedua orang tuanya, serta pemberi syafaat yang diterima. Ya Allah, jadikanlah timbangan pahala mereka menjadi berat karenanya dan besarkanlah pahala mereka. Satukanlah dia dengan orang-orang mukmin yang saleh, tempatkanlah dia dalam perawatan Ibrahim, lindungilah dia dengan rahmat-Mu dari siksa api neraka, dan berikanlah rumah yang lebih baik dari rumahnya, serta keluarga yang lebih baik dari keluarganya. Ya Allah, ampunilah leluhur kami, keturunan kami, dan siapa pun yang telah mendahului kami dengan iman.",
            "reference": "Lihat Al-Mughnî oleh Ibn Qudâmah (3/416) dan Ad-Durûs Al-Muhimmah Li'âmah Al-Ummah oleh Shaykh Ibn Bâz (hlm. 15)."
          },
          {
            "id": 161,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
            "translation": "Ya Allah, jadikanlah dia sebagai simpanan, pendahulu, dan pahala bagi kami.",
            "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
          }
        ]
      },
      {
        "group_id": 57,
        "title": "Ucapan Belasungkawa",
        "duas": [
          {
            "id": 162,
            "group_id": 57,
            "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
            "translation": "Sesungguhnya milik Allah apa yang Dia ambil, dan milik-Nya apa yang Dia berikan, dan segala sesuatu di sisi-Nya ada batas waktunya...Maka bersabarlah dan carilah pahala.",
            "reference": "Al-Bukhârî [1284](2/80) dan Muslim [923](2/636)."
          }
        ]
      },
      {
        "group_id": 58,
        "title": "Ketika Menempatkan Jenazah dalam Kubur",
        "duas": [
          {
            "id": 163,
            "group_id": 58,
            "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
            "translation": "Dengan nama Allah dan di atas sunnah Rasulullah.",
            "reference": "Abû Dâwud [3213](3/314) dengan sanad sahih dan Aĥmad (2/40) dengan lafaz: (بسم الله و على ملة رسول الله) dan sanadnya sahih."
          }
        ]
      },
      {
        "group_id": 59,
        "title": "Setelah Memakamkan Jenazah",
        "duas": [
          {
            "id": 164,
            "group_id": 59,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
            "translation": "Ya Allah, ampunilah dia, ya Allah, teguhkanlah dia.",
            "reference": "Abû Dâwud [3221](3/315) dan Al-Hâkim (1/370) serta beliau menyatakannya sahih dan Adh-Dhahabî setuju dengannya."
          }
        ]
      },
      {
        "group_id": 60,
        "title": "Ketika Ziarah Kubur",
        "duas": [
          {
            "id": 165,
            "group_id": 60,
            "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
            "translation": "Semoga keselamatan atas kalian, wahai penghuni kubur, di antara orang-orang mukmin dan muslim. Sesungguhnya kami akan menyusul kalian, insya Allah. Kami memohon keselamatan bagi kami dan bagi kalian.",
            "reference": "Muslim [975](2/671) dan Ibn Mâjah [1547](1/494). Lafaz dalam kurung berasal dari hadis 'Â'ishah yang diriwayatkan oleh Muslim [974](2/671)."
          }
        ]
      },
      {
        "group_id": 124,
        "title": "Ketika Merasakan Sakit di Tubuh",
        "duas": [
          {
            "id": 243,
            "group_id": 124,
            "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
            "translation": "Bacalah 'Dengan nama Allah.' (tiga kali) kemudian lanjutkan dengan 'Aku berlindung kepada Allah dan di dalam kekuasaan-Nya dari keburukan yang aku rasakan dan khawatirkan.' (tujuh kali).",
            "reference": "Muslim [2202](4/1728)."
          }
        ]
      }
    ]
  }
]