[
  {
   "category_id": 1,
    "title": "सुबह और शाम",
    "group": [
      {
        "group_id": 1,
        "title": "जागने पर",
        "duas": [
          {
            "id": 1,
            "group_id": 1,
            "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
            "translation": "उस अल्लाह की प्रशंसा हो, जिसने हमें मृत्यु के बाद फिर से जीवन दिया, और उसी की ओर लौटना है।",
            "reference": "Al-Bukhârî [6312], see Fatĥ al-Bârî (11/113) and Muslim [2711](4/2083)."
          },
          {
            "id": 2,
            "group_id": 1,
            "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
            "translation": "अल्लाह के सिवा कोई इबादत के लायक नहीं, जो अकेला है, उसका कोई साझेदार नहीं है। उसी का राज्य है और उसी की प्रशंसा है, और वह हर चीज़ पर क़ाबिल है। अल्लाह की महिमा है, और अल्लाह की प्रशंसा है। अल्लाह के सिवा कोई इबादत के लायक नहीं है। अल्लाह सबसे महान है। अल्लाह की अनुमति के बिना कोई ताकत या शक्ति नहीं है, जो सबसे ऊँचा और महान है। ऐ मेरे रब, मुझे माफ़ कर। (जो कोई यह कहेगा, उसे माफ़ कर दिया जाएगा, और अगर वह अल्लाह से दुआ करेगा, तो उसकी दुआ कुबूल की जाएगी; अगर वह वुज़ू करेगा और नमाज़ पढ़ेगा, तो उसकी नमाज़ कुबूल होगी)।",
            "reference": "Al-Bukhârî [1154], see Fatĥ al-Bârî (3/39) and the wording is of Ibn Mâjah (2/335), also see Ŝaĥiĥ Ibn Mâjah (2/335). "
          },
          {
            "id": 3,
            "group_id": 1,
            "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
            "translation": "उस अल्लाह की प्रशंसा हो जिसने मेरे शरीर को ताकत दी, मेरी आत्मा को मुझे लौटाया और मुझे उसका ज़िक्र करने की अनुमति दी।",
            "reference": "At-Tirmidhî [3401](5/473), also see Ŝaĥiĥ At-Tirmidhî (3/144)."
          },
          {
            "id": 4,
            "group_id": 1,
            "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
            "translation": "सूरह आले-इमरान [3:190-200] की तिलावत करें।",
            "reference": "Al-Bukhârî [4572], see Fatĥ al-Bârî (8/237) and Muslim [763](1/530)."
          }
        ]
      },
      {
        "group_id": 27,
        "title": "सुबह और शाम में",
        "duas": [
          {
            "id": 75,
            "group_id": 27,
            "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
            "translation": "जो कोई सुबह के समय यह (आयत अल-कुर्सी) कहेगा, उसे शाम तक जिन्नों से सुरक्षा मिलेगी, और जो शाम को इसे कहेगा, उसे सुबह तक सुरक्षा मिलेगी।",
            "reference": "Al-Hâkim (1/562) and Al-Albânî authenticated it in Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) and he attributed it to An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] and Ťabarânî [Al-Kabîr][541] and said that the latter's chain is good."
          },
          {
            "id": 76,
            "group_id": 27,
            "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
            "translation": "तिलावत करें:1. सूरह इख़लास (कुरआन: 112)2. सूरह अल-फ़लक (कुरआन: 113)3. सूरह अन-नास (कुरआन: 114)[3 बार]",
            "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Also see Ŝaĥîĥ At-Tirmidhî (3/182)."
          },
          {
            "id": 77,
            "group_id": 27,
            "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
            "translation": "'हमने सुबह में प्रवेश किया और इसके साथ ही संपूर्ण राज्य अल्लाह का है। अल्लाह की प्रशंसा है। उसके सिवा कोई इबादत के लायक नहीं है। जो अकेला है, उसका कोई साझेदार नहीं। राज्य अल्लाह का है, और उसी की प्रशंसा है और वह हर चीज़ पर सक्षम है। ऐ मेरे रब, मैं तुझसे इस दिन की भलाई मांगता हूँ और इसके बाद के दिनों की भलाई भी, और मैं तुझसे इस दिन की बुराई से और इसके बाद के दिनों की बुराई से पनाह मांगता हूँ। ऐ मेरे रब, मैं तुझसे आलस्य और बुज़ुर्गी की बुराई से पनाह मांगता हूँ। ऐ मेरे रब, मैं तुझसे जहन्नम की आग के अज़ाब और क़ब्र के अज़ाब से पनाह मांगता हूँ।'रात में इसके स्थान पर पढ़ें:'हमने शाम में प्रवेश किया और इसके साथ ही संपूर्ण राज्य अल्लाह का है...' और:'...ऐ मेरे रब, मैं तुझसे इस रात की भलाई और इसके बाद की रातों की भलाई मांगता हूँ, और मैं तुझसे इस रात की बुराई से और इसके बाद की रातों की बुराई से पनाह मांगता हूँ...'",
            "reference": "Muslim [2723](4/2088)."
          },
          {
            "id": 78,
            "group_id": 27,
            "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
            "translation": "'हे अल्लाह, तेरी अनुमति से हमने सुबह की, और तेरी अनुमति से हमने शाम की। तेरी अनुमति से हम जीते हैं और मरते हैं, और तेरी ओर ही हमारा पुनरुत्थान है।'रात में यह कहें:'हे अल्लाह, तेरी अनुमति से हमने शाम की, और तेरी अनुमति से हमने सुबह की, तेरी अनुमति से हम जीते हैं और मरते हैं, और तेरी ओर ही हमारा लौटना है।'",
            "reference": "At-Tirmidhî [3391](5/466). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
          },
          {
            "id": 79,
            "group_id": 27,
            "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
            "translation": "हे अल्लाह, तू मेरा रब है, तेरे सिवा कोई इबादत के लायक नहीं है, तूने मुझे बनाया और मैं तेरा बंदा हूं, मैं अपनी क्षमता के अनुसार तेरे वादे पर कायम हूं। मैंने जो बुराई की है, उससे मैं तेरी पनाह चाहता हूं। मैं तेरी दी हुई नेमतों का इकरार करता हूं और अपने गुनाहों का भी, तो मुझे माफ कर, क्योंकि तेरे सिवा कोई गुनाह माफ नहीं कर सकता।",
            "reference": "Al-Bukhârî [6306](7/150)."
          },
          {
            "id": 80,
            "group_id": 27,
            "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
            "translation": "हे अल्लाह, मैं गवाही देता हूं और तेरे अर्श के वाहकों, तेरे फरिश्तों और सारी मख्लूक को गवाह बनाता हूं कि तू ही अल्लाह है, तेरे सिवा कोई इबादत के लायक नहीं है, तू अकेला है और तेरा कोई साझीदार नहीं है, और मोहम्मद (ﷺ) तेरा बंदा और रसूल है। [चार बार]",
            "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] and Ibn As-Sunnî [70]. Shaykh Ibn Bâz declared the chain of An-Nisâ'i and Abû Dâwud, Hasan in [Tuĥfat Al-Akhyâr][pg. 23]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [25]."
          },
          {
            "id": 81,
            "group_id": 27,
            "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
            "translation": "हे अल्लाह, जो नेमत मुझे या तेरी मख्लूक को मिली है, वह सिर्फ तेरी तरफ से है, और तेरा कोई साझीदार नहीं है, तेरी ही तारीफ है और तेरा ही शुक्र है।",
            "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Shaykh Ibn Bâz declared its chain Ĥasan in [Tuĥfat Al-Akhyâr][pg. 24]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [26]."
          },
          {
            "id": 82,
            "group_id": 27,
            "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
            "translation": "हे अल्लाह, मेरे शरीर को सेहतमंद बना, हे अल्लाह, मेरी सुनने की शक्ति को सेहतमंद बना, हे अल्लाह, मेरी देखने की शक्ति को सेहतमंद बना। तेरे सिवा कोई इबादत के लायक नहीं है। हे अल्लाह, मैं कुफ्र और गरीबी से पनाह मांगता हूं, और कब्र के अजाब से पनाह मांगता हूं; तेरे सिवा कोई इबादत के लायक नहीं है। [तीन बार]",
            "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 26]. Al-Albânî declared it weak. See Ďa'îf Al-J Al-Jâmi' [1210]."
          },
          {
            "id": 83,
            "group_id": 27,
            "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
            "translation": "अल्लाह मेरे लिए काफी है, उसके सिवा कोई इबादत के लायक नहीं है, मैंने उसी पर भरोसा किया, और वह अर्श का रब है। [सात बार]",
            "reference": "Ibn As-Sunnî [71][Marfû'] and Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic. Also see Zâd al-Ma'âd (2/376). Al-Albânî declared it weak. See Ďa'îf Abî Dâwud."
          },
          {
            "id": 84,
            "group_id": 27,
            "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
            "translation": "हे अल्लाह, मैं तुझसे इस दुनिया और आखिरत में माफी और सेहतमंदी मांगता हूं। हे अल्लाह, मैं तुझसे अपने धर्म, अपनी दुनिया, अपने परिवार और अपनी दौलत के लिए माफी और सेहतमंदी मांगता हूं। हे अल्लाह, मेरी कमजोरियों को छिपा और मेरे डर को दूर कर। हे अल्लाह, मुझे सामने, पीछे, दाएं, बाएं और ऊपर से महफूज़ रख, और मैं तेरी महानता से पनाह मांगता हूं कि मुझे धरती से निगल लिया जाए।",
            "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Also see Ŝaĥîĥ Ibn Mâjah (2/332)."
          },
          {
            "id": 85,
            "group_id": 27,
            "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
            "translation": "हे अल्लाह, जो ग़ैब और हाज़िर को जानने वाला है, जिसने आसमानों और धरती को पैदा किया, हर चीज़ का रब और मालिक है, मैं गवाही देता हूं कि तेरे सिवा कोई इबादत के लायक नहीं है। मैं तुझसे अपनी आत्मा की बुराई और शैतान की बुराई और उसके शिर्क से पनाह मांगता हूं, और मैं तुझसे यह भी पनाह मांगता हूं कि मैं अपने आप पर कोई बुराई लाऊं या किसी मुसलमान पर।",
            "reference": "At-Tirmidhî [3392] and Abû Dâwud [5067]. Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
          },
          {
            "id": 86,
            "group_id": 27,
            "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
            "translation": "अल्लाह के नाम के साथ, जिसके नाम के साथ न तो धरती में और न ही आसमान में कुछ भी नुकसान पहुंचा सकता है, और वह सुनने वाला और जानने वाला है। [तीन बार]",
            "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Also see Ŝaĥîĥ Ibn Mâjah (2/332). Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 39]."
          },
          {
            "id": 87,
            "group_id": 27,
            "dua": " رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
            "translation": "मैं अल्लाह को रब के रूप में, इस्लाम को धर्म के रूप में और मोहम्मद को नबी के रूप में पसंद करता हूं। [तीन बार]",
            "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) and At-Tirmidhî [3389](5/465). Shaykh Ibn Bâz declared it Ĥasan in [Tuĥfat Al-Akhyâr][39]."
          },
          {
            "id": 88,
            "group_id": 27,
            "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
            "translation": "हे हमेशा ज़िंदा रहने वाले, हे सब कुछ संभालने वाले, मैं तेरी रहमत से मदद मांगता हूं, मेरे सभी मामलों को सुधार दे और मुझे मेरी आत्मा के भरोसे न छोड़, चाहे एक पल के लिए भी।",
            "reference": "Al-Hâkim (1/545); he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
          },
          {
            "id": 89,
            "group_id": 27,
            "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
            "translation": "'हमने सुबह की और इस वक्त तमाम हुकूमत अल्लाह, सारे जहान के रब की है। हे अल्लाह, मैं तुझसे इस दिन की भलाई, इसकी फतह, इसकी रोशनी, इसकी बरकत और इसकी हिदायत मांगता हूं, और मैं तुझसे इस दिन की बुराई और उसके बाद की बुराई से पनाह मांगता हूं।'रात में कहें:'हमने शाम की और इस वक्त तमाम हुकूमत अल्लाह, सारे जहान के रब की है। हे अल्लाह, मैं तुझसे इस रात की भलाई, इसकी फतह, इसकी रोशनी, इसकी बरकत और इसकी हिदायत मांगता हूं, और मैं तुझसे इस रात की बुराई और उसके बाद की बुराई से पनाह मांगता हूं।'",
            "reference": "Abû Dâwud [5084](4/322), Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared its chain Ĥasan in their research of Zâd al-Ma'âd (2/273)."
          },
          {
            "id": 90,
            "group_id": 27,
            "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
            "translation": "हम इस्लाम की फितरत पर, इखलास के कलमा पर, हमारे नबी मोहम्मद के धर्म पर, और हमारे पिता इब्राहीम के धर्म पर, जो एक सच्चे मुसलमान थे और मुशरिकों में से नहीं थे, सुबह करते हैं।रात में कहें: 'हम इस्लाम की फितरत पर शाम करते हैं।'",
            "reference": "Aĥmad (3/406,407) and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Also see Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
          },
          {
            "id": 91,
            "group_id": 27,
            "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
            "translation": "अल्लाह पवित्र है और मैं उसकी प्रशंसा करता हूं। [सौ बार]",
            "reference": "Muslim [2723](4/2071)."
          },
          {
            "id": 92,
            "group_id": 27,
            "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
            "translation": "अल्लाह के सिवा कोई इबादत के लायक नहीं है, वह अकेला है, उसका कोई साझीदार नहीं है, उसी का राज्य है, उसी की प्रशंसा है, और वह हर चीज़ पर सक्षम है।   या  ।",
            "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] from the ĥadîth of Abu Ayûb Al-Anŝârî  (May Allah be pleased with him). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb [650](1/272) and Tuĥfat Al-Akhyâr (pg. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] and Aĥmad (4/60). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb (1/270), Ŝaĥîĥ Abî  Dâwud  (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) and Zâd Al-Ma'âd (2/377)."
          },
          {
                "id": 93,
                "group_id": 27,
                "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
                "translation": "अल्लाह के सिवा कोई इबादत के लायक नहीं है, वह अकेला है, उसका कोई साझीदार नहीं है, उसी का राज्य है, उसी की प्रशंसा है, और वह हर चीज़ पर सक्षम है। [सुबह सौ बार]",
                "reference": "Al-Bukhârî [3293](4/95) and Muslim [2691](4/2071)."
              },
          {
            "id": 94,
            "group_id": 27,
            "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
            "translation": "अल्लाह पवित्र है और मैं उसकी प्रशंसा करता हूं, उसकी मख्लूक की संख्या, उसकी खुदा की रज़ा, उसके अर्श का वजन, और उसके कलमों की स्याही के बराबर। [सुबह तीन बार]",
            "reference": "Muslim [2726](4/2090)."
          },
          {
            "id": 95,
            "group_id": 27,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
            "translation": "हे अल्लाह, मैं तुझसे नफ़ा देने वाला इल्म, पाक रिज़्क और कबूल होने वाले अमल की दुआ करता हूं। [सुबह]",
            "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] and Ibn Mâjah [925]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic in their research of Zâd al-Ma'âd (2/375)."
          },
          {
            "id": 96,
            "group_id": 27,
            "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
            "translation": "मैं अल्लाह से माफ़ी मांगता हूं और उसकी तरफ़ तौबा करता हूं। [दिन में सौ बार]",
            "reference": "Al-Bukhârî [6307](11/101) and Muslim [2702](4/2075)."
          },
          {
            "id": 97,
            "group_id": 27,
            "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
            "translation": "मैं अल्लाह के मुकम्मल कलाम की पनाह चाहता हूं उसकी मख्लूक की बुराइयों से। [शाम में तीन बार]",
            "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Also see Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) and Tuĥfat Al-Akhyâr (p. 45)."
          },
          {
            "id": 98,
            "group_id": 27,
            "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
            "translation": "हे अल्लाह, हमारे नबी मोहम्मद पर रहमत और सलाम भेज। [दस बार]",
            "reference": "Ať-Ťabarânî through two chains, one of which is good. See Majm'u Az-Zawâ 'id (10/120) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
          }
  ]
},
      {
        "group_id": 28,
        "title": "सोने से पहले",
        "duas": [
          {
            "id": 99,
            "group_id": 28,
            "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
            "translation": "हर रात सोने से पहले, नबी (सल्लल्लाहु अलैहि व सल्लम) अपनी हथेलियों को मिलाते, उनमें फूंकते, कुरान की आखिरी तीन सूरतें पढ़ते और फिर अपने पूरे शरीर पर जितना हो सके हाथ से फेरते, सबसे पहले सिर और चेहरे से शुरू करते और फिर शरीर के बाकी हिस्सों पर फेरते; ऐसा तीन बार करते।",
            "reference": "Al-Bukhârî [5017](9/62) and Muslim [2192](4/1723)."
          },
          {
            "id": 100,
            "group_id": 28,
            "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
            "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने यह भी कहा: 'जब तुम सोने लगो तो आयत अल-कुर्सी पढ़ो, क्योंकि अल्लाह की तरफ से तुम्हारे ऊपर सुरक्षा बनी रहेगी और कोई शैतान सुबह तक तुम्हारे पास नहीं आएगा।'",
            "reference": "Al-Bukhârî [2311](4/487)."
          },
          {
            "id": 101,
            "group_id": 28,
            "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
            "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने यह भी कहा: 'जो कोई रात को सूरह अल-बकरह की आखिरी दो आयतें पढ़ेगा; ये दो आयतें उसे काफी होंगी।'",
            "reference": "Al-Bukhârî [4008](9/94) and Muslim [808](1/554)."
          },
          {
            "id": 102,
            "group_id": 28,
            "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
            "translation": "अगर तुम में से कोई बिस्तर से उठे और फिर लौटे तो अपने कपड़े के किनारे से उसे तीन बार साफ़ करे क्योंकि उसे नहीं पता कि उसकी गैरमौजूदगी में वहां क्या हुआ, और जब वह लेट जाए तो यह दुआ करे: 'हे मेरे रब, मैं तेरे नाम के साथ लेटता हूं और तेरे नाम के साथ उठता हूं, अगर तू मेरी आत्मा को पकड़ ले तो उस पर रहम कर, और अगर तू उसे लौटा दे तो उसे उसी तरह से बचा जैसे तू अपने नेक बंदों को बचाता है।'",
            "reference": "Al-Bukhârî [6320](11/126) and Muslim [2714](4/2084)."
          },
          {
            "id": 103,
            "group_id": 28,
            "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
            "translation": "हे अल्लाह, तूने मेरी आत्मा को पैदा किया है और तू ही इसे ले जाएगा, इसका मरना और जीना तुझी से है। अगर तू इसे जिंदा रखे तो इसकी हिफ़ाज़त कर, और अगर तू इसे मौत दे दे तो इसे माफ़ कर दे। हे अल्लाह, मैं तुझसे सेहत की दुआ करता हूं।",
            "reference": "Muslim [2712](4/2083) and Aĥmad (2/79)."
          },
          {
              "id": 104,
              "group_id": 28,
              "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
              "translation": "हे अल्लाह, मुझे तेरे अजाब से महफूज़ रख, जिस दिन तू अपने बंदों को दोबारा जिंदा करेगा।",
              "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
            },
          {
            "id": 105,
            "group_id": 28,
            "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
            "translation": "तेरे नाम के साथ, हे अल्लाह, मैं मरता हूं और जीता हूं।",
            "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
          },
          {
            "id": 106,
            "group_id": 28,
            "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
            "translation": "अल्लाह पवित्र है [33 बार]।अल्लाह की प्रशंसा है [33 बार]।अल्लाह सबसे बड़ा है [34 बार]।",
            "reference": "Al-Bukhârî [3705](7/71) and Muslim [2727](4/2091)."
          },
          {
            "id": 107,
            "group_id": 28,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
            "translation": "हे अल्लाह, सातों आसमानों के रब, ज़मीन के रब, महान अर्श के रब, हमारे रब और हर चीज़ के रब, बीज और गुठली के फाड़ने वाले, तौरात, इंजील और कुरान को नाज़िल करने वाले, मैं तुझसे हर उस चीज़ की बुराई से पनाह चाहता हूं, जिसका तू मालिक है। हे अल्लाह, तू पहला है, तेरे से पहले कुछ नहीं है, तू आखिरी है, तेरे बाद कुछ नहीं है, तू ज़ाहिर है, तेरे से ऊपर कुछ नहीं है, तू बातिन है, तेरे से नीचे कुछ नहीं है। हमारे कर्ज़ को अदा कर और हमें गरीबी से बचा।",
            "reference": "Muslim [2713](4/2084)."
          },
          {
            "id": 108,
            "group_id": 28,
            "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
            "translation": "अल्लाह की तारीफ है, जिसने हमें खाना और पानी दिया, हमें काफी किया और हमें पनाह दी। कितने ही लोग ऐसे हैं जिनके पास न कोई उन्हें काफी करने वाला है और न कोई उन्हें पनाह देने वाला है।",
            "reference": "Muslim [2715](4/2085)."
          },
          {
            "id": 109,
            "group_id": 28,
            "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
            "translation": "हे अल्लाह, ग़ैब और हाज़िर का जानने वाला, आसमानों और ज़मीन का पैदा करने वाला, हर चीज़ का रब और मालिक, मैं गवाही देता हूं कि तेरे सिवा कोई इबादत के लायक नहीं है। मैं तुझसे अपनी आत्मा की बुराई और शैतान की बुराई और उसके शिर्क से पनाह मांगता हूं, और तुझसे यह भी पनाह मांगता हूं कि मैं अपनी आत्मा पर कोई बुराई लादूं या उसे किसी मुसलमान पर थोपूं।",
            "reference": "Abû Dâwud [5083](4/317). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
          },
          {
            "id": 110,
            "group_id": 28,
            "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
            "translation": "सूरह अस-सज्दा और सूरह अल-मुल्क पढ़ें।",
            "reference": "At-Tirmidhî [3404] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]. Also see Ŝaĥîĥ Al-Jâmi' [4873](4/255)."
          },
          {
            "id": 111,
            "group_id": 28,
            "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
            "translation": "हे अल्लाह, मैंने अपनी आत्मा को तेरे सुपुर्द किया, अपने मामले को तेरे हवाले किया, अपने चेहरे को तेरी ओर किया, और अपनी पीठ को तेरी ओर मोड़ा, तेरी ओर उम्मीद और डर दोनों के साथ। तेरे सिवा कोई पनाह नहीं है, न कोई बचाव है। मैंने तेरी किताब पर ईमान लाया जिसे तूने नाज़िल किया, और तेरे नबी पर जिसे तूने भेजा।",
            "reference": "Al-Bukhârî [6313,6315,7488](11/113) and Muslim [2710](4/2081)."
          }
  ]
},
      {
        "group_id": 29,
        "title": "रात में करवट बदलने पर",
        "duas": [
          {
            "id": 112,
            "group_id": 29,
            "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
            "translation": "अल्लाह के सिवा कोई इबादत के लायक नहीं है, वह अकेला है, अल-क़ह्हार, आसमानों और ज़मीन का रब और उनके बीच की हर चीज़ का मालिक, वह सबसे शक्तिशाली, सबसे माफ़ करने वाला है।",
            "reference": "Al-Hâkim (1/540) and he authenticated it and Adh-Dhahabî agreed with him, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757). Also see Ŝaĥîĥ Al-Jâmi' [4693](4/213)."
          }
        ]
      },
      {
        "group_id": 30,
        "title": "नींद के दौरान बेचैनी, डर, घबराहट महसूस होने पर",
        "duas": [
          {
            "id": 113,
            "group_id": 30,
            "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
            "translation": "मैं अल्लाह के मुकम्मल कलाम की पनाह चाहता हूं उसके गुस्से और सजा से, और उसके बंदों की बुराई से, और शैतानों के हमले और उनके हाज़िर होने से।",
            "reference": "Abû Dâwud [3893](4/12). Also see Ŝaĥîĥ At-Tirmidhî (3/171)."
          }
        ]
      },
      {
        "group_id": 31,
        "title": "अच्छा या बुरा सपना देखने पर",
        "duas": [
          {
            "id": 114,
            "group_id": 31,
            "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
            "translation": "बुरा सपना देखने पर:(1) अपनी बाईं ओर तीन बार फूंक मारे।(2) अल्लाह से शैतान और देखे गए बुरे सपने की बुराई से तीन बार पनाह मांगे।(3) इस सपने को किसी से भी बयान न करें।(4) और जिस करवट सो रहे थे, उसे बदल लें।",
            "reference": "Al-Bukhârî [7044] and Muslim [2261](4/1772)."
          },
          {
            "id": 115,
            "group_id": 31,
            "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
            "translation": "अगर चाहें तो उठकर नमाज़ पढ़ लें।",
            "reference": "Muslim [2263](4/1773)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 2,
    "title": "प्रार्थना",
    "group": [
      {
        "group_id": 8,
        "title": "वज़ू शुरू करते समय",
        "duas": [
          {
            "id": 12,
            "group_id": 8,
            "dua": "بِسْمِ اللهِ",
            "translation": "अल्लाह के नाम से।",
            "reference": "Abû Dâwud [101], Ibn Mâjah [399] and Aĥmad (2/418). Also see Irwâ'-ul-Ghalîl (1/122)."
          }
        ]
      },
      {
        "group_id": 9,
        "title": "वज़ू पूरा होने पर",
        "duas": [
          {
            "id": 13,
            "group_id": 9,
            "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
            "translation": "मैं गवाही देता हूँ कि अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, वह अकेला है, उसका कोई साथी नहीं है, और मैं गवाही देता हूँ कि मुहम्मद उसके बंदे और रसूल हैं।",
            "reference": "Muslim [234](1/209)."
          },
          {
            "id": 14,
            "group_id": 9,
            "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
            "translation": "हे अल्लाह, मुझे उन लोगों में शामिल कर जो बार-बार तौबा करते हैं और मुझे उन लोगों में से बना जो पाक-साफ़ रहते हैं।",
            "reference": "At-Tirmidhî [55](1/78). Also see Ŝaĥiĥ At-Tirmidhî (1/18)."
          },
          {
            "id": 15,
            "group_id": 9,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
            "translation": "हे अल्लाह, तू पाक है और मैं तेरी हम्द करता हूँ, मैं गवाही देता हूँ कि तेरे सिवा कोई इबादत के लायक़ नहीं, मैं तुझसे माफ़ी माँगता हूँ और तेरी तरफ़ तौबा करता हूँ।",
            "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)."
          }
        ]
      },
      {
        "group_id": 12,
        "title": "मस्जिद जाते समय",
        "duas": [
          {
            "id": 19,
            "group_id": 12,
            "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
            "translation": "हे अल्लाह, मेरे दिल में नूर पैदा कर, मेरी ज़बान पर नूर पैदा कर, मेरी सुनने की ताक़त में नूर पैदा कर, मेरी देखने की ताक़त में नूर पैदा कर, मेरे ऊपर नूर पैदा कर, मेरे नीचे नूर पैदा कर, मेरे दाहिने नूर पैदा कर, मेरे बाएँ नूर पैदा कर, मेरे आगे नूर पैदा कर, मेरे पीछे नूर पैदा कर, मेरी आत्मा में नूर पैदा कर, मेरे लिए नूर को बड़ा कर, मेरे लिए नूर को व्यापक कर, मेरे लिए नूर बना और मुझे नूर बना। हे अल्लाह, मुझे नूर प्रदान कर, मेरी नसों में नूर पैदा कर, मेरे गोश्त में नूर पैदा कर, मेरे खून में नूर पैदा कर, मेरे बालों में नूर पैदा कर और मेरी त्वचा में नूर पैदा कर। [हे अल्लाह, मेरी क़ब्र में नूर बना और मेरी हड्डियों में नूर बना]। [मुझे नूर बढ़ा, मुझे नूर बढ़ा, मुझे नूर बढ़ा]।",
            "reference": "(1) Al-Bukhârî [6316](11/116) and Muslim [763](1/526,529,530).(2) At-Tirmidhî [3419](5/483)."
          }
        ]
      },
      {
        "group_id": 13,
        "title": "मस्जिद में प्रवेश करते समय",
        "duas": [
          {
            "id": 20,
            "group_id": 13,
            "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
            "translation": "(अपने दाहिने पैर से प्रवेश करें)(١) और फिर कहें: (मैं अल्लाह, जो महान है, उसके साथ और उसके माननीय चेहरे और उसके पुराने अधिकार के साथ शैतान से शरण मांगता हूँ।)(٢) (अल्लाह के नाम से, और दुआओं के साथ)(٣) [और रसूल अल्लाह पर सलाम](٤), (हे अल्लाह, मेरे लिए अपनी रहमत के दरवाजे खोल दें)(٥)।",
            "reference": "(1) Al-Hakim (1/218) and he authenticated it with the conditions of Muslim and Adh-Dhahabî agreed with him, Al-Baihaqî (2/442), and Al-Albânî  declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624).(2) Abû Dâwud [466]. Also see Ŝaĥîĥ Al-Jâmi' [4591].(3) An-Nisâ'i [88] and Al-Albânî declared it ĥasan.(4) Abû Dâwud [465](1/126). Also see Ŝaĥîĥ Al-Jâmi' [514](1/528).(5) Muslim [713](1/494), Ibn Mâjah [771] and Al-Albânî declared it ŝaĥîĥ due to its shawâhid; see Ŝaĥîĥ Ibn Mâjah (1/128-129)."
          }
        ]
      },
      {
        "group_id": 14,
        "title": "मस्जिद से निकलते समय",
        "duas": [
          {
            "id": 21,
            "group_id": 14,
            "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢) ",
            "translation": "(अपने बाएँ पैर से बाहर निकलें)(١) और फिर कहें: (अल्लाह के नाम से, और दुआएं और सलाम रसूल अल्लाह पर हो। हे अल्लाह, मैं तुझसे अपने फ़ज़्ल (अनुग्रह) की मांग करता हूँ। हे अल्लाह, मुझे शैतान से सुरक्षित रख।)(٢)।",
            "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) and Al-Albânî declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624)(2) See takhrîj of the previous hadith (du'a #20) and the extension( اللهم اعصمني من الشيطان الرجيم) is from Ibn Mâjah [773], see Ŝaĥîĥ Ibn Mâjah (1/129)."
          }
        ]
      },
      {
        "group_id": 15,
        "title": "अज़ान (नमाज़ की पुकार) के बारे में",
        "duas": [
          {
            "id": 22,
            "group_id": 15,
            "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
            "translation": "जो मुअज़्ज़िन कहता है, वही दोहराएँ, सिवाय जब वह कहे “नमाज़ की तरफ़ आओ” या “सफलता की तरफ़ आओ”, उस समय कहना चाहिए “अल्लाह के सिवा न कोई शक्ति है और न कोई ताकत।”",
            "reference": "Al-Bukhârî [611](1/152) and Muslim [383](1/288)."
          },
          {
            "id": 23,
            "group_id": 15,
            "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
            "translation": "मुअज़्ज़िन की शहादत (गवाही) के तुरंत बाद कहें:(1) ‘और मैं भी गवाही देता हूँ कि अल्लाह के सिवा कोई इबादत के लायक़ नहीं, अकेला है, उसका कोई साथी नहीं है, और मुहम्मद उसके बंदे और रसूल हैं। मैं अल्लाह को अपना रब मानकर संतुष्ट हूँ, मुहम्मद को अपना रसूल मानकर और इस्लाम को अपना धर्म मानकर संतुष्ट हूँ।’",
            "reference": "(1) Muslim [386](1/290).(2) Ibn Khuzaîymah [422](1/220)."
          },
          {
            "id": 24,
            "group_id": 15,
            "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
            "translation": "मुअज़्ज़िन की पुकार का जवाब देने के बाद, नबी (सल्लल्लाहु अलैहि व सल्लम) पर दुरूद भेजें।",
            "reference": "Muslim [384](1/288)."
          },
          {
            "id": 25,
            "group_id": 15,
            "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
            "translation": "कहें: ‘हे अल्लाह, इस पूरी पुकार के रब और खड़ी की जाने वाली नमाज़ के रब, मुहम्मद (सल्लल्लाहु अलैहि व सल्लम) को वसीला और फ़ज़ीलत प्रदान करें और उन्हें वह सराहा हुआ मकाम प्रदान करें, जिसका आपने उनसे वादा किया है। [वास्तव में, आप वादे को कभी पूरा नहीं करते।]’",
            "reference": "Al-Bukhârî [614](1/152) and what is between the brackets is from Al-Baihaqî (1/410). Shaykh Abdul 'Azîz bin Bâz authenticated the chain of the latter in Tuĥfah Al-Akhbâr (p. 38)."
          },
          {
            "id": 26,
            "group_id": 15,
            "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
            "translation": "अज़ान और इक़ामा के बीच अपने लिए दुआ करें क्योंकि इस समय की दुआ अस्वीकार नहीं की जाती।",
            "reference": "At-Tirmidhî [212], Abû Dâwud [521] and Ahmad [3/119]. Also see Irwâ'-ul-Ghalîl (1/262)."
          }
        ]
      },
      {
      "group_id": 16,
      "title": "नमाज़ शुरू करते समय (तकबीर के बाद)",
      "duas": [
          {
            "id": 27,
            "group_id": 16,
            "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
            "translation": "हे अल्लाह, मेरे और मेरे गुनाहों के बीच दूरी पैदा कर दे, जैसे कि तूने पूरब और पश्चिम के बीच दूरी बनाई है। हे अल्लाह, मुझे मेरे गुनाहों से इस तरह साफ़ कर दे, जैसे कि एक सफ़ेद कपड़ा गंदगी से साफ़ किया जाता है। हे अल्लाह, मुझे मेरे गुनाहों से बर्फ, पानी और ओलों से धो दे।",
            "reference": "Al-Bukhârî [744](1/181) and Muslim [598](1/419)."
          },
          {
            "id": 28,
            "group_id": 16,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
            "translation": "हे अल्लाह, तू पाक है और तेरी हम्द करता हूँ। तेरा नाम बर्कत वाला है, और तेरी शान महान है, और तेरे सिवा कोई इबादत के लायक़ नहीं।",
            "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), and Ibn Mâjah [804, 806]. Also see Ŝaĥîĥ At-Tirmidhî (1/77) and Ŝaĥîĥ Ibn Mâjah (1/135)."
          },
          {
            "id": 29,
            "group_id": 16,
            "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرْ الذُّنُوبَ إِلاَّ أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
            "translation": "मैंने अपने चेहरे को उसकी ओर मोड़ा, जिसने आसमानों और ज़मीन को पैदा किया है, और मैं एक सच्चे दिल से उसकी इबादत करता हूँ और मैं किसी को उसके साथ शरीक नहीं करता। निस्संदेह मेरी नमाज़, मेरी क़ुर्बानी, मेरा जीवन और मेरी मौत अल्लाह, रब्बुल आलमीन के लिए है। उसका कोई शरीक नहीं है, और मुझे इसी का हुक्म दिया गया है और मैं मुसलमानों में से हूँ। हे अल्लाह, तू ही बादशाह है, तेरे सिवा कोई इबादत के लायक़ नहीं है, तू ही मेरा रब है और मैं तेरा बंदा हूँ। मैंने अपने ऊपर ज़ुल्म किया है और मैं अपने गुनाहों को स्वीकार करता हूँ, इसलिए मेरे सारे गुनाहों को माफ़ कर दे, क्योंकि तेरे सिवा कोई भी गुनाहों को माफ़ नहीं कर सकता। मुझे अच्छे अख़लाक़ की तरफ़ हिदायत दे, क्योंकि तेरे सिवा कोई भी अच्छे अख़लाक़ की तरफ़ हिदायत नहीं दे सकता और मुझे बुरे अख़लाक़ से बचा, क्योंकि तेरे सिवा कोई भी मुझे बुरे अख़लाक़ से नहीं बचा सकता। मैं तेरी आज्ञा का पालन करता हूँ और तेरी मदद चाहता हूँ। सारा भला तेरे हाथों में है और बुराई तेरे पास से नहीं आती। मैं तेरे ज़रिए जी रहा हूँ और तेरी ओर लौटूंगा। तू पाक और महान है, मैं तुझसे माफ़ी माँगता हूँ और तेरी ओर तौबा करता हूँ।",
            "reference": "Muslim [771](1/534)."
          },
          {
            "id": 30,
            "group_id": 16,
            "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
            "translation": "हे अल्लाह, जिब्राईल, मीकाईल और इसराफ़ील (महान फ़रिश्तों) के रब, आसमानों और ज़मीन के पैदा करने वाले, ग़ैब और ज़ाहिर के जानने वाले, तू अपने बंदों के बीच उन मामलों में फ़ैसला करता है जिनमें वे मतभेद करते हैं। मुझे अपने हुक्म से उन बातों की हिदायत दे, जिनमें वे मतभेद करते हैं। निस्संदेह, तू जिसे चाहता है, सीधे रास्ते की हिदायत देता है।",
            "reference": "Muslim [770](1/534)."
          },
          {
            "id": 31,
            "group_id": 16,
            "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
            "translation": "अल्लाह सबसे बड़ा है, अल्लाह सबसे बड़ा है, अल्लाह सबसे बड़ा है, बहुत सारा हम्द (प्रशंसा) अल्लाह के लिए है, बहुत सारा हम्द अल्लाह के लिए है, बहुत सारा हम्द अल्लाह के लिए है, और मैं अल्लाह की सुबह और शाम तसबीह करता हूँ। (तीन बार) मैं अल्लाह की शरण में आता हूँ शैतान से: उसकी घमंड, उसकी फुसफुसाहट और उसकी पागलपन से।",
            "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), and Muslim [601](1/420) with extension from: (مِنْ نَفْحِهِ )."
          },
          {
            "id": 32,
            "group_id": 16,
            "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ، وَ لِقَاؤُكَ الحَقُّ، وَ الجَنَّةُ حَقٌّ، وَ النَّارُ حَقٌّ، وَ النَّبِيُّونَ حَقٌّ، وَ مُحَمَّدٌﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ][اللهم لَكَ أسْلَمْتُ، وَ عَلَيْكَ تَوَكَّلْتُ، وَ بِكَ آمَنْتُ، وَ إلَيْكَ أنَبْتُ، وَ بِكَ خَاصَمْتُ، وَ إلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، و أخَّرْتُ، وَ مَا أسْرَرْتُ، وَ مَا أعْلَنْتُ][أنْتَ المُقَدِّمُ، وَ أنْتَ المُؤَخِّرُ لَا إله إلَّا أنْتَ][أنْتَ إلَهِي لَا إله إلَّا أنْتَ].",
            "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) कहते थे (नमाज़ में तशाहुद के बाद की दुआ में):‘हे अल्लाह, तेरी सारी तारीफें हैं, तू ही आसमानों और ज़मीन का नूर है और जो कुछ उसमें है। तेरी सारी तारीफें हैं, तू ही आसमानों और ज़मीन का पालनहार है और जो कुछ उसमें है। तेरी सारी तारीफें हैं, तू ही सत्य है, तेरा वादा सत्य है, तेरा वचन सत्य है, और वह दिन सत्य है जब हम तुझसे मिलेंगे। जन्नत सत्य है, जहन्नम सत्य है, नबी सत्य हैं, मुहम्मद (सल्लल्लाहु अलैहि व सल्लम) सत्य हैं और क़यामत की घड़ी सत्य है। हे अल्लाह, मैंने तेरे प्रति समर्पण किया, तुझ पर भरोसा किया, तुझ पर विश्वास किया और तेरी ओर लौट आया, तेरे लिए विवाद किया और तेरी ओर अपना मामला सौंपा। इसलिए मुझे मेरे पहले किए हुए और बाद में होने वाले सभी गुनाहों को माफ़ कर दे, जो मैंने छुपाए और जो मैंने जाहिर किए। तू ही आगे बढ़ाने वाला और पीछे करने वाला है। तेरे सिवा कोई इबादत के लायक़ नहीं। तू ही मेरा उपासक है, तेरे सिवा कोई इबादत के लायक़ नहीं।",
            "reference": "Al-Bukhârî (3/3), (11/116), and [1120](13/371, 423, 465) and Muslim [769](1/532) in a summarised form."
          }
        ]
      },
      {
        "group_id": 17,
        "title": "रूकू के दौरान",
        "duas": [
          {
            "id": 33,
            "group_id": 17,
            "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
            "translation": "मेरा रब सबसे महान है (तीन बार)।",
            "reference": "Abû Dâwud [871],  At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
          },
          {
            "id": 34,
            "group_id": 17,
            "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
            "translation": "हे अल्लाह, तू पाक है और तेरी हम्द करता हूँ, हे अल्लाह, मुझे माफ़ कर दे।",
            "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
          },
          {
            "id": 35,
            "group_id": 17,
            "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
            "translation": "वह पाक और पवित्र है, फ़रिश्तों और रूह का रब है।",
            "reference": "Muslim [487](1/353) and Abû Dâwud [872](1/230)."
          },
          {
            "id": 36,
            "group_id": 17,
            "dua": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
            "translation": "हे अल्लाह, मैंने तुझे रूकू किया, और तुझ पर ईमान लाया, और तुझे समर्पित किया। मेरे कान, मेरी आँखें, मेरा दिमाग, मेरी हड्डियाँ और मेरी नसें तेरे सामने झुकी हैं।",
            "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] and An-Nisâ'i [2/130]. The extension is found in Ibn Ĥibân, see Ŝaĥîĥ Ibn Ĥibân [1901] and Ŝaĥîĥ Ibn Khuzaîmah [607]."
          },
          {
            "id": 37,
            "group_id": 17,
            "dua": "سُبْحَانَ ذِي الْجَبَروتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
            "translation": "वह पाक है, जो ताक़त और मालिकियत, बड़ाई और महानता का मालिक है।",
            "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) and Aĥmad (6/24)."
          }
        ]
      },
      {
        "group_id": 18,
        "title": "रूकू से उठने के बाद",
        "duas": [
            {
                "id": 38,
                "group_id": 18,
                "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
                "translation": "अल्लाह उसकी सुनता है जो उसकी हम्द (प्रशंसा) करता है।",
                "reference": "Al-Bukhârî [795](2/282)."
            },
            {
                "id": 39,
                "group_id": 18,
                "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
                "translation": "हमारे रब, तेरी सारी तारीफ़ें हैं, बहुतायत, पवित्र और बरकत वाली तारीफ़ें।",
                "reference": "Al-Bukhârî [799](2/284)."
            },
            {
                "id": 40,
                "group_id": 18,
                "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
                "translation": "आसमानों और ज़मीन की पूरी तारीफ़ें और जो कुछ उनके बीच में है, और उन सभी चीज़ों की तारीफ़ें जिन्हें तू चाहता है। हे तारीफ़ और महानता के मालिक, सबसे सच्ची बात जो बंदा कह सकता है और हम सब तेरे बंदे हैं। हे अल्लाह, जिसे तूने दिया, उसे कोई रोकने वाला नहीं और जिसे तूने रोका, उसे कोई देने वाला नहीं और न तेरी शक्ति और महानता किसी को फ़ायदा पहुँचाती है।",
                "reference": "Muslim [477](1/346)."
            }
        ]
    },
      {
          "group_id": 19,
          "title": "सज्दा करते समय",
          "duas": [
              {
                  "id": 41,
                  "group_id": 19,
                  "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
                  "translation": "मेरा रब सबसे महान है (तीन बार)।",
                  "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
              },
              {
                  "id": 42,
                  "group_id": 19,
                  "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
                  "translation": "हे अल्लाह, तू पाक है और तेरी हम्द करता हूँ, हे अल्लाह, मुझे माफ़ कर दे।",
                  "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
              },
              {
                  "id": 43,
                  "group_id": 19,
                  "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ",
                  "translation": "वह पाक और पवित्र है, फ़रिश्तों और रूह का रब है।",
                  "reference": "Muslim (1/533)."
              },
              {
                  "id": 44,
                  "group_id": 19,
                  "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
                  "translation": "हे अल्लाह, मैंने तुझे सज्दा किया, तुझ पर ईमान लाया, और तुझे समर्पित किया। मेरा चेहरा उसके सामने सज्दे में गिरा, जिसने इसे बनाया, और इसे शक्ल दी और इसके कान और आँखें बनाईं। अल्लाह सबसे बेहतरीन बनाने वाला है।",
                  "reference": "Muslim [771](1/534)."
              },
              {
                  "id": 45,
                  "group_id": 19,
                  "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ",
                  "translation": "वह पाक है, जो ताक़त, मालिकियत, बड़ाई और महानता का मालिक है।",
                  "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), and An-Nisâ'i (2/191). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/166)."
              },
              {
                  "id": 46,
                  "group_id": 19,
                  "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
                  "translation": "हे अल्लाह, मेरे सारे गुनाहों को माफ़ कर दे, चाहे वह छोटे हों या बड़े, पहले किए गए हों या बाद में किए गए हों, जाहिर हों या छुपे हुए हों।",
                  "reference": "Muslim [483](1/350)."
              },
              {
                  "id": 47,
                  "group_id": 19,
                  "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                  "translation": "हे अल्लाह, मैं तेरे ग़ुस्से से तेरी रज़ामंदी की पनाह मांगता हूँ और तेरी सज़ा से तेरी माफ़ी की पनाह मांगता हूँ। मैं तुझसे ही तुझसे पनाह मांगता हूँ। मैं तेरी तारीफ़ करने में असमर्थ हूँ, तू वैसा ही है जैसा तूने अपनी तारीफ़ की है।",
                  "reference": "Muslim [486](1/352)."
              }
          ]
      },
      {
          "group_id": 20,
          "title": "दो सज्दों के बीच",
          "duas": [
              {
                  "id": 48,
                  "group_id": 20,
                  "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
                  "translation": "मेरे रब, मुझे माफ़ कर दे, मेरे रब, मुझे माफ़ कर दे।",
                  "reference": "Abû Dâwud [874](1/231). Also see Ŝaĥîĥ Ibn Mâjah (1/148)."
              },
              {
                  "id": 49,
                  "group_id": 20,
                  "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
                  "translation": "हे अल्लाह, मुझे माफ़ कर, मुझ पर रहम कर, मुझे हिदायत दे, मुझे मजबूत कर, मुझे स्वास्थ्य दे, मुझे रोज़ी दे और मुझे ऊँचा कर।",
                  "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]. Also see Ŝaĥîĥ At-Tirmidhî (1/90) and Ŝaĥîĥ Ibn Mâjah (1/148)."
              }
          ]
      },
      {
          "group_id": 21,
          "title": "क़ुरआन की तिलावत के दौरान सज्दा करते समय",
          "duas": [
              {
                  "id": 50,
                  "group_id": 21,
                  "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
                  "translation": "मेरा चेहरा उसके सामने सज्दे में गिरा, जिसने इसे बनाया और इसके कान और आँखों को अपनी ताक़त और कुदरत से पैदा किया। (अल्लाह सबसे बेहतरीन बनाने वाला है।)",
                  "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) and Al-Hâkim declared it authentic and Ad-Dhahabî agreed with him (1/220). The extension is from Ŝûrah Al-Mu'minûn."
              },
              {
                  "id": 51,
                  "group_id": 21,
                  "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
                  "translation": "हे अल्लाह, मेरे लिए इस सज्दे के बदले में तुझसे सवाब लिख दे, इसके बदले में मुझसे गुनाहों का बोझ हल्का कर दे, और इसे मेरे लिए जमा कर दे और इसे मुझसे वैसे ही स्वीकार कर, जैसे तूने अपने बंदे दाऊद से स्वीकार किया था।",
                  "reference": "At-Tirmidhî [579](2/473) and Al-Hâkim declared it Ŝaĥîĥ and Ad-Dhahabî agreed with him (1/219)."
              }
          ]
      },
      {
        "group_id": 22,
        "title": "तशह्हुद",
        "duas": [
            {
                "id": 52,
                "group_id": 22,
                "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
                "translation": "तमाम इबादतें और अच्छाइयाँ अल्लाह के लिए हैं। ऐ नबी, आप पर सलाम हो, अल्लाह की रहमत और बरकत हो। हम पर और अल्लाह के नेक बंदों पर सलाम हो। मैं गवाही देता हूँ कि अल्लाह के सिवा कोई इबादत के लायक़ नहीं है और मैं गवाही देता हूँ कि मुहम्मद उसके बंदे और रसूल हैं।",
                "reference": "Al-Bukhârî [831](2/311) and Muslim [402](1/301)."
            }
        ]
    },
      {
          "group_id": 23,
          "title": "तशह्हुद के बाद नबी (सल्लल्लाहु अलैहि वसल्लम) पर दुरूद भेजना",
          "duas": [
              {
                  "id": 53,
                  "group_id": 23,
                  "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                  "translation": "हे अल्लाह, मुहम्मद और उनकी औलाद पर रहमत भेज, जैसे तूने इब्राहीम और उनकी औलाद पर रहमत भेजी। निस्संदेह, तू तारीफ और महिमा वाला है। हे अल्लाह, मुहम्मद और उनकी औलाद पर बरकत भेज, जैसे तूने इब्राहीम और उनकी औलाद पर बरकत भेजी। निस्संदेह, तू तारीफ और महिमा वाला है।",
                  "reference": "Al-Bukhârî [337](6/408)."
              },
              {
                  "id": 54,
                  "group_id": 23,
                  "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                  "translation": "हे अल्लाह, मुहम्मद और उनकी पत्नियों और संतानों पर रहमत भेज, जैसे तूने इब्राहीम की औलाद पर रहमत भेजी। और मुहम्मद, उनकी पत्नियों और संतानों पर बरकत भेज, जैसे तूने इब्राहीम की औलाद पर बरकत भेजी। निस्संदेह, तू तारीफ और महिमा वाला है।",
                  "reference": "Al-Bukhârî [3369](2/407) and Muslim [407](1/306)."
              }
          ]
      },
      {
          "group_id": 24,
          "title": "अख़िरी तशह्हुद के बाद और सलाम से पहले",
          "duas": [
              {
                  "id": 55,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
                  "translation": "हे अल्लाह, मैं तुझसे क़ब्र के अज़ाब से पनाह मांगता हूँ, जहन्नम के अज़ाब से, ज़िन्दगी और मौत के फ़ितने से और मसीह अद-दज्जाल के फ़ितने के बुराई से।",
                  "reference": "Al-Bukhârî 2/102 and Muslim 1/412."
              },
              {
                  "id": 56,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
                  "translation": "हे अल्लाह, मैं तुझसे क़ब्र के अज़ाब से पनाह मांगता हूँ, और मैं मसीह अद-दज्जाल के फ़ितने से पनाह मांगता हूँ, और ज़िन्दगी और मौत के फ़ितने से पनाह मांगता हूँ। हे अल्लाह, मैं तुझसे पाप और कर्ज़ से पनाह मांगता हूँ।",
                  "reference": "Al-Bukhârî [832](2/102) and Muslim [589](1/412) and the wording is the latter's."
              },
              {
                  "id": 57,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                  "translation": "हे अल्लाह, मैंने अपनी जान पर बहुत ज़ुल्म किया है और तेरे सिवा कोई गुनाहों को माफ़ नहीं कर सकता, इसलिए मुझे अपनी तरफ़ से माफ़ी दे और मुझ पर रहम कर। बेशक, तू सबसे ज़्यादा माफ़ करने वाला और रहम करने वाला है।",
                  "reference": "Al-Bukhârî [7387](8/168) and Muslim [2705](4/2078)."
              },
              {
                  "id": 58,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
                  "translation": "हे अल्लाह, मेरे उन गुनाहों को माफ़ कर दे जो पहले हो चुके हैं और जो बाद में होंगे, जो मैंने छुपाकर किए हैं और जो मैंने खुलकर किए हैं, और जहां मैंने हद पार की और जिनका तू मुझसे ज़्यादा जानता है। तू ही आगे करने वाला और पीछे करने वाला है। तेरे सिवा कोई इबादत के लायक़ नहीं।",
                  "reference": "Muslim [771](1/534)."
              },
              {
                  "id": 59,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
                  "translation": "हे अल्लाह, मुझे अपनी याद, अपना शुक्रिया अदा करने और बेहतरीन तरीके से तेरी इबादत करने में मदद कर।",
                  "reference": "Abû Dâwud [1522](2/86) and An-Nisâ'i (3/53). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/284)."
              },
              {
                  "id": 60,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
                  "translation": "हे अल्लाह, मैं तुझसे बुख्ल (कंजूसी) से पनाह मांगता हूँ, और मैं तुझसे कायरता से पनाह मांगता हूँ, और मैं तुझसे इस बात से पनाह मांगता हूँ कि मैं ज़िंदगी के सबसे बुरे दौर में लौटाया जाऊँ। और मैं तुझसे दुनिया के फ़ितने और क़ब्र के अज़ाब से पनाह मांगता हूँ।",
                  "reference": "Al-Bukhârî [2822](6/35)."
              },
              {
                  "id": 61,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
                  "translation": "हे अल्लाह, मैं तुझसे जन्नत की मांग करता हूँ और जहन्नम से पनाह मांगता हूँ।",
                  "reference": "Abû Dâwud [792] and Ibn Mâjah, see Ŝaĥîĥ Ibn Mâjah (2/328)."
              },
              {
                  "id": 62,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
                  "translation": "हे अल्लाह, तेरे ग़ैब के ज्ञान और सृष्टि पर तेरी शक्ति के ज़रिए, मुझे तब तक ज़िंदा रख जब तक तू जानता है कि ज़िन्दगी मेरे लिए बेहतर है, और मुझे मौत दे जब तू जानता है कि मौत मेरे लिए बेहतर है। हे अल्लाह, मैं तुझसे तेरे डर की मांग करता हूँ, चाहे मैं ग़ायब रहूँ या हाज़िर। और मैं तुझसे सच्चाई की बात मांगता हूँ, चाहे मैं ख़ुश रहूँ या ग़ुस्से में। और मैं तुझसे संपन्नता और दरिद्रता में संतुलन की मांग करता हूँ। और मैं तुझसे वह आशीर्वाद मांगता हूँ जो कभी खत्म न हो। और मैं तुझसे वह सुखी दृष्टि की मांग करता हूँ जो कभी समाप्त न हो। और मैं तुझसे क़ज़ा के बाद रज़ामंदी की मांग करता हूँ। और मैं तुझसे मौत के बाद की सुकून भरी ज़िन्दगी की मांग करता हूँ। और मैं तुझसे अपने चेहरे की देखने की मिठास और तुझसे मिलने की चाहत की मांग करता हूँ, ऐसी स्थिति में कि न कोई नुक़सान पहुँचाने वाली मुश्किल हो और न कोई बहकाने वाला फ़ितना हो। हे अल्लाह, हमें ईमान की सजावट से सजा और हमें मार्गदर्शन देने वाले बनाना।",
                  "reference": "An-Nisâ'i (4/54, 55) and Aĥmad (4/364). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/281)."
              },
              {
                  "id": 63,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                  "translation": "हे अल्लाह, मैं तुझसे सवाल करता हूँ, ऐ अल्लाह, क्योंकि तू ही अकेला, आत्मनिर्भर और सर्वसमर्थ है, जिसने न किसी को जना और न किसी से जना गया, और जिसका कोई समकक्ष नहीं है, कि तू मेरे गुनाहों को माफ़ कर दे। निस्संदेह, तू सबसे माफ़ करने वाला और रहम करने वाला है।",
                  "reference": "An-Nisâ'i (3/52) and Aĥmad (4/238). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/280)."
              },
              {
                  "id": 64,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
                  "translation": "हे अल्लाह, मैं तुझसे सवाल करता हूँ क्योंकि सारी तारीफें तेरे लिए हैं, तेरे सिवा कोई इबादत के लायक़ नहीं है, तू अकेला है, तेरा कोई शरीक नहीं है, तू सबसे अनुग्रहशील है। ऐ आसमानों और ज़मीन के रचयिता, ऐ जلال और इकराम वाले, ऐ हय्य (सर्वजीवी), ऐ कय्यूम (सर्वसमर्थ), मैं तुझसे जन्नत की मांग करता हूँ और जहन्नम से पनाह मांगता हूँ।",
                  "reference": "Abû Dâwud [1495], An-Nisâ'i (3/52), Ibn Mâjah [3858] and At-Tirmidhî [3544]. Also see Ŝaĥîĥ Ibn Mâjah (2/329)."
              },
              {
                  "id": 65,
                  "group_id": 24,
                  "dua": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
                  "translation": "हे अल्लाह, मैं तुझसे सवाल करता हूँ, क्योंकि मैं गवाही देता हूँ कि तू ही अल्लाह है, तेरे सिवा कोई इबादत के लायक़ नहीं है। तू अकेला और आत्मनिर्भर है, जिसने न किसी को जना और न किसी से जना गया और जिसका कोई समकक्ष नहीं है।",
                  "reference": "Abû Dâwud [1493](2/62), At-Tirmidhî [3475](5/515), Ibn Mâjah [3857](2/1267) and Aĥmad (5/360). Also see Ŝaĥîĥ Ibn Mâjah (2/329) and Ŝaĥîĥ At-Tirmidhî (3/163)."
              }
          ]
      },
      {
        "group_id": 25,
        "title": "सलाम के बाद",
        "duas": [
            {
                "id": 66,
                "group_id": 25,
                "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
                "translation": "(1) मैं अल्लाह से माफ़ी मांगता हूँ (तीन बार)(2) हे अल्लाह, तू सलाम (शांति) है और तुझसे ही शांति आती है, तू बरकत वाला है, ऐ जلال और इकराम वाले।",
                "reference": "Muslim [591](1/414)."
            },
            {
                "id": 67,
                "group_id": 25,
                "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
                "translation": "अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, वह अकेला है, उसका कोई साझी नहीं है, उसी के लिए बादशाहत है और सारी तारीफ़ें उसी के लिए हैं, और वह हर चीज़ पर क़ादिर है (तीन बार)। हे अल्लाह, जिसे तूने दिया उसे कोई रोक नहीं सकता और जिसे तूने रोका उसे कोई दे नहीं सकता, और तेरे पास से कोई ताक़त या दौलत फ़ायदा नहीं देती।",
                "reference": "Al-Bukhârî [844](1/255) and Muslim [593](1/414)."
            },
            {
                "id": 68,
                "group_id": 25,
                "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
                "translation": "अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, वह अकेला है, उसका कोई साझी नहीं है, उसी के लिए बादशाहत है और सारी तारीफ़ें उसी के लिए हैं, और वह हर चीज़ पर क़ादिर है। अल्लाह के सिवा कोई ताक़त या शक्ति नहीं है। अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, और हम सिर्फ़ उसी की इबादत करते हैं। उसी के लिए नेमतें हैं, उसी के लिए अनुग्रह है, और उसी के लिए बेहतरीन प्रशंसा है। अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, और हम उसे सच्ची इबादत के साथ मानते हैं, चाहे काफ़िर नापसंद करें।",
                "reference": "Muslim [594](1/415)."
            },
            {
                "id": 69,
                "group_id": 25,
                "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                "translation": "(1) अल्लाह पाक है, अल्लाह की तारीफ है, और अल्लाह सबसे बड़ा है (तीस-तीस बार)(2) अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, वह अकेला है, उसका कोई साझी नहीं है, उसी के लिए बादशाहत है और सारी तारीफ़ें उसी के लिए हैं, और वह हर चीज़ पर क़ादिर है।",
                "reference": "Muslim [597](1/418)."
            },
            {
                "id": 70,
                "group_id": 25,
                "dua": "(١) (قُلْ هُوَ اللَّهُ أَحَدٌ...)(٢) (قٌلْ أَعُوْذُ بِرَبَّ الْفَلَقِ...)(٣) (قُلْ أَعُوْذُ بِرَبَّ النَّاسِ...)",
                "translation": "फज्र और मगरिब के बाद तीन बार और बाकी नमाज़ों के बाद एक बार इन तीन सूरतों की तिलावत करें:(1) सूरत अल-इख़लास(2) सूरत अल-फ़लाक़(3) सूरत अल-नास",
                "reference": "Abû Dâwud [1523](2/86) and An-Nisâ'i (3/68). Also see Ŝaĥîĥ At-Tirmidhî (2/8)."
            },
            {
                "id": 71,
                "group_id": 25,
                "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
                "translation": "यह भी सुन्नत है कि हर नमाज़ के बाद आयत अल-कुर्सी की तिलावत की जाए:[सूरत अल-बक़रा: 255]",
                "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) and Ibn Sinnî [121]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [6464](5/339) and Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [972](2/697)."
            },
            {
                "id": 72,
                "group_id": 25,
                "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
                "translation": "अल्लाह के सिवा कोई इबादत के लायक़ नहीं है, वह अकेला है, उसका कोई साझी नहीं है, उसी के लिए बादशाहत है और सारी तारीफ़ें उसी के लिए हैं, वही ज़िन्दगी और मौत देता है और वह हर चीज़ पर क़ादिर है। (मगरिब और फज्र की नमाज़ के बाद दस बार)",
                "reference": "At-Tirmidhî [3474](5/515) and Aĥmad (4/227). Also see Zâd Al-Ma'âd (1/300)."
            },
            {
                "id": 73,
                "group_id": 25,
                "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
                "translation": "हे अल्लाह, मैं तुझसे फ़ायदेमंद इल्म, पाक रोज़ी और क़ुबूल की हुई अमल की मांग करता हूँ (फज्र की नमाज़ के सलाम के बाद)।",
                "reference": "Ibn Mâjah [925]. Also see Ŝaĥîĥ Ibn Mâjah (1/152) and Majmu' Az-Zawâ'id [95](10/111)."
            }
        ]
    },
      {
          "group_id": 32,
          "title": "कुनूत अल-वित्र",
          "duas": [
              {
                  "id": 116,
                  "group_id": 32,
                  "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
                  "translation": "हे अल्लाह, मुझे उन लोगों में से बना जिनको तूने हिदायत दी, मुझे उन लोगों में से बना जिनको तूने अफ़ियत दी, मुझे अपना बना जिनके लिए तूने साथ दिया, और मुझे उन चीज़ों में बरकत दे जो तूने मुझे दीं। और मुझे बुराई से बचा जिसे तूने मुकर्रर किया है, क्योंकि तू ही फ़ैसला करता है और तुझ पर कोई फ़ैसला नहीं किया जा सकता। जिसको तूने अपना बना लिया उसे कोई ज़लील नहीं कर सकता और जिसे तूने दुश्मनी दी उसे कोई इज़्ज़त नहीं दे सकता। तू बरकत वाला है और बहुत ऊँचा है।",
                  "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). What is between the brackets is from Al-Baihaqî. Also see Ŝaĥîĥ At-Tirmidhî (1/144), Ŝaĥîĥ Ibn Mâjah (1/194), and Irwâ'-ul-Ghalîl (2/172)."
              },
              {
                  "id": 117,
                  "group_id": 32,
                  "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                  "translation": "हे अल्लाह, मैं तेरे ग़ुस्से से तेरी रज़ामंदी की पनाह मांगता हूँ, और तेरी सज़ा से तेरी माफ़ी की पनाह मांगता हूँ। और मैं तुझसे ही तुझसे पनाह मांगता हूँ। मैं तेरी तारीफ़ करने में असमर्थ हूँ, तू वैसा ही है जैसा तूने अपनी तारीफ़ की है।",
                  "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], and Aĥmad (1/96,118,150). Also see Ŝaĥîĥ At-Tirmidhî (3/180), Ŝaĥîĥ Ibn Mâjah (1/194) and Irwâ'-ul-Ghalîl (2/175)."
              },
              {
                  "id": 118,
                  "group_id": 32,
                  "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
                  "translation": "हे अल्लाह, तुझी की हम इबादत करते हैं, तुझी के लिए हम नमाज़ पढ़ते और सज्दा करते हैं, और तेरी ही तरफ़ दौड़ते हैं और सेवा करते हैं। हम तेरी रहमत की उम्मीद करते हैं और तेरे अज़ाब से डरते हैं। तेरा अज़ाब काफिरों को ज़रूर आ घेरेगा। हे अल्लाह, हम तुझसे मदद मांगते हैं, तुझसे माफ़ी मांगते हैं, और तेरी तारीफ में अच्छाई बयान करते हैं, और तुझसे कुपित नहीं होते। हम तुझ पर ईमान लाते हैं, तेरे आगे सर झुकाते हैं, और उसे छोड़ते हैं जो तुझसे इनकार करता है।",
                  "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) and he declared its chain Ŝaĥîĥ. Al-Albânî said in [Irwâ'-ul-Ghalîl](2/170) that its chain is Ŝaĥîĥ and that the narration is mawqûf through 'Umar (RadiAllah ʻanhu)."
              }
          ]
      },
      {
          "group_id": 33,
          "title": "वित्र की नमाज़ के सलाम के बाद",
          "duas": [
              {
                  "id": 119,
                  "group_id": 33,
                  "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
                  "translation": "मलकुल कुद्दूस (पाक बादशाह) की तस्बीह (तीन बार), और तीसरी बार ऊँची आवाज़ में कहते हुए: [फ़रिश्तों और रूह के रब]।",
                  "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) and the extension in brackets is from him and its chain is Ŝaĥîĥ. Also see the research of Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť on Zâd al-Ma'âd (1/337)."
              }
          ]
      },
      {
        "group_id": 42,
        "title": "नमाज़ या क़ुरआन की तिलावत के दौरान वस्वसे (विचलन) से ग्रस्त होने पर",
        "duas": [
            {
                "id": 138,
                "group_id": 42,
                "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
                "translation": "मैं अल्लाह की पनाह मांगता हूँ शैतान से, जो धिक्कारा गया है। और अपनी बाईं तरफ़ तीन बार थूक दो (बिना लार के)।",
                "reference": "Muslim [2203](4/1729)."
            }
        ]
    }
    ]
  },
  {
  "category_id": 3,
  "title": "अल्लाह की प्रशंसा करना",
  "group": [
    {
      "group_id": 26,
      "title": "निर्णय लेने या सही रास्ता चुनने के लिए मार्गदर्शन की तलाश में",
      "duas": [
        {
          "id": 74,
          "group_id": 26,
          "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
          "translation": "जाबिर इब्न 'अब्दुल्लाह (रजियल्लाहु अन्हु) से रिवायत है, उन्होंने कहा: 'नबी (सल्लल्लाहु अलैहि व सल्लम) हमें हमारे सभी मामलों में मार्गदर्शन के लिए दुआ पढ़ने का हुक्म देते थे, जैसे कि वह हमें कुरान का एक अध्याय सिखाते थे। वह (सल्लल्लाहु अलैहि व सल्लम) कहते थे: 'अगर आप में से कोई किसी मामले को करना चाहता है, तो वह दो रकअत नफ्ल नमाज़ पढ़े और फिर यह दुआ करे:'हे अल्लाह, मैं तुझसे तेरे ज्ञान के द्वारा सलाह मांगता हूं और तेरी शक्ति के द्वारा ताकत मांगता हूं और तुझसे तेरे महान फज़ल से दुआ करता हूं, क्योंकि वास्तव में तू सक्षम है और मैं नहीं, और वास्तव में तू जानता है और मैं नहीं, और तू ग़ैब का जानकार है। हे अल्लाह, अगर तू जानता है कि यह मामला - और यहां वह अपनी ज़रूरत का ज़िक्र करता है - मेरे लिए मेरे दीन, मेरी जिंदगी और मेरे अंत के लिए अच्छा है, तो इसे मेरे लिए लिख दे और इसे मेरे लिए आसान कर दे, फिर इसमें मेरे लिए बरकत दे, और अगर तू जानता है कि यह मामला मेरे लिए बुरा है, तो इसे मुझसे हटा दे और मुझे इससे दूर कर दे, और जहां भी भलाई हो, उसे मेरे लिए निर्धारित कर और फिर मुझे उसमें संतोष दे।'",
          "reference": "(1) Al-Bukhârî [1162](7/162).(2) Qur'an Al-'Imran [3:159]."
        }
      ]
    },
    {
      "group_id": 43,
      "title": "जिसके मामले कठिन हो गए हों",
      "duas": [
        {
          "id": 139,
          "group_id": 43,
          "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
          "translation": "हे अल्लाह, केवल वही चीज़ें आसान हैं, जिन्हें तूने आसान किया है, और अगर तू चाहे तो कठिनाई को भी आसान बना देता है।",
          "reference": "Ibn Ĥibbân in his Ŝaĥîĥ [2427], Mawârid and Ibn As-Sunnî [351]. And Ibn Ĥajar said: \"This ĥadîth is Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť also declared it Ŝaĥîĥ in his takrîj of Imam Nawawî 's Athkâr (pg. 106)."
        }
      ]
    },
    {
      "group_id": 44,
      "title": "जब कोई गुनाह कर लिया हो",
      "duas": [
        {
          "id": 140,
          "group_id": 44,
          "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
          "translation": "कोई भी बंदा जो गुनाह करता है और उसके बाद वुज़ू करता है, दो रकअत नमाज़ पढ़ता है और अल्लाह से माफी मांगता है, तो अल्लाह उसे माफ कर देता है।",
          "reference": "Abû Dâwud [1521](2/86) and At-Tirmidhî [406,3006](2/257). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 46,
      "title": "किसी आपदा का सामना करने या किसी मामले में घिर जाने पर",
      "duas": [
        {
          "id": 144,
          "group_id": 46,
          "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
          "translation": "अल्लाह ने तै कर दिया और जो उसने चाहा वह किया।",
          "reference": "Muslim [2664](4/2052)."
        }
      ]
    },
    {
      "group_id": 88,
      "title": "दज्जाल से बचाव के लिए",
      "duas": [
        {
          "id": 199,
          "group_id": 88,
          "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
          "translation": "जो कोई सूरह अल-कहफ की पहली दस आयतें याद कर लेगा, वह दज्जाल से महफूज़ रहेगा।",
          "reference": "Muslim [809](1/555)."
        }
      ]
    },
    {
      "group_id": 107,
      "title": "नबी (सल्लल्लाहु अलैहि व सल्लम) पर दुआओं का लाभ",
      "duas": [
        {
          "id": 219,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
          "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'जो मुझ पर एक बार दुआएं भेजेगा, अल्लाह उस पर दस बार दुआएं भेजेगा।'",
          "reference": "Muslim [408](1/288)."
        },
        {
          "id": 220,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
          "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'मेरी कब्र को एक धार्मिक उत्सव का स्थान न बनाओ। मुझ पर दुआ भेजो, क्योंकि तुम्हारी दुआएं मुझे वहां पहुंचती हैं, चाहे तुम जहां भी हो।'",
          "reference": "Abû Dâwud [2042](2/218) and Aĥmad (2/367). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/383)."
        },
        {
          "id": 221,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
          "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा : 'कंजूस वह है जिसके पास मेरा ज़िक्र किया जाए और वह मुझ पर दुआ न भेजे।'",
          "reference": "At-Tirmidhî [3546](5/551). Also see Ŝaĥîĥ Al-Jâmi' [2787](3/25) and Ŝaĥîĥ At-Tirmidhî (3/177)."
        },
        {
          "id": 222,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
          "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'अल्लाह के फरिश्ते ज़मीन में घूमते हैं, मेरी उम्मत की सलामियां मुझ तक पहुंचाते हैं।'",
          "reference": "An-Nisâ'i (3/43) and Al-Hâkim (2/421). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/274)."
        },
        {
          "id": 223,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
          "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'जब कोई मुझ पर सलाम भेजता है, अल्लाह मेरी रूह को वापस कर देता है ताकि मैं उस सलाम का जवाब दे सकूं।'",
          "reference": "Abû Dâwud (2041). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 129,
      "title": "माफी और तौबा की तलाश",
      "duas": [
        {
          "id": 248,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
          "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा : 'अल्लाह की कसम, मैं एक दिन में अल्लाह से सत्तर से अधिक बार माफी मांगता हूं और तौबा करता हूं।'",
          "reference": "Al-Bukhârî [6307](11/101)."
        },
        {
          "id": 249,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
          "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा : 'हे लोगों, तौबा करो! बेशक मैं एक दिन में अल्लाह से सौ बार तौबा करता हूं।'",
          "reference": "Muslim [2702](4/2076)."
        },
        {
          "id": 250,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
          "translation": "जो कहे: 'मैं अल्लाह से माफी मांगता हूं, जिसके सिवा कोई इबादत के लायक नहीं, जो ज़िंदा है और सब कुछ कायम रखने वाला है, और मैं उसकी तरफ तौबा करता हूं,' अल्लाह उसे माफ कर देता है, चाहे वह युद्ध से भागा हो।",
          "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511)  and he authenticated it and Adh-Dhahabî agreed with him. Al-Albânî authenticated it, see Ŝaĥîĥ At-Tirmidhî (3/182) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/389-390) with research by Arnâ'ûť."
        },
        {
          "id": 251,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
          "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा : 'रात के अंतिम हिस्से में बंदा अपने रब के सबसे करीब होता है, इसलिए अगर तुम उस समय अल्लाह को याद करने वालों में से हो सकते हो, तो ऐसा करो।'",
          "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), and Al-Hâkim. Also see Ŝaĥîĥ At-Tirmidhî (3/183) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/144) with research by Arnâ'ûť."
        },
        {
          "id": 252,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
          "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा : 'जब बंदा सजदे में होता है, तो वह अपने रब के सबसे करीब होता है, इसलिए इस समय अधिक दुआ करो।'",
          "reference": "Muslim [482](1/350)."
        },
        {
          "id": 253,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
          "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'वास्तव में मेरा दिल कभी-कभी प्रभावित हो जाता है, और वास्तव में मैं एक दिन में सौ बार अल्लाह से माफी मांगता हूं।'",
          "reference": "Muslim [2702](4/2075). Also see Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/386)."
        }
      ]
    },
    {
  "group_id": 130,
  "title": "अल्लाह के स्मरण और महिमा का महत्व",
  "duas": [
    {
      "id": 254,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
      "translation": "जो व्यक्ति कहता है: 'अल्लाह पवित्र है और उसकी प्रशंसा है' एक दिन में सौ बार, उसके गुनाह माफ़ कर दिए जाएंगे, चाहे वे समंदर की झाग के बराबर ही क्यों न हों।",
      "reference": "Al-Bukhârî [6405](7/168) and Muslim [2691](4/2071)."
    },
    {
      "id": 255,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
      "translation": "जो व्यक्ति कहता है: 'अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साथी नहीं है, उसी का राज्य है, और उसी की प्रशंसा है, और वह हर चीज़ पर सक्षम है' दस बार, वह ऐसा है जैसे उसने इस्माईल की संतानों में से चार लोगों को आज़ाद कर दिया हो।",
      "reference": "Al-Bukhârî (7/67) and Muslim (4/2017)."
    },
    {
      "id": 256,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
      "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'दो शब्द (वाक्य) ऐसे हैं, जो ज़ुबान पर हल्के हैं, मगर तराजू में भारी हैं, और रहमान के लिए प्रिय हैं: 'अल्लाह पवित्र है और मैं उसकी प्रशंसा करता हूं', और 'अल्लाह पवित्र है, महान है।'",
      "reference": "Al-Bukhârî [3462](7/168) and Muslim [2694](4/2072)."
    },
    {
      "id": 257,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
      "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'कहना 'अल्लाह पवित्र है, और सभी प्रशंसा अल्लाह के लिए है। अल्लाह के सिवा कोई पूज्य नहीं, और अल्लाह सबसे बड़ा है', मेरे लिए सूरज के उगने वाली हर चीज़ से ज़्यादा प्रिय है।'",
      "reference": "Muslim [2695](4/2072)."
    },
    {
      "id": 258,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
      "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'क्या तुम में से कोई हर दिन एक हज़ार नेकी हासिल नहीं कर सकता?' एक व्यक्ति ने पूछा: 'हम में से कोई कैसे एक हज़ार नेकी कमा सकता है?' उन्होंने कहा: 'वह सौ बार तस्बीह कहेगा, तो उसके लिए एक हज़ार नेकी लिखी जाएगी या एक हज़ार गुनाह मिटा दिए जाएंगे।'",
      "reference": "Muslim [2698](4/2073)."
    },
    {
      "id": 259,
      "group_id": 130,
      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
      "translation": "जो कहे: 'अल्लाह पवित्र है, महान है, और मैं उसकी प्रशंसा करता हूं', उसके लिए जन्नत में एक खजूर का पेड़ लगाया जाएगा।",
      "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [6429](5/531) and Ŝaĥîĥ At-Tirmidhî (3/160)."
    },
    {
      "id": 260,
      "group_id": 130,
      "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
      "translation": "अल्लाह के रसूल (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'हे अब्दुल्लाह इब्न क़ैस, क्या मैं तुम्हें जन्नत के खज़ानों में से एक खज़ाना न बताऊं?' मैंने कहा: 'बिल्कुल, ऐ अल्लाह के रसूल।' उन्होंने कहा: 'कहो, लाः हौला व ला क़ूव्वता इल्ला बिल्लाह (अल्लाह के बिना कोई शक्ति या सामर्थ्य नहीं)।'",
      "reference": "Al-Bukhârî [4205](11/213) and Muslim [2704](4/2076)."
    },
    {
      "id": 261,
      "group_id": 130,
      "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
      "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'चार शब्द अल्लाह को सबसे प्रिय हैं: 'सुब्हानअल्लाह', 'अल्हम्दुलिल्लाह', 'ला इलाहा इल्लल्लाह' और 'अल्लाहु अकबर'। इनमें से किसी से भी शुरू करने से कोई फर्क नहीं पड़ता।'",
      "reference": "Muslim [2137](3/1685)."
    },
    {
      "id": 262,
      "group_id": 130,
      "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
      "translation": "एक बद्दू नबी (सल्लल्लाहु अलैहि व सल्लम) के पास आया और कहा: 'मुझे ऐसा वाक्य सिखाइए जिसे मैं कह सकूं।' नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'कहो: 'अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साथी नहीं। अल्लाह बहुत बड़ा है। सभी प्रशंसा अल्लाह के लिए है। अल्लाह पवित्र है, संसारों का रब। अल्लाह के बिना कोई शक्ति या सामर्थ्य नहीं है, जो महान और बुद्धिमान है।' फिर उसने कहा: 'यह सब मेरे रब के लिए है, मेरे लिए क्या है?' नबी (सल्लल्लाहु अलैहि व सल्लम) ने कहा: 'कहो: 'अल्लाहुम्मा इग़फ़िरली, वारहमनी, वाह्दिनी, वार्ज़ुकनी (हे अल्लाह, मुझे माफ़ कर दे, मुझ पर रहम कर, मुझे हिदायत दे और मुझे रोज़ी दे)।'",
      "reference": "Muslim [2696](4/2072)."
    },
    {
      "id": 263,
      "group_id": 130,
      "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
      "translation": "जब कोई व्यक्ति इस्लाम कबूल करता, नबी (सल्लल्लाहु अलैहि व सल्लम) उसे नमाज़ सिखाते और फिर उसे यह दुआएं पढ़ने का हुक्म देते: 'अल्लाहुम्मा इग़फ़िरली, वारहमनी, वाह्दिनी, वाअफिनी, वार्ज़ुकनी (हे अल्लाह, मुझे माफ़ कर दे, मुझ पर रहम कर, मुझे हिदायत दे, मुझे सेहत दे और मुझे रोज़ी दे)।'",
      "reference": "Muslim [2697](4/2073)."
    },
    {
      "id": 264,
      "group_id": 130,
      "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
      "translation": "वास्तव में सबसे बेहतरीन दुआ: 'अल्हम्दुलिल्लाह' (अल्लाह के लिए सभी प्रशंसा है) है, और सबसे बेहतरीन ज़िक्र: 'ला इलाहा इल्लल्लाह' (अल्लाह के सिवा कोई पूज्य नहीं) है।",
      "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), and Al-Hâkim (1/503) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [1104](1/362)."
    },
    {
      "id": 265,
      "group_id": 130,
      "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
      "translation": "बाक़ी रहने वाले अच्छे काम: 'सुब्हानअल्लाह', 'अल्हम्दुलिल्लाह', 'ला इलाहा इल्लल्लाह', 'अल्लाहु अकबर' और 'ला हौला व ला क़ूव्वता इल्ला बिल्लाह' हैं।",
      "reference": "Aĥmad [513](3/75) according to the order of Aĥmad Shâkir and its chain is authentic. Also see Majma' Az-Zawâ'id (1/297)."
    }
  ]
},
    {
  "group_id": 131,
  "title": "नबी (सल्लल्लाहु अलैहि व सल्लम) का तस्बीह करने का तरीका",
  "duas": [
    {
      "id": 266,
      "group_id": 131,
      "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
      "translation": "'अब्दुल्लाह इब्न अम्र (रजियल्लाहु अन्हु) ने कहा: 'मैंने नबी (सल्लल्लाहु अलैहि व सल्लम) को अपने दाएं हाथ से तस्बीह करते हुए देखा।'",
      "reference": "Abû Dâwud [1502](2/81) and At-Tirmidhî [3486](5/521). Also see Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
    }
  ]
}
  ]
},
  {
    "category_id": 4,
    "title": "हज और उमराह",
    "group": [
      {
        "group_id": 115,
        "title": "हज या उमराह करने वाले के लिए तलबिया",
        "duas": [
          {
            "id": 233,
            "group_id": 115,
            "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
            "translation": "हे अल्लाह, मैं यहाँ हूँ (तेरे बुलावे पर), मैं हाज़िर हूँ। तू अकेला है, तेरा कोई साझेदार नहीं है। बेशक, सारी प्रशंसा, अनुग्रह और राज्य तेरा है। तेरा कोई साझेदार नहीं है।",
            "reference": "Al-Bukhârî [1549](3/408) and Muslim [1184](2/841)."
          }
        ]
      },
      {
        "group_id": 116,
        "title": "काले पत्थर के पास तक़बीर कहना",
        "duas": [
          {
            "id": 234,
            "group_id": 116,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "अल्लाह सबसे महान है।",
            "reference": "Al-Bukhârî [1612](1/476)."
          }
        ]
      },
      {
        "group_id": 117,
        "title": "यमनी कोने और काले पत्थर के बीच",
        "duas": [
          {
            "id": 235,
            "group_id": 117,
            "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
            "translation": "हे हमारे पालनहार, हमें इस जीवन में भलाई और अगले जीवन में भलाई प्रदान कर, और हमें आग के अज़ाब से बचा।",
            "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) and Al-Baghawî in Sharĥ As-Sunnah (7/128). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/354).(2) Sûrah Al-Baqarah: 201."
          }
        ]
      },
      {
        "group_id": 118,
        "title": "सफ़ा और मर्वा के पर्वत पर",
        "duas": [
          {
            "id": 236,
            "group_id": 118,
            "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
            "translation": "सचमुच सफा और मर्वा अल्लाह की इबादत की जगहों में से हैं…अल्लाह के सिवा कोई पूज्य नहीं, अल्लाह सबसे बड़ा है। अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साथी नहीं। उसी का राज्य है और उसी की प्रशंसा है और वह हर चीज़ पर सक्षम है। अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है। उसने अपना वादा पूरा किया, अपने बंदे की मदद की और अकेले ही दुश्मनों को हराया।",
            "reference": "Muslim [1218](2/888)."
          }
        ]
      },
      {
        "group_id": 119,
        "title": "अराफात के दिन",
        "duas": [
          {
            "id": 237,
            "group_id": 119,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साथी नहीं। उसी का राज्य और सारी प्रशंसा है, और वह हर चीज़ पर सक्षम है।",
            "reference": "At-Tirmidhî [3585]. Al-Albânî authenticated it in Ŝaĥîĥ At-Tirmidhî (3/184) and Al-Aĥâdîth Aŝ-Ŝaĥîĥah (4/6). "
          }
        ]
      },
      {
        "group_id": 120,
        "title": "मुज़दलिफा में ज़िक्र",
        "duas": [
          {
            "id": 238,
            "group_id": 120,
            "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
            "translation": "नबी (सल्लल्लाहु अलैहि व सल्लम) अल-कसवा पर सवार हुए और अल-मशअर अल-हराम पहुंचे। फिर उन्होंने क़िबला की तरफ़ रुख किया, अल्लाह से दुआ की, उसकी महानता का ज़िक्र किया और उसकी एकता की घोषणा की। वह खड़े रहे जब तक सूरज चमकने नहीं लगा, फिर सूरज निकलने से पहले वहाँ से चले गए।",
            "reference": "Muslim [1218](2/891)."
          }
        ]
      },
      {
        "group_id": 121,
        "title": "जमारात पर प्रत्येक कंकर फेंकते समय",
        "duas": [
          {
            "id": 239,
            "group_id": 121,
            "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
            "translation": "जब भी वह जमारात पर प्रत्येक कंकर फेंकेगा, वह तकबीर कहेगा। पहली और दूसरी जमरात के बाद वह आगे बढ़ेगा और क़िबला की तरफ़ रुख करके दुआ करेगा और अपने हाथ उठाएगा। लेकिन जमरातुल अक़बा पर केवल कंकर फेंकेगा, तकबीर कहेगा और फिर वहाँ से चला जाएगा।",
            "reference": "Al-Bukhârî [1752, 1753](3/583-584) and see his wording there, Al-Bukhârî [1750](3/581) and Muslim [1296]."
          }
        ]
      },
      {
        "group_id": 127,
        "title": "क़ुर्बानी या बलिदान करते समय",
        "duas": [
          {
            "id": 246,
            "group_id": 127,
            "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
            "translation": "अल्लाह के नाम से, और अल्लाह सबसे महान है। हे अल्लाह, यह तुझसे है और तेरे लिए है, हे अल्लाह, इसे मुझसे स्वीकार कर।",
            "reference": "Muslim [1966](3/1557) and Baihaqî (9/287). What is between the brackets is from Baihaqî and others."
          }
        ]
      }
    ]
},
  {
  "category_id": 5,
  "title": "यात्रा",
  "group": [
    {
      "group_id": 95,
      "title": "जब जानवर या किसी यातायात के साधन पर सवार हों",
      "duas": [
        {
          "id": 206,
          "group_id": 95,
          "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
          "translation": "अल्लाह के नाम से, और सारी प्रशंसा अल्लाह के लिए है। वह कितना महान है, वह जिसने इस (यातायात के साधन) को हमारी सेवा में रखा, और हम खुद इसके काबिल नहीं होते, और हमारे पालनहार की ओर हमारी अंतिम मंज़िल है। सारी प्रशंसा अल्लाह के लिए है, अल्लाह सबसे महान है, हे अल्लाह, मैंने अपनी आत्मा पर अत्याचार किया, मुझे माफ़ कर दे, क्योंकि तेरे सिवा कोई पापों को माफ़ नहीं कर सकता।",
          "reference": "Abû Dâwud [2602](3/34) and At-Tirmidhî [3446](5/510). Also see Ŝaĥîĥ At-Tirmidhî (3/156)."
        }
      ]
    },
    {
      "group_id": 96,
      "title": "यात्रा के लिए",
      "duas": [
        {
          "id": 207,
          "group_id": 96,
          "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
          "translation": "(1) अल्लाह सबसे महान है, अल्लाह सबसे महान है, अल्लाह सबसे महान है। वह कितना महान है, वह जिसने इस (यातायात के साधन) को हमारी सेवा में रखा, और हम खुद इसके काबिल नहीं होते, और हमारे पालनहार की ओर हमारी अंतिम मंज़िल है। हे अल्लाह, हम इस यात्रा में तुझसे भलाई और तक़वा की मांग करते हैं, और हम तुझसे वह कार्य मांगते हैं जो तुझे पसंद हों। हे अल्लाह, हमारी यात्रा को आसान कर और इसके फासले को जल्दी से पार करा। हे अल्लाह, तू इस यात्रा में साथी है और घरवालों का संरक्षक है। हे अल्लाह, मैं तुझसे यात्रा की मुश्किलों, दृश्य की उदासी, और धन और परिवार के मामले में बुरी स्थिति से पनाह मांगता हूँ।वापसी पर वही दुआ पढ़ी जाती है, और यह जोड़ा जाता है:(2) 'हम लौटते हैं, तौबा करते हैं, इबादत करते हैं और अपने रब की प्रशंसा करते हैं।'",
          "reference": "Muslim [1342](2/998)."
        }
      ]
    },
    {
      "group_id": 97,
      "title": "जब किसी शहर या गाँव में प्रवेश करते हैं",
      "duas": [
        {
          "id": 208,
          "group_id": 97,
          "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
          "translation": "हे अल्लाह, सातों आसमानों और जो कुछ वे ढकते हैं, सातों ज़मीनों और जो कुछ वे उठाते हैं, शैतानों और जो कुछ वे गुमराह करते हैं, और हवाओं और जो कुछ वे उड़ा ले जाती हैं, का पालनहार। मैं तुझसे इस गाँव की भलाई, इसके निवासियों की भलाई और इसमें पाई जाने वाली हर भलाई की मांग करता हूँ, और तुझसे इस गाँव की बुराई, इसके निवासियों की बुराई और इसमें पाई जाने वाली हर बुराई से पनाह मांगता हूँ।",
          "reference": "Al-Hâkim (2/100) and he authenticated it and Adh-Dhahabî agreed with him, Ibn As-Sunnî [524], Al-Hâfiž declared it Ĥasan in Takrîj Al-Athkâr (5/154). Shaykh Ibn Bâz said that it has been narrated by An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548] with a Ĥasan chain. Also see Tuĥfat Al-Akhyâr (pg. 37)."
        }
      ]
    },
    {
      "group_id": 98,
      "title": "जब बाजार में प्रवेश करें",
      "duas": [
        {
          "id": 209,
          "group_id": 98,
          "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
          "translation": "अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साथी नहीं। उसी का राज्य और सारी प्रशंसा है। वह जीवन देता है और मृत्यु देता है, और वह हमेशा जीवित रहता है और नहीं मरता। उसी के हाथ में सारी भलाई है, और वह हर चीज़ पर सक्षम है।",
          "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) and Ibn Mâjah [2235]. Al-Albânî classed it as Ĥasan in Ŝaĥîĥ Ibn Mâjah (2/21) and Ŝaĥîĥ At-Tirmidhî (3/152)."
        }
      ]
    },
    {
      "group_id": 99,
      "title": "जब सवारी (या यातायात का साधन) ठोकर खाए",
      "duas": [
        {
          "id": 210,
          "group_id": 99,
          "dua": "بِسْمِ اللهِ",
          "translation": "अल्लाह के नाम से।",
          "reference": "Abû Dâwud [4982](4/296). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/941)."
        }
      ]
    },
    {
      "group_id": 100,
      "title": "यात्री की निवासी के लिए दुआ",
      "duas": [
        {
          "id": 211,
          "group_id": 100,
          "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
          "translation": "मैं तुम्हें अल्लाह की अमानत में सौंपता हूँ, जिसकी अमानत कभी गुम नहीं होती।",
          "reference": "Aĥmad (2/403) and Ibn Mâjah [2825](2/943). Also see Ŝaĥîĥ Ibn Mâjah (2/133)."
        }
      ]
    },
    {
      "group_id": 101,
      "title": "निवासी की यात्री के लिए दुआ",
      "duas": [
        {
          "id": 212,
          "group_id": 101,
          "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
          "translation": "मैं तुम्हारे दीन, तुम्हारी ईमानदारी और तुम्हारे कार्यों के अंजाम को अल्लाह की अमानत में सौंपता हूँ।",
          "reference": "Aĥmad (2/7) and At-Tirmidhî [3443](5/499). Also see Ŝaĥîĥ At-Tirmidhî (2/155)."
        },
        {
          "id": 213,
          "group_id": 101,
          "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
          "translation": "अल्लाह तुझे तक़वा से नवाजे, तेरे गुनाह माफ़ करे, और जहाँ भी तू हो, तुझसे भलाई को आसान करे।",
          "reference": "At-Tirmidhî [3444]. Also see Ŝaĥîĥ At-Tirmidhî (3/155)."
        }
      ]
    },
    {
      "group_id": 102,
      "title": "ऊंचाई पर चढ़ते या उतरते समय का ज़िक्र",
      "duas": [
        {
          "id": 214,
          "group_id": 102,
          "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
          "translation": "ऊंचाई पर चढ़ते समय, (1) 'अल्लाह सबसे महान है' पढ़ें, और उतरते समय, (2) 'अल्लाह कितना पवित्र है' पढ़ें।",
          "reference": "Al-Bukhârî [2993](6/135)."
        }
      ]
    },
    {
      "group_id": 103,
      "title": "यात्री की सुबह होने पर की गई दुआ",
      "duas": [
        {
          "id": 215,
          "group_id": 103,
          "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
          "translation": "गवाह गवाही दे कि हमने अल्लाह की प्रशंसा की, उसके एहसान और अनुग्रहों के लिए। हे हमारे रब, हमें हिफ़ाज़त दे, हम पर अपना अनुग्रह कर, और हमें हर बुराई से बचा। मैं अल्लाह से आग की पनाह मांगता हूँ।",
          "reference": "Muslim [2718](4/2086)."
        }
      ]
    },
    {
      "group_id": 104,
      "title": "कहीं रुकने या ठहरने पर",
      "duas": [
        {
          "id": 216,
          "group_id": 104,
          "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
          "translation": "मैं अल्लाह के पूर्ण शब्दों में उस बुराई से पनाह मांगता हूँ, जो उसने पैदा की है।",
          "reference": "Muslim [2708](4/2080)."
        }
      ]
    },
    {
      "group_id": 105,
      "title": "यात्रा से लौटते समय की दुआ",
      "duas": [
        {
          "id": 217,
          "group_id": 105,
          "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
          "translation": "अल्लाह सबसे महान है, अल्लाह सबसे महान है, अल्लाह सबसे महान है। अल्लाह के सिवा कोई पूज्य नहीं, वह अकेला है, उसका कोई साझेदार नहीं है। उसी का राज्य है और उसी की प्रशंसा है, और वह हर चीज़ पर सक्षम है। हम लौटते हैं, तौबा करते हैं, इबादत करते हैं, और अपने रब की प्रशंसा करते हैं। अल्लाह ने अपना वादा पूरा किया, अपने बंदे की मदद की, और अकेले ही दुश्मनों को हराया।",
          "reference": "Al-Bukhârî [1797](7/163) and Muslim [1344](2/980)."
        }
      ]
    }
  ]
},
  {
    "category_id": 6,
    "title": "खुशी और संकट",
    "group": [
      {
        "group_id": 34,
        "title": "चिंता और उदासी के लिए",
        "duas": [
          {
            "id": 120,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
            "translation": "हे अल्लाह, मैं तेरा सेवक हूँ, तेरे सेवक का बेटा हूँ, तेरी दासी का बेटा हूँ। मेरी तक़दीर तेरे हाथ में है, तेरा हुक्म मुझ पर लागू होता है और तेरा फ़ैसला मेरे लिए न्यायसंगत है। मैं तुझसे हर उस नाम के द्वारा सवाल करता हूँ जिससे तूने खुद को पुकारा है, या जिसे तूने अपनी किताब में उतारा है, या जिसे तूने अपनी सृष्टि में से किसी को सिखाया है, या जिसे तूने अपने पास ही रखा है, कि तू कुरान को मेरे दिल की बहार, मेरे सीने का नूर, मेरी उदासी का दूर करने वाला और मेरी चिंता का अंत करने वाला बना दे।",
            "reference": "Aĥmad (1/391). Al-Albânî authenticated it in Al-Kalam Ať-Ťayyib [124]."
          },
          {
            "id": 121,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
            "translation": "हे अल्लाह, मैं तुझसे चिंता और उदासी, कमजोरी और आलस्य, कंजूसी और कायरता, कर्ज़ के बोझ और लोगों द्वारा दबाव से पनाह मांगता हूँ।",
            "reference": "Al-Bukhârî [6363](7/158), see Fatĥ al-Bârî (11/173)."
          }
        ]
      },
      {
        "group_id": 35,
        "title": "संकट में पड़े व्यक्ति के लिए",
        "duas": [
          {
            "id": 122,
            "group_id": 35,
            "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
            "translation": "अल्लाह के सिवा कोई पूज्य नहीं, जो महान और सहनशील है। अल्लाह के सिवा कोई पूज्य नहीं, जो महान सिंहासन का स्वामी है। अल्लाह के सिवा कोई पूज्य नहीं, जो आसमानों का, ज़मीन का और सम्मानित सिंहासन का पालनहार है।",
            "reference": "Al-Bukhârî [6346](7/154) and Muslim [2730](4/2092)."
          },
          {
            "id": 123,
            "group_id": 35,
            "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
            "translation": "हे अल्लाह, मैं तेरी रहमत की उम्मीद करता हूँ, तो मुझे एक पल के लिए भी मेरे हाल पर न छोड़ और मेरे सारे मामले सही कर दे। तेरे सिवा कोई पूज्य नहीं।",
            "reference": "Abû Dâwud [5090](4/324) and Aĥmad (5/42). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (3/959)."
          },
          {
            "id": 124,
            "group_id": 35,
            "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
            "translation": "तेरे सिवा कोई पूज्य नहीं, तू पवित्र है, निस्संदेह मैं अत्याचारियों में से था।",
            "reference": "At-Tirmidhî [3505](5/529) and Al-Hâkim (1/505) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Tirmidhî (3/168)."
          },
          {
            "id": 125,
            "group_id": 35,
            "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
            "translation": "अल्लाह, अल्लाह मेरा पालनहार है, मैं उसके साथ किसी को साझी नहीं ठहराता।",
            "reference": "Abû Dâwud [1525](2/87). Also see Ŝaĥîĥ Ibn Mâjah (2/335)."
          }
        ]
      },
      {
        "group_id": 36,
        "title": "दुश्मनों या अधिकारियों से सामना होने पर",
        "duas": [
          {
            "id": 126,
            "group_id": 36,
            "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
            "translation": "हे अल्लाह, हम तुझे उनके सामने रखते हैं और हम उनके शर से तुझसे पनाह मांगते हैं।",
            "reference": "Abû Dâwud [1537](2/89) and Al-Hâkim (2/142) and he authenticated it and Adh-Dhahabî agreed with him."
          },
          {
            "id": 127,
            "group_id": 36,
            "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
            "translation": "हे अल्लाह, तू मेरा सहारा है और तू मेरा मददगार है, तेरी मदद से मैं आगे बढ़ता हूँ, तेरी मदद से मैं लड़ता हूँ और तेरी मदद से मैं संघर्ष करता हूँ।",
            "reference": "Abû Dâwud [2632](3/42) and At-Tirmidhî [3584](5/572). Also see Ŝaĥîĥ At-Tirmidhî (3/183)."
          },
          {
            "id": 128,
            "group_id": 36,
            "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
            "translation": "अल्लाह हमारे लिए काफ़ी है, और वह सबसे अच्छा संरक्षक है।",
            "reference": "Al-Bukhârî [4563](5/172)."
          }
        ]
      },
      {
        "group_id": 37,
        "title": "जब किसी शासक के अन्याय से डर हो",
        "duas": [
          {
            "id": 129,
            "group_id": 37,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
            "translation": "हे अल्लाह, सात आसमानों और महान सिंहासन के पालनहार, मुझे फलाँ बिन फलाँ और उनकी सेना के अन्याय से बचा, ताकि कोई मुझ पर अत्याचार न कर सके या मुझ पर हावी न हो सके। तेरा सहारा सम्मानित है, तेरी प्रशंसा महान है, तेरे सिवा कोई पूज्य नहीं।",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad [545]."
          },
          {
            "id": 130,
            "group_id": 37,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
            "translation": "अल्लाह सबसे बड़ा है, अल्लाह अपनी सृष्टि से अधिक महान है। अल्लाह उस चीज़ से अधिक महान है जिससे मैं डरता और सतर्क रहता हूँ। मैं अल्लाह की पनाह चाहता हूँ, जिसके सिवा कोई पूज्य नहीं है, जो सात आसमानों को गिरने से रोकता है सिवाय उसकी अनुमति से, तेरे बंदे फलाँ के शर से, उसकी सेना और उसके अनुयायियों से, जिन्नात और इंसानों में से। हे अल्लाह, मुझे उनके शर से बचा, तेरी प्रशंसा महान है, तेरा सहारा सम्मानित है, तेरा नाम पवित्र है, और तेरे सिवा कोई पूज्य नहीं।",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad (546)."
          }
        ]
      },
      {
        "group_id": 38,
        "title": "दुश्मनों के खिलाफ़",
        "duas": [
          {
            "id": 131,
            "group_id": 38,
            "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
            "translation": "हे अल्लाह, किताब के उतारने वाले, जल्दी हिसाब लेने वाले, दुश्मनों को हराओ। हे अल्लाह, उन्हें हराओ और उन्हें हिलाओ।",
            "reference": "Muslim [1742](3/1362)."
          }
        ]
      },
      {
        "group_id": 39,
        "title": "किसी समूह से डरने पर",
        "duas": [
          {
            "id": 132,
            "group_id": 39,
            "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
            "translation": "हे अल्लाह, अपनी मर्ज़ी से मुझे उनसे महफूज़ रख।",
            "reference": "Muslim [3005](4/2300)."
          }
        ]
      },
      {
        "group_id": 40,
        "title": "ईमान में शंका होने पर",
        "duas": [
          {
            "id": 133,
            "group_id": 40,
            "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
            "translation": "(1) शैतान से अल्लाह की पनाह माँगो।(2) उस विचार को छोड़ दो जो शंका पैदा कर रहा है।",
            "reference": "Al-Bukhârî [6/336](6/336) and Muslim [134,214](1/120)."
          },
          {
            "id": 134,
            "group_id": 40,
            "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
            "translation": "मैं अल्लाह और उसके रसूलों पर ईमान लाता हूँ।",
            "reference": "Muslim [134,212](1/119-120)."
          },
          {
            "id": 135,
            "group_id": 40,
            "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
            "translation": "वह पहले और आख़िरी, ज़ाहिर और बातिन है, और वह हर चीज़ का ज्ञान रखता है।",
            "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abî  Dâwud (3/962)."
          }
        ]
      },
      {
        "group_id": 41,
        "title": "कर्ज़ चुकाने के लिए",
        "duas": [
          {
            "id": 136,
            "group_id": 41,
            "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
            "translation": "हे अल्लाह, मुझे अपने हलाल से हराम से दूर कर दे, और अपनी कृपा से दूसरों से बेपरवाह कर दे।",
            "reference": "At-Tirmidhî [3563](5/650). Also see Ŝaĥîĥ At-Tirmidhî (3/180)."
          },
          {
            "id": 137,
            "group_id": 41,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
            "translation": "हे अल्लाह, मैं तुझसे चिंता और उदासी, कमजोरी और आलस्य, कंजूसी और कायरता, कर्ज़ के बोझ और लोगों द्वारा दबाव से पनाह मांगता हूँ।",
            "reference": "Al-Bukhârî [6363](7/158)."
          }
        ]
      },
      {
        "group_id": 53,
        "title": "आपदा में पड़े व्यक्ति के लिए",
        "duas": [
          {
            "id": 154,
            "group_id": 53,
            "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
            "translation": "हम अल्लाह के हैं और हमें उसी की ओर लौटना है। हे अल्लाह, मुझे मेरी आपदा में इनाम दे, और इसे मुझसे बेहतर से बदल दे।",
            "reference": "Muslim [918](2/632)."
          }
        ]
      },
      {
        "group_id": 92,
        "title": "शिर्क के डर से",
        "duas": [
          {
            "id": 203,
            "group_id": 92,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
            "translation": "हे अल्लाह, मैं तुझसे पनाह माँगता हूँ कि मैं तुझसे साझेदारी करूँ जब मुझे इसका ज्ञान हो, और मैं तुझसे माफ़ी माँगता हूँ उसके लिए जिसका मुझे ज्ञान नहीं है।",
            "reference": "Aĥmad (4/403). Also see Ŝaĥîĥ Al-Jâmi' [3731](3/233) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) by Al-Albânî."
          }
        ]
      },
      {
        "group_id": 94,
        "title": "अपशकुन मानने की मना की दुआ",
        "duas": [
          {
            "id": 205,
            "group_id": 94,
            "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
            "translation": "हे अल्लाह, कोई अपशकुन नहीं है, सिवाय तेरी शक्ति के, कोई भलाई नहीं है सिवाय तेरी भलाई के, और तेरे सिवा कोई पूज्य नहीं।",
            "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54)."
          }
        ]
      },
      {
        "group_id": 106,
        "title": "ख़ुशख़बरी या बुरी खबर मिलने पर",
        "duas": [
          {
            "id": 218,
            "group_id": 106,
            "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
            "translation": "खुशख़बरी मिलने पर कहें: (1) 'सारी तारीफें अल्लाह के लिए हैं, जिसकी नेमत से नेकियाँ पूरी होती हैं।'बुरी खबर मिलने पर कहें: (2) 'सारी तारीफें हर हाल में अल्लाह के लिए हैं।'",
            "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] and Al-Hâkim (1/499) and he authenticated it. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [4640](4/201)."
          }
        ]
      },
      {
        "group_id": 122,
        "title": "हैरान और प्रसन्न होने पर",
        "duas": [
          {
            "id": 240,
            "group_id": 122,
            "dua": "سُبْحَانَ اللهِ!",
            "translation": "अल्लाह पवित्र है!",
            "reference": "Al-Bukhârî [155](1/210), [283](1/390) and Muslim [371], [314](414), [332](4/1857)."
          },
          {
            "id": 241,
            "group_id": 122,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "अल्लाह सबसे बड़ा है।",
            "reference": "Al-Bukhârî [4741](8/441). Also see Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) and Aĥmad (5/218)."
          }
        ]
      },
      {
        "group_id": 123,
        "title": "खुशख़बरी मिलने पर",
        "duas": [
          {
            "id": 242,
            "group_id": 123,
            "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
            "translation": "जब नबी (सल्लल्लाहु अलैहि वसल्लम) को कोई ऐसी बात मिलती जिससे उन्हें खुशी होती या वे प्रसन्न होते, तो वे अल्लाह का शुक्र अदा करने के लिए सज्दा करते थे।",
            "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] and Ibn Mâjah [1394]. Also see Ŝaĥîĥ Ibn Mâjah (1/233) and Irwâ'-ul-Ghalîl (2/226)."
          }
        ]
      },
      {
        "group_id": 126,
        "title": "डर लगने पर",
        "duas": [
          {
            "id": 245,
            "group_id": 126,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "अल्लाह के सिवा कोई पूज्य नहीं।",
            "reference": "Al-Bukhârî [3346](6/381) and Muslim [2880](4/2208)."
          }
        ]
      }
  ]
},
  {
    "category_id": 7,
    "title": "प्रकृति",
    "group": [
      {
        "group_id": 61,
        "title": "आँधी के दौरान",
        "duas": [
          {
            "id": 166,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
            "translation": "हे अल्लाह, मैं तुझसे इसके भले की मांग करता हूँ और इसके बुरे से तेरी पनाह में आता हूँ।",
            "reference": "Abû Dâwud [5097](4/326) and Ibn Mâjah [3727](2/1228). Also see Ŝaĥîĥ Ibn Mâjah (2/305)."
          },
          {
            "id": 167,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
            "translation": "हे अल्लाह, मैं तुझसे इसके भले की, इसमें जो भला है और जिस भले के साथ इसे भेजा गया है उसकी मांग करता हूँ, और इसके बुरे से, इसमें जो बुरा है और जिस बुरे के साथ इसे भेजा गया है उससे तेरी पनाह मांगता हूँ।",
            "reference": "Muslim [899](2/616) and Al-Bukhârî [3206](4/76)."
          }
        ]
      },
      {
        "group_id": 62,
        "title": "गरज (बिजली की आवाज़) सुनने पर",
        "duas": [
          {
            "id": 168,
            "group_id": 62,
            "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
            "translation": "वह पाक है, जिसे गरज उसकी तारीफ के साथ तस्बीह करती है और फरिश्ते उसके डर से (तस्बीह करते हैं)।",
            "reference": "Al-Muwaťťa' (2/992) and Al-Albânî declared its chain to be Ŝaĥîĥ and Mawqûf."
          }
        ]
      },
      {
        "group_id": 63,
        "title": "बारिश के लिए दुआ",
        "duas": [
          {
            "id": 169,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
            "translation": "हे अल्लाह, हम पर मददगार, स्वच्छ और स्वस्थ बारिश भेज, जो लाभकारी हो, हानिकारक न हो, और अब हो, बाद में न हो।",
            "reference": "Abû Dâwud [1169](1/303). Al-Albânî declared it authentic in Ŝaĥîĥ Abû Dâwud (1/216)."
          },
          {
            "id": 170,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
            "translation": "हे अल्लाह, हमारी मदद कर, हे अल्लाह, हमारी मदद कर, हे अल्लाह, हमारी मदद कर।",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/613)."
          },
          {
            "id": 171,
            "group_id": 63,
            "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
            "translation": "हे अल्लाह, अपने बंदों और जानवरों के लिए पानी भेज, अपनी रहमत फैलाओ और अपनी मुर्दा ज़मीन को ज़िंदा कर दे।",
            "reference": "Abû Dâwud [1176](1/305) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/218)."
          }
        ]
      },
      {
        "group_id": 64,
        "title": "बारिश होने पर",
        "duas": [
          {
            "id": 172,
            "group_id": 64,
            "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
            "translation": "हे अल्लाह, इसे एक लाभकारी बारिश बना।",
            "reference": "Al-Bukhârî [1032](2/518)."
          }
        ]
      },
      {
        "group_id": 65,
        "title": "बारिश के बाद",
        "duas": [
          {
            "id": 173,
            "group_id": 65,
            "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
            "translation": "हमें अल्लाह की कृपा और रहमत से बारिश मिली है।",
            "reference": "Al-Bukhârî [846](1/205) and Muslim [71](1/83)."
          }
        ]
      },
      {
        "group_id": 66,
        "title": "आसमान साफ़ होने की दुआ",
        "duas": [
          {
            "id": 174,
            "group_id": 66,
            "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
            "translation": "हे अल्लाह, हमारे इर्द-गिर्द बारिश गिरा, हम पर नहीं। हे अल्लाह, इसे चरागाहों, पहाड़ियों, घाटियों और पेड़ों की जड़ों पर गिरा।",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/614)."
          }
        ]
      },
      {
        "group_id": 67,
        "title": "हिलाल (चाँद का पहला दिन) देखने पर",
        "duas": [
          {
            "id": 175,
            "group_id": 67,
            "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
            "translation": "अल्लाह सबसे बड़ा है। हे अल्लाह, हमें इस हिलाल को सुरक्षा, ईमान, सलामती और इस्लाम के साथ देखना नसीब कर, और हर उस काम में हमें सफलता दे जो तू पसंद करता है और जिससे तू राज़ी होता है। हमारा और तुम्हारा रब अल्लाह है।",
            "reference": "At-Tirmidhî [3451](5/405) and Ad-Dârimî (1/336) and the wording is his. Also see Ŝaĥîĥ At-Tirmidhî (3/157)."
          }
        ]
      },
      {
        "group_id": 76,
        "title": "फलों के शुरुआती या अपरिपक्व फल देखने पर",
        "duas": [
          {
            "id": 187,
            "group_id": 76,
            "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
            "translation": "हे अल्लाह, हमारे फलों में बरकत दे, हमारे शहर में बरकत दे, हमारे साअ में बरकत दे और हमारे मुद्ध में बरकत दे।",
            "reference": "Muslim [1373](2/1000)."
          }
        ]
      },
      {
        "group_id": 110,
        "title": "मुर्गे की बांग या गधे की आवाज़ सुनने पर",
        "duas": [
          {
            "id": 228,
            "group_id": 110,
            "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
            "translation": "जब तुम मुर्गे की बांग सुनो, तो अल्लाह से उसकी कृपा मांगो क्योंकि उसने एक फ़रिश्ता देखा है। और जब तुम गधे की आवाज़ सुनो, तो अल्लाह से शैतान से पनाह मांगो क्योंकि उसने एक शैतान देखा है।",
            "reference": "Al-Bukhârî [3303](6/350) and Muslim [2729](4/2092)."
          }
        ]
      },
      {
        "group_id": 111,
        "title": "रात में कुत्तों का भौंकना सुनने पर",
        "duas": [
          {
            "id": 229,
            "group_id": 111,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "translation": "अगर तुम रात में कुत्तों के भौंकने या गधों के आवाज़ सुनो, तो अल्लाह से शैतान से पनाह मांगो, क्योंकि वे वह देखते हैं जो तुम नहीं देख सकते।",
            "reference": "Abû Dâwud [5103](4/327) and Aĥmad (3/306). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/961)."
          }
        ]
      }
    ]
  },
  {
      "category_id": 8,
      "title": "अच्छे शिष्टाचार",
      "group": [
        {
          "group_id": 47,
          "title": "जन्म के अवसर पर बधाई",
          "duas": [
            {
              "id": 145,
              "group_id": 47,
              "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
              "translation": "अल्लाह उस चीज़ में बरकत दे जो उसने तुम्हें बख्शी है और तुम उस दाता के आभारी रहो। यह बच्चा अपनी जवानी तक पहुँचे और तुम उसकी भलाई का फल पाओ।जवाब: अल्लाह तुम्हारे लिए भी बरकत दे, और तुम पर भी बरकत हो। अल्लाह तुम्हें अच्छा इनाम दे और तुम्हें भी ऐसा ही बख्शे।",
              "reference": "An-Nawawî [Al-Athkâr](pg. 349). Also see Ŝaĥîĥ Al-Athkâr of Imam An-Nawawî (2/713) by Shaykh Salîm Al-Hilâlî."
            }
          ]
        },
        {
          "group_id": 75,
          "title": "रोज़ा रखते समय गाली दी जाने पर",
          "duas": [
            {
              "id": 186,
              "group_id": 75,
              "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
              "translation": "मैं रोज़ा रख रहा हूँ, मैं रोज़ा रख रहा हूँ।",
              "reference": "Al-Bukhârî [1894](4/103) and Muslim [1151](2/806)."
            }
          ]
        },
        {
          "group_id": 77,
          "title": "छींक आने पर",
          "duas": [
            {
              "id": 188,
              "group_id": 77,
              "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
              "translation": "जब तुम में से कोई छींक ले, तो कहो: (1) 'अल्लाह की तारीफ़ हो', फिर उसका साथी कहे: (2) 'अल्लाह तुम पर रहमत करे', और छींकने वाला जवाब में कहे: (3) 'अल्लाह तुम्हें हिदायत दे और तुम्हारी हालत सुधार दे।'",
              "reference": "Al-Bukhârî [6224](7/125)."
            }
          ]
        },
        {
          "group_id": 78,
          "title": "जब किसी काफ़िर ने छींकने के बाद अल्लाह की तारीफ़ की",
          "duas": [
            {
              "id": 189,
              "group_id": 78,
              "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
              "translation": "अल्लाह तुम्हें हिदायत दे और तुम्हारी हालत सुधार दे।",
              "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) and Abû Dâwud [5038](4/308). Also see Ŝaĥîĥ At-Tirmidhî (2/354)."
            }
          ]
        },
        {
          "group_id": 80,
          "title": "शादी की रात या जानवर खरीदते समय",
          "duas": [
            {
              "id": 191,
              "group_id": 80,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
              "translation": "हे अल्लाह, मैं तुझसे इसके अंदर की भलाई और जिस भलाई के लिए तूने इसे बनाया है, उसकी मांग करता हूँ। और मैं तुझसे इसके अंदर की बुराई और जिस बुराई के लिए तूने इसे बनाया है, उसकी पनाह मांगता हूँ।",
              "reference": "Abû Dâwud [2160](2/248) and Ibn Mâjah [1918](1/617). Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
            }
          ]
        },
        {
          "group_id": 82,
          "title": "गुस्से में होने पर",
          "duas": [
            {
              "id": 193,
              "group_id": 82,
              "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
              "translation": "मैं अल्लाह से धिक्कारे हुए शैतान की पनाह मांगता हूँ।",
              "reference": "Al-Bukhârî [6048](7/99) and Muslim [2610](5/2015)."
            }
          ]
        },
        {
          "group_id": 83,
          "title": "जब किसी को मुसीबत में देखो",
          "duas": [
            {
              "id": 194,
              "group_id": 83,
              "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
              "translation": "अल्लाह का शुक्र है, जिसने मुझे उस चीज़ से बचाया जिससे उसने तुम्हें आजमाया और जिसने मुझे अपनी मखलूक में से बहुत से लोगों पर फज़ीलत दी।",
              "reference": "At-Tirmidhî [3432](5/493,494). Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
            }
          ]
        },
        {
          "group_id": 84,
          "title": "किसी बैठक या सभा में",
          "duas": [
            {
              "id": 195,
              "group_id": 84,
              "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
              "translation": "हे मेरे रब, मुझे माफ़ कर और मुझ पर कृपा कर। यकीनन तू तौबा क़बूल करने वाला और बहुत माफ़ करने वाला है।",
              "reference": "At-Tirmidhî [3432]. Also see Ŝaĥîĥ At-Tirmidhî (3/153) and Ŝaĥîĥ Ibn Mâjah (2/321) and the wording is At-Tirmidhî's."
            }
          ]
        },
        {
          "group_id": 85,
          "title": "बैठक या सभा के अंत में गुनाहों का कफ़्फ़ारा",
          "duas": [
            {
              "id": 196,
              "group_id": 85,
              "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
              "translation": "हे अल्लाह, तू पाक है और मैं तेरी तारीफ़ करता हूँ। मैं गवाही देता हूँ कि तुझसे अलावा कोई इबादत के लायक नहीं है। मैं तुझसे माफ़ी मांगता हूँ और तेरी तरफ़ तौबा करता हूँ।",
              "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
            }
          ]
        },
        {
          "group_id": 86,
          "title": "माफी की दुआ का जवाब देना",
          "duas": [
            {
              "id": 197,
              "group_id": 86,
              "dua": "وَلَكَ",
              "translation": "और (अल्लाह तुम्हें भी माफ़ करे)।",
              "reference": "Aĥmad (5/82) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
            }
          ]
        },
        {
          "group_id": 87,
          "title": "किसी ने तुम्हारा अहसान किया हो तो",
          "duas": [
            {
              "id": 198,
              "group_id": 87,
              "dua": "جَزَاكَ اللهُ خَيْراً",
              "translation": "अल्लाह तुम्हें भलाई का इनाम दे।",
              "reference": "At-Tirmidhî [2035]. Also see Ŝaĥîĥ Al-Jâmi' [6244] and Ŝaĥîĥ At-Tirmidhî (2/200)."
            }
          ]
        },
        {
          "group_id": 89,
          "title": "जब कोई तुम्हारे लिए अल्लाह के लिए मोहब्बत ज़ाहिर करे",
          "duas": [
            {
              "id": 200,
              "group_id": 89,
              "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
              "translation": "तुम्हें भी वह (अल्लाह) मोहब्बत करे जिसके लिए तुमने मुझसे मोहब्बत की।",
              "reference": "Abû Dâwud [5125](4/333) and Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/965)."
            }
          ]
        },
        {
          "group_id": 90,
          "title": "जब कोई अपनी दौलत तुम्हें दे",
          "duas": [
            {
              "id": 201,
              "group_id": 90,
              "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
              "translation": "अल्लाह तुम्हारे लिए तुम्हारे घरवालों और दौलत में बरकत दे।",
              "reference": "Abû Dâwud [5125](4/333) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (3/965)."
            }
          ]
        },
        {
          "group_id": 91,
          "title": "कर्ज़दार का कर्ज़ अदा करने पर",
          "duas": [
            {
              "id": 202,
              "group_id": 91,
              "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
              "translation": "अल्लाह तुम्हारे घरवालों और दौलत में बरकत दे। यकीनन कर्ज़ का इनाम शुक्रिया और अदा करना है।",
              "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) and Ibn Mâjah [2424](2/809). Also see Ŝaĥîĥ Ibn Mâjah (2/55)."
            }
          ]
        },
        {
          "group_id": 93,
          "title": "तोहफ़ा या सदक़ा देने पर दुआ का जवाब देना",
          "duas": [
            {
              "id": 204,
              "group_id": 93,
              "dua": "وَفِيْكَ بَارَكَ اللهُ",
              "translation": "अल्लाह तुम्हें भी बरकत दे।",
              "reference": "Ibn As-Sunnî [278](pg. 138). Also see Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) with research by Bashîr Muĥammad 'Uyun. "
            }
          ]
        },
        {
          "group_id": 108,
          "title": "इस्लामिक सलाम फैलाने की अहमियत",
          "duas": [
            {
              "id": 224,
              "group_id": 108,
              "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
              "translation": "नबी ﷺ ने कहा: 'तुम जन्नत में दाखिल नहीं हो सकते जब तक तुम ईमान नहीं लाते और तुम तब तक ईमान नहीं ला सकते जब तक तुम एक-दूसरे से मोहब्बत नहीं करते। क्या मैं तुम्हें एक चीज़ न बताऊँ, अगर तुम इसे अपनाओ तो तुम एक-दूसरे से मोहब्बत करोगे? आपस में सलाम को फैलाओ।'",
              "reference": "Muslim [54](1/74)."
            },
            {
              "id": 225,
              "group_id": 108,
              "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
              "translation": "'अम्मार बिन यासिर (रज़ि.) ने कहा: 'तीन गुण, जिन्हें कोई अपना लेता है, तो उसने ईमान पूरा कर लिया: खुद से इंसाफ करना, दुनिया के लोगों के साथ सलाम फैलाना और तंगी के बावजूद (खुदा की राह में) खर्च करना।'",
              "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
            },
            {
              "id": 226,
              "group_id": 108,
              "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
              "translation": "'अब्दुल्लाह बिन अम्र (रज़ि.) ने बयान किया कि एक आदमी ने नबी ﷺ से पूछा: ‘सबसे बेहतरीन इस्लाम कौन सा है?’। नबी ﷺ ने जवाब दिया: '(गरीबों को) खाना खिलाना और उन लोगों को सलाम करना जिन्हें तुम जानते हो और जिन्हें तुम नहीं जानते।'",
              "reference": "Al-Bukhârî [12](1/55) and Muslim [39](1/65)."
            }
          ]
        },
        {
          "group_id": 109,
          "title": "किसी काफ़िर को सलाम का जवाब देना",
          "duas": [
            {
              "id": 227,
              "group_id": 109,
              "dua": "وَ عَلَيْكُمْ",
              "translation": "और तुम पर भी।",
              "reference": "Al-Bukhârî [6258](11/42) and Muslim [2163](4/1705)."
            }
          ]
        },
        {
          "group_id": 112,
          "title": "जिसे आपने गाली दी हो उसके लिए",
          "duas": [
            {
              "id": 230,
              "group_id": 112,
              "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
              "translation": "हे अल्लाह, जिस किसी मोमिन को मैंने गाली दी हो, तो उसे क़यामत के दिन उसके लिए तुझे करीब कर दे।",
              "reference": "Al-Bukhârî [6361](11/171) and Muslim [2601](4/2007)."
            }
          ]
        },
        {
          "group_id": 113,
          "title": "किसी मुस्लिम साथी की तारीफ़ करते समय शिष्टाचार",
          "duas": [
            {
              "id": 231,
              "group_id": 113,
              "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
              "translation": "नबी ﷺ ने कहा: 'जब तुम में से कोई अपने साथी की तारीफ़ कर रहा हो, तो कहे: 'मैं समझता हूँ कि वह शख्स ऐसा और ऐसा है और अल्लाह उसका हिसाब लेने वाला है और मैं किसी को अल्लाह से पहले नहीं रखता, लेकिन मैं उसे ऐसा और ऐसा समझता हूँ – अगर वह इसके बारे में जानता हो।'",
              "reference": "Muslim [3000](4/2296) and Al-Bukhârî [2662]."
            }
          ]
        },
        {
          "group_id": 114,
          "title": "जिसकी तारीफ़ की गई हो उसके लिए दुआ",
          "duas": [
            {
              "id": 232,
              "group_id": 114,
              "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
              "translation": "हे अल्लाह, जो वे कहते हैं उसके लिए मुझे पकड़ में न लेना, मुझे माफ़ कर जो वे नहीं जानते (और मुझे उनसे बेहतर बना जो वे मेरे बारे में सोचते हैं)।",
              "reference": "Al-Bukhârî [Adab Al-Mufrad][761] and Al-Albânî declared its chain Ĥasan in Ŝaĥîĥ Adab Al-Mufrad [585]. What is between the brackets is an extension from Al-Baihaqî [Shu'ab Al-Imân](4/228) through a different way."
            }
          ]
        }
      ]
    },
  {
  "category_id": 9,
  "title": "घर और परिवार",
  "group": [
    {
      "group_id": 2,
      "title": "कपड़ा पहनते समय",
      "duas": [
        {
          "id": 5,
          "group_id": 2,
          "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
          "translation": "सारी तारीफें अल्लाह के लिए हैं जिसने मुझे ये (कपड़ा) पहनाया और मुझे बिना मेरी शक्ति और सामर्थ्य के इसे प्रदान किया।",
          "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] and Ibn Mâjah [3285]. Also see Irwâ'-ul-Ghalîl (7/47)."
        }
      ]
    },
    {
      "group_id": 3,
      "title": "नया कपड़ा पहनते समय",
      "duas": [
        {
          "id": 6,
          "group_id": 3,
          "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
          "translation": "हे अल्लाह, सारी तारीफें तेरे लिए हैं, तूने मुझे इसे पहनाया है। मैं तुझसे इसके भलाई की दुआ करता हूँ और उसके लिए जो भलाई से बनाया गया है, और मैं तुझसे इसकी बुराई और उसके लिए जो बुराई से बनाया गया है, से पनाह मांगता हूँ।",
          "reference": "Abû Dâwud [4020] and At-Tirmidhî [1767] and Al-Baghawî. The wording is from Abû Dâwud. Also see Mukhtaŝar Shama'il At-Tirmidhî by Al-Albânî (p. 47)."
        }
      ]
    },
    {
      "group_id": 4,
      "title": "किसी को नया कपड़ा पहनते समय शुभकामना देना",
      "duas": [
        {
          "id": 7,
          "group_id": 4,
          "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
          "translation": "तुम इसे पहनकर पुराना करो और अल्लाह तुम्हें इसका बदला और अच्छा प्रदान करे।",
          "reference": "Abû Dâwud [4020](4/41). Also see Ŝaĥiĥ Abû Dâwud (2/760)."
        },
        {
          "id": 8,
          "group_id": 4,
          "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
          "translation": "नया पहनें, नेक जिंदगी जिएं और शहीद की मौत मरें।",
          "reference": "Ibn Mâjah [3558](2/1178) and Al-Baghawî (12/41). Also see Ŝaĥiĥ Ibn Mâjah (2/275)."
        }
      ]
    },
    {
      "group_id": 5,
      "title": "कपड़े उतारते समय",
      "duas": [
        {
          "id": 9,
          "group_id": 5,
          "dua": "بِسْمِ اللهِ",
          "translation": "अल्लाह के नाम से।",
          "reference": "At-Tirmidhî [606](2/505) and Sahîh Al-Jâmi' [3210](3/203). Also see Irwâ'-ul-Ghalîl [50]."
        }
      ]
    },
    {
      "group_id": 6,
      "title": "शौचालय में प्रवेश से पहले",
      "duas": [
        {
          "id": 10,
          "group_id": 6,
          "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
          "translation": "(अल्लाह के नाम से) हे अल्लाह, मैं तुझसे बुराई और बुरे जीवों से पनाह मांगता हूँ।",
          "reference": "Al-Bukhârî [142](1/45) and Muslim [375](1/283). The narration with the extension \"In the name of Allah\" has been collected by Sa'eed bin Manŝoor, see Fatĥ al-Bârî (1/244)."
        }
      ]
    },
    {
      "group_id": 7,
      "title": "शौचालय से बाहर आते समय",
      "duas": [
        {
          "id": 11,
          "group_id": 7,
          "dua": "غُفْرَانَكَ",
          "translation": "मैं तुझसे माफी मांगता हूँ।",
          "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
        }
      ]
    },
    {
      "group_id": 10,
      "title": "घर में प्रवेश करते समय",
      "duas": [
        {
          "id": 16,
          "group_id": 10,
          "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
          "translation": "अल्लाह के नाम से, मैंने अल्लाह पर भरोसा किया, और अल्लाह के सिवा कोई ताक़त और शक्ति नहीं है।",
          "reference": "Abû Dâwud [5094](4/325) and At-Tirmidhî [3427](5/490). Also see Ŝaĥiĥ At-Tirmidhî (3/151)."
        },
        {
          "id": 17,
          "group_id": 10,
          "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
          "translation": "हे अल्लाह, मैं तुझसे पनाह मांगता हूँ कि कहीं मैं पथभ्रष्ट न हो जाऊं या गुमराह करूं, या फिसलूं या मुझे फिसलाया जाए, या मैं अत्याचार करूं या मुझ पर अत्याचार किया जाए, या मैं मूर्खता करूं या मुझसे मूर्खता की जाए।",
          "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) and Ibn Mâjah [3884]. Also see Ŝaĥiĥ At-Tirmidhî (3/152) and Ŝaĥiĥ Ibn Mâjah (2/336)."
        }
      ]
    },
    {
      "group_id": 11,
      "title": "घर से बाहर निकलते समय",
      "duas": [
        {
          "id": 18,
          "group_id": 11,
          "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
          "translation": "अल्लाह के नाम से हम प्रवेश करते हैं और अल्लाह के नाम से हम निकलते हैं, और हमने अपने रब पर भरोसा किया।",
          "reference": "Abû Dâwud [5096](4/325) and Shaykh Abdul 'Azîz bin Bâz graded its chain ĥasan in [Tuĥfat al-Akhyâr](28)."
        }
      ]
    },
    {
      "group_id": 45,
      "title": "शैतान और उसके वसवसों को दूर करने के लिए",
      "duas": [
        {
          "id": 141,
          "group_id": 45,
          "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
          "translation": "अल्लाह से उसकी शरण मांगें।",
          "reference": "Abû Dâwud (1/206) and At-Tirmidhî. Also see Ŝaĥîĥ At-Tirmidhî (1/77)."
        },
        {
          "id": 142,
          "group_id": 45,
          "dua": "الأذَانُ",
          "translation": "अज़ान देना।",
          "reference": "Al-Bukhârî [608](1/151) and Muslim [389](1/291)."
        },
        {
          "id": 143,
          "group_id": 45,
          "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
          "translation": "अल्लाह की याद और क़ुरआन की तिलावत।",
          "reference": "Muslim [780](1/539)."
        }
      ]
    },
    {
      "group_id": 79,
      "title": "नवविवाहित को दुआ",
      "duas": [
        {
          "id": 190,
          "group_id": 79,
          "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
          "translation": "अल्लाह तुम्हारे लिए और तुम पर बरकतें नाज़िल करे और तुम दोनों को भलाई में मिलाए।",
          "reference": "Abû Dâwud [2130], At-Tirmidhî [1091], and Ibn Mâjah [1905]. Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
        }
      ]
    },
    {
      "group_id": 81,
      "title": "शादीशुदा जीवन में संभोग से पहले",
      "duas": [
        {
          "id": 192,
          "group_id": 81,
          "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
          "translation": "अल्लाह के नाम से। हे अल्लाह, शैतान को हमसे और उस चीज़ से दूर रख जो तू हमें प्रदान करेगा।",
          "reference": "Al-Bukhârî [3271](6/141) and Muslim [1434](2/1028)."
        }
      ]
    },
    {
      "group_id": 125,
      "title": "अपनी नज़र से किसी चीज़ या व्यक्ति को बुरी नज़र से बचाने के लिए",
      "duas": [
        {
          "id": 244,
          "group_id": 125,
          "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
          "translation": "अगर तुम्हें अपने भाई, अपने या अपने माल में कुछ अच्छा लगे, तो उसके लिए बरकत की दुआ मांगें, क्योंकि बुरी नज़र हक़ है।",
          "reference": "Aĥmad (4/447), Ibn Mâjah [3509] and Mâlik [1697-1698]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [556](1/212). Also see research of Zâd al-Ma'âd by Al-Arnâ'ûť."
        }
      ]
    },
    {
      "group_id": 128,
      "title": "धूर्त शैतानों की चालों से बचाव",
      "duas": [
        {
          "id": 247,
          "group_id": 128,
          "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
          "translation": "मैं अल्लाह के मुकम्मल शब्दों के द्वारा पनाह मांगता हूँ, जिन्हें कोई नेक या बदमाश पार नहीं कर सकता, उसकी सारी बुरी चीज़ों से जो उसने पैदा की हैं, बनाई हैं, और बुरी चीज़ों से जो आसमान से उतरती हैं, और जो उसमें चढ़ती हैं। बुराई से जो धरती में फैली है और जो उससे बाहर आती है, और रात और दिन की फ़ितनों की बुराई से, और रात के आने वाले हर व्यक्ति की बुराई से सिवाय उस व्यक्ति के जो भलाई लेकर आता है। हे रहमान।",
          "reference": "Aĥmad (3/419) with a Ŝaĥîĥ chain, Ibn As-Sunnî [637]. Al-Arnâ'ûť declared its chain Ŝaĥîĥ in his research of Ať-Ťaĥawiyyah (pg. 133). Also see Majma' Az-Zawâ'id (10/127)."
        }
      ]
    },
    {
      "group_id": 132,
      "title": "सामान्य और लाभदायक नियम",
      "duas": [
        {
          "id": 267,
          "group_id": 132,
          "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
          "translation": "जब रात गहरी हो जाए – या तुम शाम कर लो – तो अपने बच्चों को बाहर जाने से रोकें, क्योंकि उस समय शैतान फैल जाते हैं। जब रात का कुछ समय बीत जाए तो उन्हें छोड़ दें। अपने दरवाजों को बंद करें और अल्लाह का नाम लें, क्योंकि शैतान बंद दरवाजे को नहीं खोलता है। अपने पानी के बर्तन बांधें और अल्लाह का नाम लें। अपने बर्तनों को ढकें और अल्लाह का नाम लें, और अगर कुछ डाल सकते हो तो डालो, और अपनी बत्तियाँ बुझा दो।",
          "reference": "Al-Bukhârî [5623](10/88) and Muslim [2012](3/1595)."
        }
      ]
    }
  ]
},
  {
    "category_id": 10,
    "title": "भोजन और पेय",
    "group": [
      {
        "group_id": 68,
        "title": "रोज़ा खोलते समय",
        "duas": [
          {
            "id": 176,
            "group_id": 68,
            "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
            "translation": "प्यास बुझ गई है, नसों में ताजगी आ गई है, और इनाम सुनिश्चित हो गया है, अगर अल्लाह चाहे।",
            "reference": "Abû Dâwud [2357](2/306). Also see Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
          },
          {
            "id": 177,
            "group_id": 68,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
            "translation": "हे अल्लाह, मैं आपसे आपकी उस दया के द्वारा मांगता हूँ जो हर चीज़ पर हावी है, कि आप मुझे माफ कर दें।",
            "reference": "Ibn Mâjah [1753](1/557) and Al-Hâfiž declared it Ĥasan in this takhrîj of Al-Athkâr. Also see Sharĥ Al-Athkâr (4/342)."
          }
        ]
      },
      {
        "group_id": 69,
        "title": "खाने से पहले",
        "duas": [
          {
            "id": 178,
            "group_id": 69,
            "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
            "translation": "अल्लाह के नाम से (शुरुआत और अंत में)*।",
            "reference": "* अगर खाने से पहले दुआ पढ़ना भूल जाएं और खाते समय याद आए तो यह शब्द कहे जाएं।Abû Dâwud [3767](3/347) and At-Tirmidhî [1858](4/288). Also see Ŝaĥîĥ At-Tirmidhî (2/167)."
          },
          {
            "id": 179,
            "group_id": 69,
            "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
            "translation": "(1) 'हे अल्लाह, इसे हमारे लिए बरकत वाला बना और हमें इससे बेहतर भोजन दे।'अगर किसी को दूध दिया जाए तो निम्नलिखित पढ़ें:(2) 'हे अल्लाह, इसे हमारे लिए बरकत वाला बना और हमें इससे अधिक प्रदान कर।'",
            "reference": "Abû Dâwud [3767] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî declared it weak, see Al-Kalam Ať-Ťayyib [184]."
          }
        ]
      },
      {
        "group_id": 70,
        "title": "खाना समाप्त होने पर",
        "duas": [
          {
            "id": 180,
            "group_id": 70,
            "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
            "translation": "सभी तारीफें अल्लाह के लिए हैं, जिसने मुझे यह भोजन प्रदान किया और बिना किसी मेरी ताकत या शक्ति के मुझे इसे प्रदान किया।",
            "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] and Ibn Mâjah [3285]. Also see Ŝaĥîĥ At-Tirmidhî (3/159)."
          },
          {
            "id": 181,
            "group_id": 70,
            "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
            "translation": "अल्लाह की तारीफें हों, जो भरपूर, सुन्दर और बरकत से भरी हों, कभी न समाप्त होने वाली तारीफें, जिन्हें हम कभी विदा नहीं करेंगे, और जिनसे हम कभी बेपरवाह नहीं होंगे, वह हमारे रब हैं।",
            "reference": "Al-Bukhârî [5458](6/214) and At-Tirmidhî [3456](5/507) and the wording is his."
          }
        ]
      },
      {
        "group_id": 71,
        "title": "मेज़बान के लिए मेहमान की दुआ",
        "duas": [
          {
            "id": 182,
            "group_id": 71,
            "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
            "translation": "हे अल्लाह, जो आपने उन्हें प्रदान किया है उसमें बरकत दे, उन्हें माफ कर दे और उन पर दया कर।",
            "reference": "Muslim [2042](3/1615)."
          }
        ]
      },
      {
        "group_id": 72,
        "title": "जो व्यक्ति पेय प्रस्तुत करता है या इसका इरादा करता है",
        "duas": [
          {
            "id": 183,
            "group_id": 72,
            "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
            "translation": "हे अल्लाह, उसे भोजन प्रदान कर जिसने मुझे भोजन दिया, और उसे पेय प्रदान कर जिसने मुझे पेय प्रदान किया।",
            "reference": "Muslim [2055](3/1626)."
          }
        ]
      },
      {
        "group_id": 73,
        "title": "किसी के घर में रोज़ा खोलते समय",
        "duas": [
          {
            "id": 184,
            "group_id": 73,
            "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
            "translation": "आपके घर में रोज़ा खोलने वाले रोज़ादार हों, आपके भोजन को नेक और धर्मपरायण लोग खाएं, और फ़रिश्ते आप पर दुआएं भेजें।",
            "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/730)."
          }
        ]
      },
      {
        "group_id": 74,
        "title": "वह व्यक्ति जो रोज़ा रखे हुए है और उसे भोजन प्रस्तुत किया जाता है, परन्तु वह रोज़ा नहीं तोड़ता",
        "duas": [
          {
            "id": 185,
            "group_id": 74,
            "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
            "translation": "अगर आप में से किसी को निमंत्रण दिया जाए (भोजन के लिए) तो उसे स्वीकार करें। अगर आप रोज़े में हैं, तो उनके लिए दुआ करें (जो उपस्थित हैं) और अगर आप रोज़े में नहीं हैं, तो भोजन करें। (यहां 'दुआ' का अर्थ 'प्रार्थना' है)।",
            "reference": "Muslim [1431](2/1054)."
          }
        ]
      }
    ]
  },
  {
      "category_id": 11,
      "title": "बीमारी और मौत",
      "group": [
          {
              "group_id": 48,
              "title": "बच्चों को अल्लाह की हिफाज़त में रखना",
              "duas": [
                  {
                      "id": 146,
                      "group_id": 48,
                      "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
                      "translation": "मैं तुम्हें अल्लाह के मुकम्मल कलिमात की हिफाज़त में सौंपता हूँ, हर शैतान, ज़हरीले कीड़े और हर बुरी नज़र से।",
                      "reference": "Al-Bukhârî [3371](4/119)."
                  }
              ]
          },
          {
              "group_id": 49,
              "title": "बीमार की ज़ियारत करते समय",
              "duas": [
                  {
                      "id": 147,
                      "group_id": 49,
                      "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
                      "translation": "कोई हर्ज नहीं, अल्लाह चाहे तो यह बीमारी तुझे पाक कर दे।",
                      "reference": "Al-Bukhârî [3616](10/118)."
                  },
                  {
                      "id": 148,
                      "group_id": 49,
                      "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
                      "translation": "मैं अल्लाह, जो बहुत बड़ा है और जो अर्श का मालिक है, से तुझे शिफ़ा देने की दुआ करता हूँ। (सात बार)",
                      "reference": "At-Tirmidhî [2083] and Abû Dâwud [3106]. Also see Ŝaĥîĥ At-Tirmidhî (2/210) and Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
                  }
              ]
          },
          {
              "group_id": 50,
              "title": "बीमार की ज़ियारत का फ़ज़ीलत",
              "duas": [
                  {
                      "id": 149,
                      "group_id": 50,
                      "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
                      "translation": "जब कोई आदमी अपने मुस्लिम भाई की बीमार-पुर्सी करता है, तो वह जन्नत के फलों को काटता हुआ चलता है जब तक कि वह बैठ न जाए, और जब वह बैठता है तो उस पर रहमत की बारिश होती है, और अगर यह सुबह हुआ तो सत्तर हज़ार फरिश्ते शाम तक उस पर दुरूद भेजते हैं, और अगर यह शाम को हुआ तो सत्तर हज़ार फरिश्ते सुबह तक उस पर दुरूद भेजते हैं।",
                      "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] and Aĥmad (1/97). Also see Ŝaĥîĥ Ibn Mâjah (1/244) and Ŝaĥîĥ At-Tirmidhî (1/286). Shaykh Aĥmad Shâkir also authenticated it."
                  }
              ]
          },
          {
              "group_id": 51,
              "title": "जब बीमार मौत की उम्मीद छोड़ दे",
              "duas": [
                  {
                      "id": 150,
                      "group_id": 51,
                      "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
                      "translation": "हे अल्लाह, मुझे माफ़ कर, मुझ पर रहम कर, और मुझे ऊँचे साथियों के साथ मिला दे।",
                      "reference": "Al-Bukhârî [4440](7/10) and Muslim [2444](4/1893)."
                  },
                  {
                      "id": 151,
                      "group_id": 51,
                      "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
                      "translation": "अल्लाह के सिवा कोई माबूद नहीं, यक़ीनन मौत में तकलीफें हैं।",
                      "reference": "Al-Bukhârî [4449](8/144)."
                  },
                  {
                      "id": 152,
                      "group_id": 51,
                      "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
                      "translation": "अल्लाह के सिवा कोई माबूद नहीं और अल्लाह सबसे बड़ा है। अल्लाह के सिवा कोई माबूद नहीं, अकेला है। अल्लाह के सिवा कोई माबूद नहीं, उसका कोई शरीक नहीं। अल्लाह के सिवा कोई माबूद नहीं, उसकी बादशाहत है और सारी तारीफें उसी के लिए हैं। अल्लाह के सिवा कोई माबूद नहीं, और अल्लाह की मदद के बिना कोई ताकत और क़ुव्वत नहीं।",
                      "reference": "At-Tirmidhî [3430] and Ibn Mâjah [3794]. Al-Albânî authenticated it. Also see Ŝaĥîĥ At-Tirmidhî (3/152) and Ŝaĥîĥ Ibn Mâjah (2/317)."
                  }
              ]
          },
          {
              "group_id": 52,
              "title": "मौत के क़रीब पहुँचने वाले के लिए हिदायत",
              "duas": [
                  {
                      "id": 153,
                      "group_id": 52,
                      "dua": "لَا إلَهَ إلَّا اللهُ",
                      "translation": "जिसकी आखिरी बात 'अल्लाह के सिवा कोई माबूद नहीं' होगी, वह जन्नत में दाखिल होगा।",
                      "reference": "Abû Dâwud [3116](3/190). Also See Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
                  }
              ]
          },
          {
              "group_id": 54,
              "title": "मय्यत की आँखें बंद करते समय",
              "duas": [
                  {
                      "id": 155,
                      "group_id": 54,
                      "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
                      "translation": "हे अल्लाह, (मय्यत का नाम लें) को माफ़ कर और उसे हिदायत पाए हुए लोगों के साथ ऊँचा मक़ाम दे, और उसके पीछे छोड़े हुए लोगों में तू उसका वारिस हो, और हम सभी को और उसे माफ़ कर, ऐ दुनियाओं के रब, उसकी क़ब्र को वसी कर और उसे उसमें रौशनी दे।",
                      "reference": "Muslim [920](2/634)."
                  }
              ]
          },
          {
              "group_id": 55,
              "title": "जनाज़े की नमाज़ में मय्यत के लिए दुआ",
              "duas": [
                  {
                      "id": 156,
                      "group_id": 55,
                      "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
                      "translation": "हे अल्लाह, उसे माफ़ कर और उस पर रहमत कर, उसे पाक-साफ़ कर और उसे बख्श दे, उसकी मेहमाननवाज़ी को सम्मानित कर, उसकी क़ब्र को वसी कर, और उसे पानी, बर्फ और ओलों से धोकर पाक कर दे, जैसे कि तूने सफ़ेद कपड़े को गंदगी से पाक किया हो, और उसके घर को उसके घर से बेहतर बना, और उसके अहल-ओ-अयाल को उसके अहल-ओ-अयाल से बेहतर बना, और उसकी बीवी को उसकी बीवी से बेहतर बना, उसे जन्नत में दाखिल कर, और उसे क़ब्र के अज़ाब से बचा (और आग के अज़ाब से भी)।",
                      "reference": "Muslim [963](2/663)."
                  },
                  {
                      "id": 157,
                      "group_id": 55,
                      "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
                      "translation": "हे अल्लाह, हमारे जिन्दा और हमारे मय्यत, हमारे मौजूद और हमारे ग़ैर-मौजूद, हमारे छोटे और हमारे बड़े, हमारे मर्द और हमारी औरतों को माफ़ कर। हे अल्लाह, जिसे तू हमारे बीच से जिन्दा रखे, उसे इस्लाम पर जिन्दा रख, और जिसे तू मौत दे, उसे ईमान पर मौत दे। हे अल्लाह, हमें उसके सवाब से महरूम न कर और उसके बाद हमें गुमराह न कर।",
                      "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] and Aĥmad (2/368). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
                  },
                  {
                      "id": 158,
                      "group_id": 55,
                      "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
                      "translation": "हे अल्लाह, फलां बिन फलां तेरी ज़िम्मेदारी में है और तेरी पनाह में है, तो उसे क़ब्र के फ़ितने और आग के अज़ाब से बचा, और तू वफ़ा और सच्चाई वाला है, तो उसे माफ़ कर, और उस पर रहम कर, यक़ीनन तू बड़ा माफ़ करने वाला और रहम करने वाला है।",
                      "reference": "Ibn Mâjah [1499] and Abû Dâwud (3/211). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
                  },
                  {
                      "id": 159,
                      "group_id": 55,
                      "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
                      "translation": "हे अल्लाह, तेरा बंदा और तेरी बंदी का बेटा तेरी रहमत का मुहताज है, और तू उसके अज़ाब से बेनियाज़ है। अगर वह नेकी करने वाला था तो उसकी नेकीयों में इज़ाफ़ा कर, और अगर वह गुनहगार था तो उसके गुनाहों को माफ़ कर।",
                      "reference": "Al-Hâkim (1/359 )and he authenticated it and Adh-Dhahabî agreed with him. Also see Aĥkâm Al-Janâ'iz by Al-Albânî (pg. 125)."
                  }
              ]
          },
          {
              "group_id": 56,
              "title": "जब मय्यत बच्चा हो, जनाज़े की नमाज़ में",
              "duas": [
                  {
                      "id": 160,
                      "group_id": 56,
                      "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
                      "translation": "हे अल्लाह, उसे उसके माँ-बाप के लिए एक पेश-राह और एक खज़ाना बना दे, और एक मक़बूल सिफ़ारिशी बना दे। हे अल्लाह, उसके जरिए उनके तराज़ू को भारी कर दे और उनके सवाब को बढ़ा दे। उसे नेक मोमिनों से मिला दे और उसे इब्राहीम की हिफाज़त में रख और अपनी रहमत से उसे जहन्नम के अज़ाब से बचा। उसे उसके घर से बेहतर घर दे और उसके अहल-ए-ख़ानदान से बेहतर अहल दे। हे अल्लाह, हमारे पहले गुज़र चुके, हमारे नाबालिग और हमसे पहले ईमान लाने वालों को माफ़ कर।",
                      "reference": "See Al-Mughnî by Ibn Qudâmah (3/416) and Ad-Durûs  Al-Muhimmah Li'âmah Al-Ummah by Shaykh Ibn Bâz (pg. 15)."
                  },
                  {
                      "id": 161,
                      "group_id": 56,
                      "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
                      "translation": "हे अल्लाह, उसे हमारे लिए एक पेश-राह, एक पायनियर और सवाब बना दे।",
                      "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
                  }
              ]
          },
          {
              "group_id": 57,
              "title": "ताज़ियत",
              "duas": [
                  {
                      "id": 162,
                      "group_id": 57,
                      "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
                      "translation": "बेशक अल्लाह ही का है जो उसने लिया और उसी का है जो उसने दिया, और उसके पास हर चीज़ का एक मुक़र्रर वक्त है, तो सब्र कर और बदला अल्लाह से मांग।",
                      "reference": "Al-Bukhârî [1284](2/80) and Muslim [923](2/636)."
                  }
              ]
          },
          {
              "group_id": 58,
              "title": "मय्यत को क़ब्र में रखते समय",
              "duas": [
                  {
                      "id": 163,
                      "group_id": 58,
                      "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
                      "translation": "अल्लाह के नाम से और अल्लाह के रसूल की सुन्नत पर।",
                      "reference": "Abû Dâwud [3213](3/314) with a Ŝaĥîĥ chain and Aĥmad (2/40) with the phrase: (بسم الله و على ملة رسول الله) and its chain is Ŝaĥîĥ."
                  }
              ]
          },
          {
              "group_id": 59,
              "title": "दफ़्न करने के बाद",
              "duas": [
                  {
                      "id": 164,
                      "group_id": 59,
                      "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
                      "translation": "हे अल्लाह, उसे माफ़ कर, हे अल्लाह, उसे साबित क़दम बना।",
                      "reference": "Abû Dâwud [3221](3/315) and Al-Hâkim (1/370) and he authenticated it and Adh-Dhahabî agreed with him."
                  }
              ]
          },
          {
              "group_id": 60,
              "title": "क़ब्रों की ज़ियारत करते समय",
              "duas": [
                  {
                      "id": 165,
                      "group_id": 60,
                      "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
                      "translation": "तुम पर सलाम हो, ऐ क़ब्रों के बाशिंदों, मोमिनों और मुस्लिमों में से, और यक़ीनन हम भी, अगर अल्लाह ने चाहा, तुमसे आ मिलेंगे। [अल्लाह रहम करे हमसे पहले गुज़र चुके और बाद में आने वालों पर] हम तुम्हारे लिए और अपने लिए अल्लाह से सलामती की दुआ करते हैं।",
                      "reference": "Muslim [975](2/671) and Ibn Mâjah [1547](1/494) and the wording is his. What is between the brackets is from the hadith of 'Â'ishah collected by Muslim [974](2/671)."
                  }
              ]
          },
          {
              "group_id": 124,
              "title": "शरीर में दर्द महसूस होने पर",
              "duas": [
                  {
                      "id": 243,
                      "group_id": 124,
                      "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
                      "translation": "अल्लाह के नाम से (तीन बार) पढ़े और उसके बाद यह पढ़े: 'मैं अल्लाह और उसकी ताक़त की पनाह में आता हूँ, उस बुराई से जिससे मैं डरता हूँ और जिसका सामना कर रहा हूँ।' (सात बार)।",
                      "reference": "Muslim [2202](4/1728)."
                  }
              ]
          }
      ]
  }
]