[
  {
   "category_id": 1,
   "title": "Утро и вечер",
   "group": [
      {
         "group_id": 1,
         "title": "Когда просыпаешься",
         "duas": [
            {
               "id": 1,
               "group_id": 1,
               "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
               "translation": "Хвала Аллаху, который оживил нас после того, как умертвил нас, и к Нему возвращение.",
               "reference": "Al-Bukhârî [6312], see Fatĥ al-Bârî (11/113) and Muslim [2711](4/2083)."
            },
            {
               "id": 2,
               "group_id": 1,
               "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
               "translation": "Нет никого достойного поклонения, кроме Аллаха, одного, без сотоварища. Ему принадлежит вся власть, и Ему вся хвала, и Он способен на всё. Пречист Аллах, хвала Аллаху, нет никого достойного поклонения, кроме Аллаха, и Аллах велик. Нет силы и могущества, кроме как с дозволения Аллаха, Высочайшего, Великого. О Господь, прости меня. (Кто скажет это, тому будет прощено, и если он помолится Аллаху, его молитва будет принята; если он совершит омовение и помолится, его молитва будет принята).",
               "reference": "Al-Bukhârî [1154], see Fatĥ al-Bârî (3/39) and the wording is of Ibn Mâjah (2/335), also see Ŝaĥiĥ Ibn Mâjah (2/335)."
            },
            {
               "id": 3,
               "group_id": 1,
               "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
               "translation": "Хвала Аллаху, который даровал силу моему телу, вернул мне душу и позволил мне вспомнить о Нем.",
               "reference": "At-Tirmidhî [3401](5/473), also see Ŝaĥiĥ At-Tirmidhî (3/144)."
            },
            {
               "id": 4,
               "group_id": 1,
               "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
               "translation": "Читайте суру Аль-Имран [3:190-200].",
               "reference": "Al-Bukhârî [4572], see Fatĥ al-Bârî (8/237) and Muslim [763](1/530)."
            }
         ]
      },
      {
         "group_id": 27,
         "title": "Утром и вечером",
         "duas": [
            {
               "id": 75,
               "group_id": 27,
               "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
               "translation": "Кто прочитает этот (Аят аль-Курси) утром, будет защищен от джиннов до вечера, а кто прочитает его вечером, будет защищен от них до утра.",
               "reference": "Al-Hâkim (1/562) and Al-Albânî authenticated it in Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) and he attributed it to An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] and Ťabarânî [Al-Kabîr][541] and said that the latter's chain is good."
            },
            {
               "id": 76,
               "group_id": 27,
               "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
               "translation": "Прочитайте:1. Сура Ихлас (Коран: 112)2. Сура Аль-Фаляк (Коран: 113)3. Сура Ан-Нас (Коран: 114)[3 раза]",
               "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Also see Ŝaĥîĥ At-Tirmidhî (3/182)."
            },
            {
               "id": 77,
               "group_id": 27,
               "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
               "translation": "'Мы вступили в утро, и с ним все владение принадлежит Аллаху. Хвала Аллаху. Нет никого достойного поклонения, кроме Аллаха, одного, без сотоварища. Ему принадлежит вся власть, и Ему вся хвала, и Он способен на всё. О Господь, я прошу у Тебя блага этого дня и последующих за ним дней, и прибегаю к Тебе от зла этого дня и последующих за ним дней. О Господь, я прибегаю к Тебе от лени и старости. О Господь, я прибегаю к Тебе от наказания в аду и наказания в могиле.'Ночью читайте вместо этого:'Мы вступили в вечер, и с ним вся власть принадлежит Аллаху...'и:'...О Господь, я прошу у Тебя блага этой ночи и последующих за ней ночей, и прибегаю к Тебе от зла этой ночи и последующих за ней ночей...'",
               "reference": "Muslim [2723](4/2088)."
            },
            {
               "id": 78,
               "group_id": 27,
               "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
               "translation": "'О Аллах, с Твоего дозволения мы достигли утра, и с Твоего дозволения мы достигли вечера, с Твоего дозволения мы живём и умираем, и к Тебе наше воскрешение.'Ночью читайте вместо этого:'О Аллах, с Твоего дозволения мы достигли вечера, и с Твоего дозволения мы достигли утра, с Твоего дозволения мы живём и умираем, и к Тебе наше возвращение.'",
               "reference": "At-Tirmidhî [3391](5/466). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
               "id": 79,
               "group_id": 27,
               "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
               "translation": "О Аллах, Ты мой Господь, нет никого достойного поклонения, кроме Тебя. Ты создал меня, и я Твой раб. Я стараюсь соблюдать заветы и обещания Твои. Я прибегаю к Тебе от зла, которое сотворил. Я признаю Твои милости ко мне и признаю свои грехи, поэтому прости меня, ибо только Ты прощаешь грехи.",
               "reference": "Al-Bukhârî [6306](7/150)."
            },
            {
               "id": 80,
               "group_id": 27,
               "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
               "translation": "О Аллах, поистине я встретил утро и призываю Тебя, носителей Твоего трона, Твоих ангелов и всё Твоё творение быть свидетелями того, что Ты — Аллах, нет никого достойного поклонения, кроме Тебя, одного, без сотоварища, и что Мухаммад — Твой раб и посланник. [Четыре раза]",
               "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] and Ibn As-Sunnî [70]. Shaykh Ibn Bâz declared the chain of An-Nisâ'i and Abû Dâwud, Hasan in [Tuĥfat Al-Akhyâr][pg. 23]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [25]."
            },
            {
               "id": 81,
               "group_id": 27,
               "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
               "translation": "О Аллах, какое бы благословение я или кто-либо из Твоих творений ни получили, оно исходит только от Тебя, без сотоварища, поэтому Тебе вся хвала и благодарность.",
               "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Shaykh Ibn Bâz declared its chain Ĥasan in [Tuĥfat Al-Akhyâr][pg. 24]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [26]."
            },
            {
               "id": 82,
               "group_id": 27,
               "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
               "translation": "О Аллах, даруй здоровье моему телу, о Аллах, даруй здоровье моему слуху, о Аллах, даруй здоровье моему зрению. Нет никого достойного поклонения, кроме Тебя. О Аллах, я прибегаю к Тебе от неверия и нищеты, и я прибегаю к Тебе от наказания могилы; нет никого достойного поклонения, кроме Тебя. [Три раза]",
               "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 26]. Al-Albânî declared it weak. See Ďa'îf Al-J Al-Jâmi' [1210]."
            },
            {
               "id": 83,
               "group_id": 27,
               "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
               "translation": "Аллах для меня достаточен, нет никого достойного поклонения, кроме Него, на Него я уповаю, и Он — Господь Великого трона. [Семь раз]",
               "reference": "Ibn As-Sunnî [71][Marfû'] and Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic. Also see Zâd al-Ma'âd (2/376). Al-Albânî declared it weak. See Ďa'îf Abî Dâwud."
            },
            {
               "id": 84,
               "group_id": 27,
               "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
               "translation": "О Аллах, я прошу у Тебя прощения и благополучия в этой жизни и в следующей. О Аллах, я прошу у Тебя прощения и благополучия в моей религии и в моих мирских делах, в моей семье и в моем имуществе. О Аллах, укрой мои слабости и успокой мои страхи. О Аллах, защити меня спереди, сзади, справа и слева и сверху, и я прибегаю к Твоему величию, чтобы не быть поглощенным землей.",
               "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Also see Ŝaĥîĥ Ibn Mâjah (2/332)."
            },
            {
               "id": 85,
               "group_id": 27,
               "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
               "translation": "О Аллах, знающий сокровенное и явное, Творец небес и земли, Господь и Властелин всего сущего, свидетельствую, что нет никого достойного поклонения, кроме Тебя. Прибегаю к Тебе от зла своей души, от зла и ширка шайтана, и от совершения зла в отношении себя или другого мусульманина.",
               "reference": "At-Tirmidhî [3392] and Abû Dâwud [5067]. Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
               "id": 86,
               "group_id": 27,
               "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
               "translation": "Во имя Аллаха, с чьим именем ничто не причиняет вреда ни на земле, ни на небесах, и Он — Всеслышащий, Всезнающий. [Три раза]",
               "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Also see Ŝaĥîĥ Ibn Mâjah (2/332). Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 39]."
            },
            {
               "id": 87,
               "group_id": 27,
               "dua": " رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
               "translation": "Я доволен Аллахом как Господом, исламом как религией и Мухаммадом как пророком. [Три раза]",
               "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) and At-Tirmidhî [3389](5/465). Shaykh Ibn Bâz declared it Ĥasan in [Tuĥfat Al-Akhyâr][39]."
            },
            {
               "id": 88,
               "group_id": 27,
               "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
               "translation": "О Живой, о Самосущий и Поддерживающий всё, по Твоей милости я прошу помощи, исправь для меня все мои дела и не оставляй меня на самого себя даже на мгновение.",
               "reference": "Al-Hâkim (1/545); he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
            },
            {
               "id": 89,
               "group_id": 27,
               "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
               "translation": "'Мы встретили утро, и в этот момент вся власть принадлежит Аллаху, Господу миров. О Аллах, прошу у Тебя блага этого дня, его успехов и побед, его света, его благословений и его руководства, и прибегаю к Тебе от зла этого дня и зла, которое последует за ним.'Ночью читайте вместо этого: 'Мы встретили вечер, и в этот момент вся власть принадлежит Аллаху, Господу миров. О Аллах, прошу у Тебя блага этой ночи, её успехов и побед, её света, её благословений и её руководства, и прибегаю к Тебе от зла этой ночи и зла, которое последует за ней.'",
               "reference": "Abû Dâwud [5084](4/322), Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared its chain Ĥasan in their research of Zâd al-Ma'âd (2/273)."
            },
            {
               "id": 90,
               "group_id": 27,
               "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
               "translation": "Мы встали на фитре ислама, на слове чистой веры, на религии нашего пророка Мухаммада и религии нашего отца Ибрахима, который был мусульманином и правоверным и не был из числа многобожников.",
               "reference": "Aĥmad (3/406,407) and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Also see Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
            },
            {
               "id": 91,
               "group_id": 27,
               "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
               "translation": "Пречист Аллах и хвала Ему. [Сто раз]",
               "reference": "Muslim [2723](4/2071)."
            },
            {
               "id": 92,
               "group_id": 27,
               "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
               "translation": "Нет никого достойного поклонения, кроме Аллаха, одного, без сотоварища, Ему принадлежит вся власть и Ему вся хвала, и Он способен на всё. [Десять раз] или [Один раз].",
               "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] from the ĥadîth of Abu Ayûb Al-Anŝârî  (May Allah be pleased with him). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb [650](1/272) and Tuĥfat Al-Akhyâr (pg. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] and Aĥmad (4/60). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb (1/270), Ŝaĥîĥ Abî  Dâwud  (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) and Zâd Al-Ma'âd (2/377)."
            },
            {
               "id": 93,
               "group_id": 27,
               "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
               "translation": "Нет никого достойного поклонения, кроме Аллаха, одного, без сотоварища, Ему принадлежит вся власть и Ему вся хвала, и Он способен на всё. [Сто раз утром]",
               "reference": "Al-Bukhârî [3293](4/95) and Muslim [2691](4/2071)."
            },
            {
               "id": 94,
               "group_id": 27,
               "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
               "translation": "Пречист Аллах, и хвала Ему, числом Его творений, Его довольством, весом Его трона и чернилами Его слов. [Три раза утром]",
               "reference": "Muslim [2726](4/2090)."
            },
            {
               "id": 95,
               "group_id": 27,
               "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
               "translation": "О Аллах, прошу у Тебя полезных знаний, чистого пропитания и деяний, которые будут приняты. [Утром]",
               "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] and Ibn Mâjah [925]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic in their research of Zâd al-Ma'âd (2/375)."
            },
            {
               "id": 96,
               "group_id": 27,
               "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
               "translation": "Прошу прощения у Аллаха и обращаюсь к Нему с покаянием. [Сто раз в день]",
               "reference": "Al-Bukhârî [6307](11/101) and Muslim [2702](4/2075)."
            },
            {
               "id": 97,
               "group_id": 27,
               "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
               "translation": "Прибегаю к совершенным словам Аллаха от зла того, что Он сотворил. [Три раза вечером]",
               "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Also see Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) and Tuĥfat Al-Akhyâr (p. 45)"
            },
            {
               "id": 98,
               "group_id": 27,
               "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
               "translation": "О Аллах, пошли молитвы и благословения на нашего пророка Мухаммада. [Десять раз]",
               "reference": "Ať-Ťabarânî through two chains, one of which is good. See Majm'u Az-Zawâ 'id (10/120) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
            }
         ]
      },
      {
         "group_id": 28,
         "title": "Перед сном",
         "duas": [
            {
               "id": 99,
               "group_id": 28,
               "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
               "translation": "Каждую ночь перед тем, как лечь спать, Пророк (мир ему и благословение Аллаха) собирал свои ладони, дул в них, читал последние три суры Корана, а затем проводил руками по всему телу, начиная с головы и лица и по всем частям тела; он делал это три раза.",
               "reference": "Al-Bukhârî [5017](9/62) and Muslim [2192](4/1723)."
            },
            {
               "id": 100,
               "group_id": 28,
               "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
               "translation": "Пророк (мир ему и благословение Аллаха) также сказал: 'Когда вы собираетесь спать, прочитайте Аят Аль-Курси, ибо над вами останется защита от Аллаха, и ни один шайтан не приблизится к вам до утра.'",
               "reference": "Al-Bukhârî [2311](4/487)."
            },
            {
               "id": 101,
               "group_id": 28,
               "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
               "translation": "Пророк (мир ему и благословение Аллаха) также сказал: 'Кто прочитает последние два аята суры Аль-Бакара ночью; этих двух аятов ему будет достаточно.'",
               "reference": "Al-Bukhârî [4008](9/94) and Muslim [808](1/554)."
            },
            {
               "id": 102,
               "group_id": 28,
               "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
               "translation": "Если кто-то встанет с постели, а затем снова ляжет, ему следует отряхнуть её краем своей одежды трижды, ибо он не знает, что произошло в его отсутствие, и когда он ложится, ему следует молиться: 'Во имя Твоё, мой Господь, я ложусь, и во имя Твоё я встаю. Если Ты возьмешь мою душу, то помилуй её, а если Ты вернешь её, то защити её так, как Ты защищаешь Своих праведных рабов.'",
               "reference": "Al-Bukhârî [6320](11/126) and Muslim [2714](4/2084)."
            },
            {
               "id": 103,
               "group_id": 28,
               "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
               "translation": "О Аллах, поистине Ты создал мою душу, и Ты заберешь её жизнь, Тебе принадлежит её жизнь и смерть. Если Ты сохранишь мою душу живой, то защити её, а если Ты заберешь её, то прости её. О Аллах, я прошу у Тебя благополучия.",
               "reference": "Muslim [2712](4/2083) and Aĥmad (2/79)."
            },
            {
               "id": 104,
               "group_id": 28,
               "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
               "translation": "О Аллах, защити меня от Твоего наказания в день, когда Ты воскресишь Своих рабов.",
               "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
            },
            {
               "id": 105,
               "group_id": 28,
               "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
               "translation": "Во имя Твоё, о Аллах, я живу и умираю.",
               "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
            },
            {
               "id": 106,
               "group_id": 28,
               "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
               "translation": "Пречист Аллах [Тридцать три раза].Хвала Аллаху [Тридцать три раза].Аллах велик [Тридцать четыре раза].",
               "reference": "Al-Bukhârî [3705](7/71) and Muslim [2727](4/2091)."
            },
            {
               "id": 107,
               "group_id": 28,
               "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
               "translation": "О Аллах, Господь семи небес и Великого трона, наш Господь и Господь всего сущего, Творец зерна и косточки, Ниспосылающий Тору, Евангелие и Книгу различения, прибегаю к Тебе от зла всего, что Ты держишь за челку. О Аллах, Ты — Первый, и до Тебя не было ничего, Ты — Последний, и после Тебя не будет ничего. Ты — Видимый, и над Тобой ничего нет, и Ты — Скрытый, и нет ничего ближе Тебя. Устрой наш долг и избавь нас от бедности.",
               "reference": "Muslim [2713](4/2084)."
            },
            {
               "id": 108,
               "group_id": 28,
               "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
               "translation": "Хвала Аллаху, который накормил нас и напоил, и который достаточен для нас и дал нам убежище, ведь сколько есть тех, кому не хватает пищи или крова.",
               "reference": "Muslim [2715](4/2085)."
            },
            {
               "id": 109,
               "group_id": 28,
               "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
               "translation": "О Аллах, Знающий скрытое и явное, Творец небес и земли, Господь и Властелин всего сущего, свидетельствую, что нет никого достойного поклонения, кроме Тебя. Прибегаю к Тебе от зла своей души, от зла и ширка шайтана, и от совершения зла в отношении себя или другого мусульманина.",
               "reference": "Abû Dâwud [5083](4/317). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
               "id": 110,
               "group_id": 28,
               "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
               "translation": "Читайте суру Ас-Саджда и суру Аль-Мульк.",
               "reference": "At-Tirmidhî [3404] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]. Also see Ŝaĥîĥ Al-Jâmi' [4873](4/255)."
            },
            {
               "id": 111,
               "group_id": 28,
               "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
               "translation": "О Аллах, я предал Тебе свою душу, я доверил Тебе своё дело, я обратил к Тебе своё лицо, и я полагаюсь на Тебя, в надежде и страхе перед Тобой. Поистине, нет убежища и спасения от Тебя, кроме как к Тебе. Я верю в Твою Книгу, которую Ты ниспослал, и в Твоего Пророка, которого Ты послал.",
               "reference": "Al-Bukhârî [6313,6315,7488](11/113) and Muslim [2710](4/2081)."
            }
         ]
      },
      {
         "group_id": 29,
         "title": "Когда переворачиваешься ночью",
         "duas": [
            {
               "id": 112,
               "group_id": 29,
               "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
               "translation": "Нет никого достойного поклонения, кроме Аллаха, Единственного, Всемогущего. Господь небес и земли и того, что между ними, Могущественный, Прощающий.",
               "reference": "Al-Hâkim (1/540) and he authenticated it and Adh-Dhahabî agreed with him, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757). Also see Ŝaĥîĥ Al-Jâmi' [4693](4/213)."
            }
         ]
      },
      {
         "group_id": 30,
         "title": "Если во время сна испытываешь беспокойство, страх или тревогу",
         "duas": [
            {
               "id": 113,
               "group_id": 30,
               "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
               "translation": "Прибегаю к совершенным словам Аллаха от Его гнева и наказания, от зла Его рабов, от искушений шайтанов и их появления.",
               "reference": "Abû Dâwud [3893](4/12). Also see Ŝaĥîĥ At-Tirmidhî (3/171)."
            }
         ]
      },
      {
         "group_id": 31,
         "title": "Когда видишь хороший или плохой сон",
         "duas": [
            {
               "id": 114,
               "group_id": 31,
               "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
               "translation": "Краткое изложение действий при плохом сне:(1) Трижды плюнь через левое плечо.(2) Прибегни к защите Аллаха от шайтана и зла увиденного трижды.(3) Не рассказывай сон никому.(4) Ляг на противоположную сторону.",
               "reference": "Al-Bukhârî [7044] and Muslim [2261](4/1772)."
            },
            {
               "id": 115,
               "group_id": 31,
               "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
               "translation": "Встань и помолись, если хочешь.",
               "reference": "Muslim [2263](4/1773)."
            }
         ]
      }
   ]
},
  {
    "category_id": 2,
    "title": "Молитва",
    "group": [
      {
        "group_id": 8,
        "title": "При начале омовения",
        "duas": [
          {
            "id": 12,
            "group_id": 8,
            "dua": "بِسْمِ اللهِ",
            "translation": "Во имя Аллаха.",
            "reference": "Abû Dâwud [101], Ibn Mâjah [399] and Aĥmad (2/418). Also see Irwâ'-ul-Ghalîl (1/122)."
          }
        ]
      },
      {
        "group_id": 9,
        "title": "По завершении омовения",
        "duas": [
          {
            "id": 13,
            "group_id": 9,
            "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
            "translation": "Свидетельствую, что нет никого достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварища, и свидетельствую, что Мухаммад – Его раб и посланник.",
            "reference": "Muslim [234](1/209)."
          },
          {
            "id": 14,
            "group_id": 9,
            "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
            "translation": "О Аллах, сделай меня из тех, кто часто возвращается к Тебе с покаянием, и из тех, кто остается чистым и непорочным.",
            "reference": "At-Tirmidhî [55](1/78). Also see Ŝaĥiĥ At-Tirmidhî (1/18)."
          },
          {
            "id": 15,
            "group_id": 9,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
            "translation": "Славен Ты, о Аллах, и хвала Тебе. Свидетельствую, что нет никого достойного поклонения, кроме Тебя. Прошу Твоего прощения и обращаюсь к Тебе с покаянием.",
            "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)."
          }
        ]
      },
      {
        "group_id": 12,
        "title": "Когда идешь в мечеть",
        "duas": [
          {
            "id": 19,
            "group_id": 12,
            "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
            "translation": "О Аллах, помести свет в мое сердце, и на мой язык свет, и в мои уши свет, и в мой взор свет, и надомной свет, и подо мной свет, и по правую сторону от меня свет, и по левую сторону от меня свет, и передо мной свет, и позади меня свет. Помести в мою душу свет. Увеличь для меня свет и усилий его. Сделай меня светом и дай мне свет, и помести свет в мои нервы, в мое тело, в мою кровь, в мои волосы и в мою кожу. [О Аллах, дай мне свет в моей могиле... и свет в моих костях]. [Увеличь для меня свет, увеличь для меня свет, увеличь для меня свет].",
            "reference": "(1) Al-Bukhârî [6316](11/116) and Muslim [763](1/526,529,530).(2) At-Tirmidhî [3419](5/483)."
          }
        ]
      },
      {
        "group_id": 13,
        "title": "При входе в мечеть",
        "duas": [
          {
            "id": 20,
            "group_id": 13,
            "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
            "translation": "(Войдите с правой ноги)(١), затем скажите: (Я прибегаю к защите Аллаха Великого, Его благородного Лица и Его вечной власти от проклятого дьявола.)(٢), (Во имя Аллаха, и молитвы)(٣)[и мир да будет с Посланником Аллаха](٤), (О Аллах, открой для меня врата Твоей милости)(٥)",
            "reference": "(1) Al-Hakim (1/218) and he authenticated it with the conditions of Muslim and Adh-Dhahabî agreed with him, Al-Baihaqî (2/442), and Al-Albânî  declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624).(2) Abû Dâwud [466]. Also see Ŝaĥiĥ Al-Jâmi' [4591].(3) An-Nisâ'i [88] and Al-Albânî declared it ĥasan.(4) Abû Dâwud [465](1/126). Also see Ŝaĥiĥ Al-Jâmi' [514](1/528).(5) Muslim [713](1/494), Ibn Mâjah [771] and Al-Albânî declared it ŝaĥiĥ due to its shawâhid; see Ŝaĥîĥ Ibn Mâjah (1/128-129)."
          }
        ]
      },
      {
        "group_id": 14,
        "title": "При выходе из мечети",
        "duas": [
          {
            "id": 21,
            "group_id": 14,
            "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢) ",
            "translation": "(Выйдите с левой ноги)(١), затем скажите: (Во имя Аллаха, и молитвы, и мир да будет с Посланником Аллаха. О Аллах, прошу Тебя о Твоем благословении. О Аллах, защити меня от проклятого дьявола)(٢)",
            "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) and Al-Albânî declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624)(2) See takhrîj of the previous hadith (du'a #20) and the extension( اللهم اعصمني من الشيطان الرجيم) is from Ibn Mâjah [773], see Ŝaĥîĥ Ibn Mâjah (1/129)."
          }
        ]
      },
      {
        "group_id": 15,
        "title": "Что касается азана (призыва к молитве)",
        "duas": [
          {
            "id": 22,
            "group_id": 15,
            "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
            "translation": "Повторяйте так же, как говорит муаззин, за исключением слов «Приходите на молитву» и «Приходите к успеху», когда следует сказать: «Нет могущества и силы, кроме как у Аллаха».",
            "reference": "Al-Bukhârî [611](1/152) and Muslim [383](1/288)."
          },
          {
            "id": 23,
            "group_id": 15,
            "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
            "translation": "Немедленно после произнесения муаззином свидетельства веры произносится: (1) «И я свидетельствую, что нет никого достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварища, и что Мухаммад – Его раб и посланник. Я доволен Аллахом как Господом, Мухаммадом как посланником и Исламом как религией».",
            "reference": "(1) Muslim [386](1/290).(2) Ibn Khuzaîymah [422](1/220)."
          },
          {
            "id": 24,
            "group_id": 15,
            "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
            "translation": "После ответа муаззину следует произнести молитву на Пророка (мир ему и благословение).",
            "reference": "Muslim [384](1/288)."
          },
          {
            "id": 25,
            "group_id": 15,
            "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
            "translation": "Скажите: «О Аллах, Господин этого совершенного призыва и молитвы, которую предстоит совершить, даруй Мухаммаду Аль-Васила и Аль-Фадила и возврати его к восхваляемому положению, которое Ты обещал ему. [Поистине, Ты не нарушаешь Своего обещания]».",
            "reference": "Al-Bukhârî [614](1/152) and what is between the brackets is from Al-Baihaqî (1/410). Shaykh Abdul 'Azîz bin Bâz authenticated the chain of the latter in Tuĥfah Al-Akhbâr (p. 38)."
          },
          {
            "id": 26,
            "group_id": 15,
            "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
            "translation": "Также следует молиться за себя между азаном и икамой, так как мольба в это время не отвергается.",
            "reference": "At-Tirmidhî [212], Abû Dâwud [521] and Ahmad [3/119]. Also see Irwâ'-ul-Ghalîl (1/262)."
          }
        ]
      },
      {
        "group_id": 16,
        "title": "В начале молитвы (после такбира)",
        "duas": [
          {
            "id": 27,
            "group_id": 16,
            "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
            "translation": "О Аллах, отдали меня от моих грехов, как Ты отдалил Восток от Запада. О Аллах, очисти меня от моих грехов, как очищают белую одежду от грязи. О Аллах, омой меня от моих грехов снегом, водой и льдом.",
            "reference": "Al-Bukhârî [744](1/181) and Muslim [598](1/419)."
          },
          {
            "id": 28,
            "group_id": 16,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
            "translation": "Как Ты совершенен, о Аллах, и я восхваляю Тебя. Благословенно Твое имя, высоко Твое могущество, и нет никого достойного поклонения, кроме Тебя.",
            "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), and Ibn Mâjah [804, 806]. Also see Ŝaĥîĥ At-Tirmidhî (1/77) and Ŝaĥîĥ Ibn Mâjah (1/135)."
          },
          {
            "id": 29,
            "group_id": 16,
            "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
            "translation": "Я повернул свое лицо к Тому, Кто создал небеса и землю, как чистый верующий, и я не из тех, кто придает сотоварищей. Поистине, моя молитва, мои жертвоприношения, моя жизнь и моя смерть принадлежат Аллаху, Господу миров, у Которого нет сотоварищей. Я был повелен это делать, и я из мусульман. О Аллах, Ты — Царь, нет никого достойного поклонения, кроме Тебя. Ты мой Господь, и я Твой раб. Я был несправедлив к себе, признаю свои грехи, поэтому прости все мои грехи, ведь никто не прощает грехи, кроме Тебя. Направь меня к наилучшему характеру, ибо никто не направит к нему, кроме Тебя, и отведи от меня дурные поступки, ибо никто не отведет их от меня, кроме Тебя. Я откликнулся на Твой зов, и все благо в Твоих руках, и зло не исходит от Тебя. Я существую по Твоей воле и вернусь к Тебе. Ты благословен и возвышен. Я прошу Твоего прощения и обращаюсь к Тебе с покаянием.",
            "reference": "Muslim [771](1/534)."
          },
          {
            "id": 30,
            "group_id": 16,
            "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
            "translation": "О Аллах, Господь Джибриля, Микаиля и Исрафиля, Творец небес и земли, Знающий явное и скрытое. Ты — Судья между Своими рабами в том, в чем они расходятся. Направь меня к истине по Твоему соизволению в том, в чем они разошлись. Поистине, Ты направляешь того, кого пожелаешь, на прямой путь.",
            "reference": "Muslim [770](1/534)."
          },
          {
            "id": 31,
            "group_id": 16,
            "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
            "translation": "Аллах Велик трижды. Слава Аллаху много раз. Преславен Аллах утром и вечером. (Трижды) Я прошу убежища у Аллаха от шайтана: от его надменности, его нашептывания и его воздействия.",
            "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), and Muslim [601](1/420) with extension from: (مِنْ نَفْحِهِ )."
          },
          {
            "id": 32,
            "group_id": 16,
            "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ، وَ لِقَاؤُكَ الحَقُّ، وَ الجَنَّةُ حَقٌّ، وَ النَّارُ حَقٌّ، وَ النَّبِيُّونَ حَقٌّ، وَ مُحَمَّدٌﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ][اللهم لَكَ أسْلَمْتُ، وَ عَلَيْكَ تَوَكَّلْتُ، وَ بِكَ آمَنْتُ، وَ إلَيْكَ أنَبْتُ، وَ بِكَ خَاصَمْتُ، وَ إلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، و أخَّرْتُ، وَ مَا أسْرَرْتُ، وَ مَا أعْلَنْتُ][أنْتَ المُقَدِّمُ، وَ أنْتَ المُؤَخِّرُ لَا إله إلَّا أنْتَ][أنْتَ إلَهِي لَا إله إلَّا أنْتَ].",
            "translation": "Пророк (мир ему и благословение Аллаха) говорил это как начальную молитву во время ночного намаза: «О Аллах, Тебе принадлежит вся хвала, Ты Свет небес и земли и всего, что в них. Тебе принадлежит вся хвала, Ты — Управляющий небес и земли и всего, что в них. Тебе принадлежит вся хвала, Ты — Господь небес и земли и всего, что в них. Тебе принадлежит вся хвала, Тебе принадлежит царство небес и земли и всего, что в них. Тебе принадлежит вся хвала, Ты — Царь небес и земли, Тебе принадлежит вся хвала. Ты — Истина, Твое обещание — истина, Твое Слово — истина, и день, в который мы встретим Тебя, — истина. Рай — истина, ад — истина, пророки — истина, Мухаммад (мир ему и благословение Аллаха) — истина и Час — истина. О Аллах, я покорился Тебе, на Тебя положился, в Тебя уверовал, к Тебе обратился с покаянием, с Тобой спорил, к Тебе обратился за судом. Прости мне то, что я сделал, и что отложил, и что сделал тайно, и что сделал явно. Ты — Ал-Муккадим и Ал-Муаххир. Нет никого достойного поклонения, кроме Тебя. Ты мой Бог, нет никого достойного поклонения, кроме Тебя».",
            "reference": "Al-Bukhârî (3/3), (11/116), and [1120](13/371, 423, 465) and Muslim [769](1/532) in a summarised form."
          }
        ]
      },
      {
        "group_id": 17,
        "title": "Во время поясного поклона",
        "duas": [
          {
            "id": 33,
            "group_id": 17,
            "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
            "translation": "Преславен мой Господь Великий. (Трижды)",
            "reference": "Abû Dâwud [871],  At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
          },
          {
            "id": 34,
            "group_id": 17,
            "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
            "translation": "Преславен Ты, о Аллах, наш Господь, и хвала Тебе. О Аллах, прости меня.",
            "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
          },
          {
            "id": 35,
            "group_id": 17,
            "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
            "translation": "Преславен и Свят (Он), Господь ангелов и Духа (т.е. Джибриля).",
            "reference": "Muslim [487](1/353) and Abû Dâwud [872](1/230)."
          },
          {
            "id": 36,
            "group_id": 17,
            "dua": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
            "translation": "О Аллах, к Тебе я совершил поясной поклон, в Тебя я уверовал и Тебе покорился. Мой слух, зрение, разум, кости и нервы смирились перед Тобой, а также то, что держат мои ступни.",
            "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] and An-Nisâ'i [2/130]. The extension is found in Ibn Ĥibân, see Ŝaĥîĥ Ibn Ĥibân [1901] and Ŝaĥîĥ Ibn Khuzaîmah [607]."
          },
          {
            "id": 37,
            "group_id": 17,
            "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
            "translation": "Преславен Обладатель силы, царства, величия и могущества.",
            "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) and Aĥmad (6/24)."
          }
        ]
      },
      {
    "group_id": 18,
    "title": "При выпрямлении из поясного поклона",
    "duas": [
      {
        "id": 38,
        "group_id": 18,
        "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
        "translation": "Да услышит Аллах того, кто Его восхваляет.",
        "reference": "Al-Bukhârî [795](2/282)."
      },
      {
        "id": 39,
        "group_id": 18,
        "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
        "translation": "Господь наш, Тебе хвала, хвала обильная, прекрасная и благословенная.",
        "reference": "Al-Bukhârî [799](2/284)."
      },
      {
        "id": 40,
        "group_id": 18,
        "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
        "translation": "Небеса, земля и все, что между ними, наполнены Твоей хвалой, а также все, что Ты пожелаешь после этого. О достойный хвалы и славы, самая истинная речь, произнесенная рабом, и мы все рабы Твои. О Аллах, никто не может помешать тому, что Ты даруешь, и никто не может даровать то, что Ты удерживаешь, и никакое богатство или власть не принесут пользы перед Тобой.",
        "reference": "Muslim [477](1/346)."
      }
    ]
  },
      {
        "group_id": 19,
        "title": "Во время земного поклона",
        "duas": [
          {
            "id": 41,
            "group_id": 19,
            "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
            "translation": "Преславен мой Господь Всевышний. (Трижды)",
            "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
          },
          {
            "id": 42,
            "group_id": 19,
            "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
            "translation": "Преславен Ты, о Аллах, наш Господь, и хвала Тебе. О Аллах, прости меня.",
            "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
          },
          {
            "id": 43,
            "group_id": 19,
            "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ",
            "translation": "Преславен и Свят (Он), Господь ангелов и Духа (т.е. Джибриля).",
            "reference": "Muslim (1/533)."
          },
          {
            "id": 44,
            "group_id": 19,
            "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
            "translation": "О Аллах, Тебе я сделал земной поклон, в Тебя уверовал, и Тебе покорился. Мое лицо сделало поклон перед Тем, Кто его создал, придал ему форму и наделил слухом и зрением. Благословен Аллах, наилучший из творцов.",
            "reference": "Muslim [771](1/534)."
          },
          {
            "id": 45,
            "group_id": 19,
            "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ",
            "translation": "Преславен Обладатель силы, царства, величия и могущества.",
            "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), and An-Nisâ'i (2/191). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/166)."
          },
          {
            "id": 46,
            "group_id": 19,
            "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
            "translation": "О Аллах, прости мне все мои грехи, как малые, так и великие, первые и последние, явные и скрытые.",
            "reference": "Muslim [483](1/350)."
          },
          {
            "id": 47,
            "group_id": 19,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
            "translation": "О Аллах, я прошу убежища у Твоего довольства от Твоего гнева и у Твоей защиты от Твоего наказания, и прошу убежища у Тебя от Тебя. Я не в силах воздать Тебе всю хвалу. Ты такой, какой Сам Себя восхвалил.",
            "reference": "Muslim [486](1/352)."
          }
        ]
      },
      {
        "group_id": 20,
        "title": "Между двумя земными поклонами",
        "duas": [
          {
            "id": 48,
            "group_id": 20,
            "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
            "translation": "Господь мой, прости меня. Господь мой, прости меня.",
            "reference": "Abû Dâwud [874](1/231). Also see Ŝaĥîĥ Ibn Mâjah (1/148)."
          },
          {
            "id": 49,
            "group_id": 20,
            "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
            "translation": "О Аллах, прости меня, помилуй меня, наставь меня, укрепи меня, даруй мне здоровье, обеспечь меня и возвысь меня.",
            "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]. Also see Ŝaĥîĥ At-Tirmidhî (1/90) and Ŝaĥîĥ Ibn Mâjah (1/148)."
          }
        ]
      },
      {
    "group_id": 21,
    "title": "Во время земного поклона при чтении Корана",
    "duas": [
      {
        "id": 50,
        "group_id": 21,
        "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
        "translation": "Мое лицо поклонилось Тому, Кто его создал и наделил слухом и зрением своей мощью и силой (Да благословится Аллах, лучший из создателей).",
        "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) и Аль-Хаким признал достоверным, и Ад-Дахаби согласился с ним (1/220). Продолжение фразы взято из суры «Верующие»."
      },
      {
        "id": 51,
        "group_id": 21,
        "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
        "translation": "О Аллах, запиши мне за этот поклон награду у Тебя, удали через него мои грехи, сохрани его для меня как запас и прими его от меня, как Ты принял его от Своего раба Давуда.",
        "reference": "At-Tirmidhî [579](2/473) и Аль-Хаким признал хадис достоверным, и Ад-Дахаби согласился с ним (1/219)."
      }
    ]
  },
      {
        "group_id": 22,
        "title": "Ташаххуд",
        "duas": [
          {
            "id": 52,
            "group_id": 22,
            "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
            "translation": "Приветствия Аллаху, молитвы и добрые деяния. Мир тебе, о Пророк, и милость Аллаха и Его благословение. Мир нам и праведным рабам Аллаха. Я свидетельствую, что нет божества, достойного поклонения, кроме Аллаха, и я свидетельствую, что Мухаммад — Его раб и посланник.",
            "reference": "Al-Bukhârî [831](2/311) и Muslim [402](1/301)."
          }
        ]
      },
      {
        "group_id": 23,
        "title": "Молитва на пророка (мир ему) после ташаххуда",
        "duas": [
          {
            "id": 53,
            "group_id": 23,
            "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
            "translation": "О Аллах, пошли Своё благословение Мухаммаду и семье Мухаммада, как Ты благословил Ибрахима и семью Ибрахима. Воистину, Ты достохвален и славен. О Аллах, пошли Свои благословения Мухаммаду и семье Мухаммада, как Ты благословил Ибрахима и семью Ибрахима. Воистину, Ты достохвален и славен.",
            "reference": "Al-Bukhârî [337](6/408)."
          },
          {
            "id": 54,
            "group_id": 23,
            "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
            "translation": "О Аллах, пошли благословение Мухаммаду и его жёнам и потомкам, как Ты послал благословение семье Ибрахима. И благослови Мухаммада и его жён и потомков, как Ты благословил семью Ибрахима. Воистину, Ты достохвален и славен.",
            "reference": "Al-Bukhârî [3369](2/407) и Muslim [407](1/306)."
          }
        ]
      },
      {
        "group_id": 24,
        "title": "После Последнего Ташаххуда и До Салама",
        "duas": [
          {
            "id": 55,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
            "translation": "О Аллах, я прошу у Тебя защиты от наказания могилы, от мучений ада, от испытаний в жизни и смерти и от зла испытания Аль-Масих Ад-Даджаля.",
            "reference": "Аль-Бухари 2/102 и Муслим 1/412."
          },
          {
            "id": 56,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
            "translation": "О Аллах, я прошу у Тебя защиты от наказания могилы, прошу у Тебя защиты от искушений и испытаний Аль-Масиха Ад-Даджаля, прошу у Тебя защиты от испытаний жизни и смерти. О Аллах, прошу у Тебя защиты от грехов и долгов.",
            "reference": "Аль-Бухари [832](2/102) и Муслим [589](1/412)."
          },
          {
            "id": 57,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
            "translation": "О Аллах, я действительно причинил себе много зла, и никто не может простить грехи, кроме Тебя, так прости же меня Своим прощением и помилуй меня. Поистине, Ты — Прощающий, Милосердный.",
            "reference": "Аль-Бухари [7387](8/168) и Муслим [2705](4/2078)."
          },
          {
            "id": 58,
            "group_id": 24,
            "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
            "translation": "О Аллах, прости меня за грехи, которые я совершил, и которые совершу в будущем, за то, что я сделал тайно и явно, и за то, в чем я был чрезмерен, и за то, что известно Тебе лучше меня. Ты — Аль-Мукаддим и Аль-Муаххир. Нет божества, кроме Тебя.",
            "reference": "Муслим [771](1/534)."
          },
          {
            "id": 59,
            "group_id": 24,
            "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
            "translation": "О Аллах, помоги мне помнить Тебя, благодарить Тебя и поклоняться Тебе наилучшим образом.",
            "reference": "Абу Дауд [1522](2/86) и Ан-Насаи (3/53). Аль-Альбани подтвердил его достоверность в Сахих Аби Дауд (1/284)."
          },
          {
            "id": 60,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
            "translation": "О Аллах, прошу у Тебя защиты от жадности и трусости, и прошу у Тебя защиты, чтобы не быть возвращенным к самой худшей старости. Прошу у Тебя защиты от испытаний этой жизни и наказания могилы.",
            "reference": "Аль-Бухари [2822](6/35)."
          },
          {
            "id": 61,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
            "translation": "О Аллах, прошу у Тебя даровать мне Рай и прошу у Тебя защиты от огня.",
            "reference": "Абу Дауд [792] и Ибн Маджа, см. Сахих Ибн Маджа (2/328)."
          },
          {
            "id": 62,
            "group_id": 24,
            "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
            "translation": "О Аллах, по Твоему знанию сокровенного и по Твоей силе над творением, сохрани меня в живых, пока Ты знаешь, что жизнь для меня — благо, и забери меня, если Ты знаешь, что смерть для меня — лучше. О Аллах, внуши мне страх перед Тобой, будь то тайно или явно, и даруй мне правдивость слов в гневе и в радости. Сделай меня умеренным в богатстве и в бедности, даруй мне вечное блаженство, которое никогда не иссякнет, даруй мне успокоение глаз, которое не исчезнет. Сделай меня довольным Твоим решением и облегчи мне жизнь после смерти. Даруй мне сладость лицезрения Твоего Лика и радость встречи с Тобой без всякого зла или искушения. О Аллах, укрась нас украшением веры и сделай нас праведными наставниками.",
            "reference": "Ан-Насаи (4/54, 55) и Ахмад (4/364). Аль-Альбани подтвердил его достоверность в Сахих Ан-Насаи (1/281)."
          },
          {
            "id": 63,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
            "translation": "О Аллах, я прошу Тебя, о Аллах, Ты — Единственный, Ас-Самад, Который не родил и не был рожден, и нет никого, подобного Тебе. Прости мои грехи, поистине Ты — Прощающий, Милосердный.",
            "reference": "Ан-Насаи (3/52) и Ахмад (4/238). Аль-Альбани подтвердил его достоверность в Сахих Ан-Насаи (1/280)."
          },
          {
            "id": 64,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
            "translation": "О Аллах, я прошу Тебя, ведь Тебе принадлежит вся хвала, нет божества, кроме Тебя, Единственного, у Которого нет сотоварищей. Ты — Милостивый, О Творец небес и земли, О Обладатель Величия и Чести, О Вечноживущий, О Самосуществующий и Поддерживающий всё. Поистине, прошу у Тебя Рай и прибегаю к Тебе от огня.",
            "reference": "Абу Дауд [1495], Ан-Насаи (3/52), Ибн Маджа [3858] и Ат-Тирмизи [3544]. Также см. Сахих Ибн Маджа (2/329)."
          },
          {
            "id": 65,
            "group_id": 24,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
            "translation": "О Аллах, прошу Тебя, как свидетельствую, что Ты — Аллах, нет божества, кроме Тебя, Единственный, Ас-Самад, Который не родил и не был рожден, и нет никого, подобного Тебе.",
            "reference": "Абу Дауд [1493](2/62), Ат-Тирмизи [3475](5/515), Ибн Маджа [3857](2/1267) и Ахмад (5/360). Также см. Сахих Ибн Маджа (2/329) и Сахих Ат-Тирмизи (3/163)."
          }
        ]
      },
      {
        "group_id": 25,
        "title": "После Салама",
        "duas": [
          {
            "id": 66,
            "group_id": 25,
            "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
            "translation": "(1) Прошу прощения у Аллаха (трижды)(2) О Аллах, Ты — мир, и от Тебя исходит мир. Благословен Ты, Владыка величия и почёта.",
            "reference": "Muslim [591](1/414)."
          },
          {
            "id": 67,
            "group_id": 25,
            "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
            "translation": "Нет божества, достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварищей, Ему принадлежит всё, и Ему хвала, и Он способен на всё (трижды). О Аллах, никто не может удержать того, что Ты даёшь, и никто не может дать того, что Ты удерживаешь. И ни одно богатство не принесёт пользы перед Тобой.",
            "reference": "Al-Bukhârî [844](1/255) и Muslim [593](1/414)."
          },
          {
            "id": 68,
            "group_id": 25,
            "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
            "translation": "Нет божества, достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварищей. Ему принадлежит власть и хвала, и Он способен на всё. Нет силы и мощи, кроме как у Аллаха. Нет божества, достойного поклонения, кроме Аллаха, и мы не поклоняемся никому, кроме Него. Ему — благодарность и хвала, и никто не может сравниться с Ним. Нет божества, достойного поклонения, кроме Аллаха, и мы искренне следуем за Ним, даже если неверные ненавидят это.",
            "reference": "Muslim [594](1/415)."
          },
          {
            "id": 69,
            "group_id": 25,
            "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
            "translation": "(1) Субханаллах, альхамдулиллах, Аллаху Акбар (тридцать три раза)(2) Нет божества, достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварищей. Ему принадлежит всё, и Ему хвала, и Он способен на всё.",
            "reference": "Muslim [597](1/418)."
          },
          {
            "id": 70,
            "group_id": 25,
            "dua": "(قُلْ هُوَ اللَّهُ أَحَدٌ...)(قٌلْ أَعُوْذُ بِرَبَّ الْفَلَقِ...)(قُلْ أَعُوْذُ بِرَبَّ النَّاسِ...)",
            "translation": "Эти три суры следует прочитать один раз после полуденной, предвечерней и ночной молитвы, и три раза после утренней и вечерней молитвы:(1) Сура «Аль-Ихлас»(2) Сура «Аль-Фалак»(3) Сура «Ан-Нас»",
            "reference": "Abû Dâwud [1523](2/86) и An-Nisâ'i (3/68). Также см. Ŝaĥîĥ At-Tirmidhî (2/8)."
          },
          {
            "id": 71,
            "group_id": 25,
            "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
            "translation": "Сунной является чтение аята аль-Курси после каждой молитвы:[Аль-Бакара: 255]",
            "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) и Ibn Sinnî [121]. Аль-Альбани признал хадис достоверным в Ŝaĥîĥ Al-Jâmi' [6464](5/339) и Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [972](2/697)."
          },
          {
            "id": 72,
            "group_id": 25,
            "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
            "translation": "Нет божества, достойного поклонения, кроме Аллаха, Единственного, у Которого нет сотоварищей, Ему принадлежит власть и хвала. Он дарует жизнь и причиняет смерть, и Он способен на всё. (Десять раз после Магриба и Фаджра)",
            "reference": "At-Tirmidhî [3474](5/515) и Aĥmad (4/227). Также см. Zâd Al-Ma'âd (1/300)."
          },
          {
            "id": 73,
            "group_id": 25,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
            "translation": "О Аллах, я прошу Тебя даровать мне полезное знание, чистый пропитание и благие деяния (После завершения утренней молитвы).",
            "reference": "Ibn Mâjah [925]. Также см. Ŝaĥîĥ Ibn Mâjah (1/152) и Majmu' Az-Zawâ'id [95](10/111)."
          }
        ]
      },
      {
        "group_id": 32,
        "title": "Кунут Аль-Витр",
        "duas": [
          {
            "id": 116,
            "group_id": 32,
            "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
            "translation": "О Аллах, веди меня к прямому пути среди тех, кого Ты направил, даруй мне благополучие среди тех, кому Ты его даровал, поддержи меня среди тех, кого Ты поддержал, и благослови меня в том, что Ты даровал. Убереги меня от зла, которое Ты предопределил, ведь поистине, только Тебе принадлежит суд, и никто не может судить Тебя. Воистину, не будет унижен тот, кому Ты являешься покровителем, [и не будет возвеличен тот, с кем Ты во вражде]. Благословен Ты, о наш Господь, и возвышен!",
            "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). Что в скобках, взято из Аль-Байхаки. Также см. Ŝaĥîĥ At-Tirmidhî (1/144), Ŝaĥîĥ Ibn Mâjah (1/194), и Irwâ'-ul-Ghalîl (2/172)."
          },
          {
            "id": 117,
            "group_id": 32,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
            "translation": "О Аллах, я прибегаю к Твоему удовольствию от Твоего гнева, и к Твоему прощению от Твоего наказания, и я прибегаю к Тебе от Тебя же. Я не могу исчерпать Твою хвалу. Ты такой, как Ты сам Себя похвалил.",
            "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], и Aĥmad (1/96,118,150). Также см. Ŝaĥîĥ At-Tirmidhî (3/180), Ŝaĥîĥ Ibn Mâjah (1/194) и Irwâ'-ul-Ghalîl (2/175)."
          },
          {
            "id": 118,
            "group_id": 32,
            "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
            "translation": "О Аллах, мы поклоняемся Тебе, и ради Тебя молимся и совершаем земной поклон, к Тебе мы спешим и стремимся. Мы надеемся на Твою милость и боимся Твоего наказания, ведь Твое наказание постигает неверующих. О Аллах, мы просим Тебя о помощи, прощении и хвалим Тебя, и не отрицаем Тебя. Мы веруем в Тебя, смиряемся перед Тобой и отрекаемся от тех, кто не верует в Тебя.",
            "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) и признан достоверным в Ŝaĥîĥ Ирва'уль-Галиль (2/170)."
          }
        ]
      },
      {
        "group_id": 33,
        "title": "Сразу после Саляма в Витр Намазе",
        "duas": [
          {
            "id": 119,
            "group_id": 33,
            "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
            "translation": "Пречист Царь, Святой (Трижды, и на третий раз Пророк ﷺ произносил это громче и продлевал голос, добавляя: Господь ангелов и духа (Рух)).",
            "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) и этот довесок признан достоверным. Также см. исследования Шу'аиба и 'Абдул-Кадира аль-Арнаута в Зад аль-Ма'ад (1/337)."
          }
        ]
      },
      {
        "group_id": 42,
        "title": "Для страдающих от шептаний во время молитвы или чтения",
        "duas": [
          {
            "id": 138,
            "group_id": 42,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
            "translation": "Я прибегаю к защите Аллаха от проклятого шайтана и (сухо) плюнь трижды через левое плечо.",
            "reference": "Муслим [2203](4/1729)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 3,
    "title": "Прославление Аллаха",
    "group": [
        {
            "group_id": 26,
            "title": "Молитва за руководство в принятии решения или выборе правильного пути",
            "duas": [
                {
                    "id": 74,
                    "group_id": 26,
                    "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
                    "translation": "Со слов Джабира ибн Абдуллы (да будет доволен им Аллах), он сказал: 'Пророк (мир ему и благословение Аллаха) учил нас молиться о руководстве во всех наших делах, как учил нас сурам из Корана. Он (мир ему и благословение Аллаха) говорил: «Если кто-то из вас собирается совершить дело, пусть он совершит два рак'ата добровольной молитвы (два рак'ата нафиля), после чего скажет:'О Аллах, я прошу Твоего совета с помощью Твоего знания и Твоей силы. Я прошу Тебя о великой милости, ибо Ты способен на всё, а я не способен, Ты знаешь, а я не знаю, и Ты - Знающий сокровенное. О Аллах, если Ты знаешь, что это дело (здесь он называет свою нужду) благо для меня в моей религии, моей жизни и в конце, тогда предопредели его для меня, облегчи его для меня и благослови меня в нём. Если же Ты знаешь, что это дело зло для меня в моей религии, моей жизни и в конце, то удали его от меня и меня от него, и предопредели мне то, что лучше, где бы оно ни было, и сделай меня довольным этим».(١)Тот, кто просит руководства у своего Создателя и советуется со своими верующими братьями, а затем остаётся твердым в своём намерении, не будет сожалеть, ибо Аллах сказал: {…и советуйся с ними в делах, а когда решишься, положись на Аллаха…}(٢)",
                    "reference":"(1) Al-Bukhârî [1162](7/162).(2) Qur'an Al-'Imran [3:159]."
                }
            ]
        },
        {
            "group_id": 43,
            "title": "Когда дела становятся трудными",
            "duas": [
                {
                    "id": 139,
                    "group_id": 43,
                    "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
                    "translation": "О Аллах, нет лёгкости, кроме той, что Ты сделал лёгкой, и Ты можешь сделать трудность лёгкой, если пожелаешь.",
                    "reference": "Ibn Ĥibbân in his Ŝaĥîĥ [2427], Mawârid and Ibn As-Sunnî [351]. And Ibn Ĥajar said: \"This ĥadîth is Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť also declared it Ŝaĥîĥ in his takrîj of Imam Nawawî 's Athkâr (pg. 106)."
                }
            ]
        },
        {
            "group_id": 44,
            "title": "После совершения греха",
            "duas": [
                {
                    "id": 140,
                    "group_id": 44,
                    "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
                    "translation": "Любой раб, совершивший грех, если он совершит омовение, затем выполнит два рак'ата молитвы и попросит прощения у Аллаха, Аллах простит его.",
                    "reference": "Abû Dâwud [1521](2/86) and At-Tirmidhî [406,3006](2/257). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/283)."
                }
            ]
        },
        {
            "group_id": 46,
            "title": "Когда случается несчастье или неожиданное событие",
            "duas": [
                {
                    "id": 144,
                    "group_id": 46,
                    "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
                    "translation": "Аллах предопределил, и что Он пожелал, то и совершил.",
                    "reference": "Muslim [2664](4/2052)."
                }
            ]
        },
        {
            "group_id": 88,
            "title": "Защита от Даджаля",
            "duas": [
                {
                    "id": 199,
                    "group_id": 88,
                    "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
                    "translation": "Тот, кто выучит первые десять аятов суры Аль-Кахф, будет защищён от Даджаля.",
                    "reference": "Muslim [809](1/555)."
                }
            ]
        },
        {
            "group_id": 107,
            "title": "О достоинствах посылания молитв Пророку (мир ему и благословение Аллаха)",
            "duas": [
                {
                    "id": 219,
                    "group_id": 107,
                    "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: 'Кто отправит на меня молитву, Аллах отправит на него десять молитв.'",
                    "reference": "Muslim [408](1/288)."
                },
                {
                    "id": 220,
                    "group_id": 107,
                    "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: 'Не делайте мою могилу местом празднования. Посылайте на меня молитвы, ибо ваши молитвы достигают меня, где бы вы ни были.'",
                    "reference": "Abû Dâwud [2042](2/218) and Aĥmad (2/367). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/383)."
                },
                {
                    "id": 221,
                    "group_id": 107,
                    "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: 'Скупой тот, кто, услышав обо мне, не посылает на меня молитвы.'",
                    "reference": "At-Tirmidhî [3546](5/551). Also see Ŝaĥîĥ Al-Jâmi' [2787](3/25) and Ŝaĥîĥ At-Tirmidhî (3/177)."
                },
                {
                    "id": 222,
                    "group_id": 107,
                    "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: 'Аллах, возвышен Он, имеет ангелов, которые странствуют по земле и передают мне приветствия от моей уммы.'",
                    "reference": "An-Nisâ'i (3/43) and Al-Hâkim (2/421). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/274)."
                },
                {
                    "id": 223,
                    "group_id": 107,
                    "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: 'Всякий раз, когда кто-то приветствует меня, Аллах возвращает мне мою душу, чтобы я мог ответить на это приветствие.'",
                    "reference": "Abû Dâwud (2041). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/283)."
                }
            ]
        },
        {
            "group_id": 129,
            "title": "Мольба о прощении и покаянии",
            "duas": [
                {
                    "id": 248,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: 'Клянусь Аллахом, я прошу у Аллаха прощения и каюсь перед Ним более семидесяти раз в день.'",
                    "reference": "Al-Bukhârî [6307](11/101)."
                },
                {
                    "id": 249,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: 'О люди, кайтесь перед Аллахом, ибо я каюсь перед Ним сто раз в день.'",
                    "reference": "Muslim [2702](4/2076)."
                },
                {
                    "id": 250,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
                    "translation": "Кто скажет: 'Прошу прощения у Аллаха Великого, кроме Которого нет другого божества, Живого и Всеподдерживающего, и каюсь перед Ним', будет прощён Аллахом, даже если он сбежал с поля боя.",
                    "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511) and he authenticated it and Adh-Dhahabî agreed with him. Al-Albânî authenticated it, see Ŝaĥîĥ At-Tirmidhî (3/182) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/389-390) with research by Arnâ'ûť."
                },
                {
                    "id": 251,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: 'Господь наиболее близок к Своему рабу в последней части ночи, так что если ты сможешь быть из тех, кто поминает Аллаха в это время, будь таковым.'",
                    "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), and Al-Hâkim. Also see Ŝaĥîĥ At-Tirmidhî (3/183) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/144) with research by Arnâ'ûť."
                },
                {
                    "id": 252,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: 'Раб наиболее близок к своему Господу, когда он в земном поклоне, так что чаще делайте мольбу в это время.'",
                    "reference": "Muslim [482](1/350)."
                },
                {
                    "id": 253,
                    "group_id": 129,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: 'Воистину, на моё сердце накапливается тяжесть, и я прошу у Аллаха прощения сто раз в день.'",
                    "reference": "Muslim [2702](4/2075). Also see Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/386)."
                }
            ]
        },
        {
            "group_id": 130,
            "title": "Достоинство поминания и прославления Аллаха",
            "duas": [
                {
                    "id": 254,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
                    "translation": "Как совершенен Аллах, и хвала Ему. (Сто раз в день)",
                    "reference": "Al-Bukhârî [6405](7/168) and Muslim [2691](4/2071)."
                },
                {
                    "id": 255,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
                    "translation": "Нет божества, кроме Аллаха, одного, у Которого нет сотоварища. Ему принадлежит власть и хвала, и Он способен на всё. (Десять раз)",
                    "reference": "Al-Bukhârî (7/67) and Muslim (4/2017)."
                },
                {
                    "id": 256,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Есть два слова (фразы), которые лёгки на языке, тяжеловесны на весах и любимы Милостивому: 'Как совершенен Аллах, и хвала Ему.' (и) 'Как совершенен Аллах, Верховный.'",
                    "reference": "Al-Bukhârî [3462](7/168) and Muslim [2694](4/2072)."
                },
                {
                    "id": 257,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
                    "translation": "Посланник Аллаха (мир ему и благословение Аллаха) сказал: «Слова: 'Как совершенен Аллах, хвала Аллаху, нет божества, кроме Аллаха, и Аллах Велик' для меня лучше всего, на что восходит солнце».",
                    "reference": "Muslim [2695](4/2072)."
                },
                {
                    "id": 258,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
                    "translation": "Как совершенен Аллах, и хвала Ему. (Сто раз)",
                    "reference": "Muslim [2698](4/2073)."
                },
                {
                    "id": 259,
                    "group_id": 130,
                    "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
                    "translation": "Кто скажет: «Как совершенен Аллах, Великий, и хвала Ему», для того будет посажена пальма в Раю.",
                    "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [6429](5/531) and Ŝaĥîĥ At-Tirmidhî (3/160)."
                },
                {
                    "id": 260,
                    "group_id": 130,
                    "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
                    "translation": "Нет силы и могущества ни у кого, кроме как у Аллаха.",
                    "reference": "Al-Bukhârî [4205](11/213) and Muslim [2704](4/2076)."
                },
                {
                    "id": 261,
                    "group_id": 130,
                    "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
                    "translation": "Пророк (мир ему и благословение Аллаха) сказал: «Четыре фразы любимы Аллахом: 'Как совершенен Аллах', 'Хвала Аллаху', 'Нет божества, кроме Аллаха' и 'Аллах Велик.'»",
                    "reference": "Muslim [2137](3/1685)."
                },
                {
                    "id": 262,
                    "group_id": 130,
                    "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
                    "translation": "Нет божества, кроме Аллаха, одного без сотоварищей. Аллах Велик, и много хвалы для Аллаха. Как совершенен Аллах, Господь миров. Нет силы и могущества, кроме как у Аллаха, Могущественного и Мудрого. О Аллах, прости меня, помилуй меня, направь меня и даруй мне пропитание.",
                    "reference": "Muslim [2696](4/2072)."
                },
                {
                    "id": 263,
                    "group_id": 130,
                    "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
                    "translation": "О Аллах, прости меня, помилуй меня, направь меня, даруй мне здоровье и пропитание.",
                    "reference": "Muslim [2697](4/2073)."
                },
                {
                    "id": 264,
                    "group_id": 130,
                    "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
                    "translation": "Поистине, лучшая молитва (ду'а): 'Хвала Аллаху', и лучшее поминание: 'Нет божества, кроме Аллаха.'",
                    "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), and Al-Hâkim (1/503) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [1104](1/362)."
                },
                {
                    "id": 265,
                    "group_id": 130,
                    "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
                    "translation": "Как совершенен Аллах, и хвала Ему. Нет божества, кроме Аллаха, и Аллах Велик. Нет силы и могущества, кроме как у Аллаха.",
                    "reference": "Aĥmad [513](3/75) according to the order of Aĥmad Shâkir and its chain is authentic. Also see Majma' Az-Zawâ'id (1/297)..... [COMPLETE THIS]"
                }
            ]
        },
        {
            "group_id": 131,
            "title": "Как Пророк (мир ему и благословение Аллаха) совершал тасбих",
            "duas": [
                {
                    "id": 266,
                    "group_id": 131,
                    "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
                    "translation": "'Абдуллах ибн 'Амр (да будет доволен им Аллах) сказал: 'Я видел, как Пророк (мир ему и благословение Аллаха) совершал тасбих правой рукой.'",
                    "reference": "Abû Dâwud [1502](2/81) and At-Tirmidhî [3486](5/521). Also see Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
                }
            ]
        }
    ]
},
  {
    "category_id": 4,
    "title": "Хадж и Умра",
    "group": [
      {
        "group_id": 115,
        "title": "Тальбия для совершающего Хадж или Умру",
        "duas": [
          {
            "id": 233,
            "group_id": 115,
            "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
            "translation": "Вот я перед Тобой, о Аллах, вот я перед Тобой. Вот я перед Тобой, у Тебя нет сотоварищей, вот я перед Тобой. Воистину, вся хвала, благодать и власть принадлежат Тебе. У Тебя нет сотоварищей.",
            "reference": "Al-Bukhârî [1549](3/408) and Muslim [1184](2/841)."
          }
        ]
      },
      {
        "group_id": 116,
        "title": "Такбир у Чёрного Камня",
        "duas": [
          {
            "id": 234,
            "group_id": 116,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "Аллах Велик.",
            "reference": "Al-Bukhârî [1612](1/476)."
          }
        ]
      },
      {
        "group_id": 117,
        "title": "Между Йеменским углом и Чёрным Камнем",
        "duas": [
          {
            "id": 235,
            "group_id": 117,
            "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
            "translation": "О наш Господь, даруй нам лучшее в этой жизни и лучшее в следующей жизни, и защити нас от наказания Огня.",
            "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) and Al-Baghawî in Sharĥ As-Sunnah (7/128). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/354).(2) Sûrah Al-Baqarah: 201."
          }
        ]
      },
      {
        "group_id": 118,
        "title": "На горе Сафа и горе Марва",
        "duas": [
          {
            "id": 236,
            "group_id": 118,
            "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
            "translation": "Воистину, Сафа и Марва — это знамения Аллаха... Нет божества, кроме Аллаха, и Аллах Велик. Нет божества, кроме Аллаха, единственного, без сотоварищей. Ему принадлежит вся власть и хвала, и Он способен на всё. Нет божества, кроме Аллаха, единственного. Он исполнил Своё обещание, помог Своему Рабу и один одолел союзников.",
            "reference": "Muslim [1218](2/888)."
          }
        ]
      },
      {
        "group_id": 119,
        "title": "День Арафа",
        "duas": [
          {
            "id": 237,
            "group_id": 119,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "Нет божества, кроме Аллаха, единственного, без сотоварищей. Ему принадлежит вся хвала и власть, и Он способен на всё.",
            "reference": "At-Tirmidhî [3585]. Al-Albânî authenticated it in Ŝaĥîĥ At-Tirmidhî (3/184) and Al-Aĥâdîth Aŝ-Ŝaĥîĥah (4/6). "
          }
        ]
      },
      {
        "group_id": 120,
        "title": "Поминание Аллаха в Муздалифе",
        "duas": [
          {
            "id": 238,
            "group_id": 120,
            "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
            "translation": "Пророк (мир ему и благословение Аллаха) ехал на Аль-Касва, пока не достиг Аль-Машар Аль-Харам. Затем он повернулся лицом к Кибле, молился Аллаху, прославлял Его величие и единство. Он стоял до восхода солнца, но ушёл, не дождавшись его полного восхода.",
            "reference": "Muslim [1218](2/891)."
          }
        ]
      },
      {
        "group_id": 121,
        "title": "Когда бросаешь камешки в Джамарат",
        "duas": [
          {
            "id": 239,
            "group_id": 121,
            "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
            "translation": "Каждый раз, когда бросаешь камешек в одну из трёх джамарат, произноси такбир, затем иди дальше и остановись, чтобы помолиться, повернувшись к Кибле и подняв руки, после первой и второй джамарат. Что касается Джамрат аль-Акъаба, то её бросаешь и произносишь такбир при каждом камешке, после чего уходишь, не останавливаясь.",
            "reference": "Al-Bukhârî [1752, 1753](3/583-584) and see his wording there, Al-Bukhârî [1750](3/581) and Muslim [1296]."
          }
        ]
      },
      {
        "group_id": 127,
        "title": "Когда совершаешь жертвоприношение",
        "duas": [
          {
            "id": 246,
            "group_id": 127,
            "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
            "translation": "Во имя Аллаха, и Аллах Велик. О Аллах, это от Тебя и принадлежит Тебе. О Аллах, прими это от меня.",
            "reference": "Muslim [1966](3/1557) and Baihaqî (9/287). What is between the brackets is from Baihaqî and others."
          }
        ]
      }
    ]
  },
  {
    "category_id": 5,
    "title": "Путешествие",
    "group": [
      {
        "group_id": 95,
        "title": "При посадке на животное или любой вид транспорта",
        "duas": [
          {
            "id": 206,
            "group_id": 95,
            "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
            "translation": "Во имя Аллаха и вся хвала Аллаху. Как совершенен Тот, Кто покорил нам это (средство передвижения), и мы сами не были бы способны на это, и к нашему Господу наше конечное возвращение. Вся хвала Аллаху, вся хвала Аллаху, вся хвала Аллаху, Аллах Велик, Аллах Велик, Аллах Велик. Как совершенен Ты, о Аллах, поистине я совершил зло по отношению к своей душе, поэтому прости меня, ибо никто не может прощать грехи, кроме Тебя.",
            "reference": "Abû Dâwud [2602](3/34) and At-Tirmidhî [3446](5/510). Also see Ŝaĥîĥ At-Tirmidhî (3/156)."
          }
        ]
      },
      {
        "group_id": 96,
        "title": "Во время путешествия",
        "duas": [
          {
            "id": 207,
            "group_id": 96,
            "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
            "translation": "(1) Аллах Велик, Аллах Велик, Аллах Велик. Как совершенен Тот, Кто покорил нам это (средство передвижения), и мы сами не были бы способны на это, и к нашему Господу наше конечное возвращение. О Аллах, мы просим у Тебя благочестия и богобоязненности в этом нашем путешествии, и мы просим у Тебя дел, которые Тебе угодны. О Аллах, облегчи наше путешествие и позволь нам быстро покрыть его расстояние. О Аллах, Ты Спутник в пути и Опекун семьи, о Аллах, я прибегаю к Тебе от трудностей пути, перемены в сердцах и плохого исхода с богатством и семьёй.При возвращении читается та же молитва с добавлением:(2) 'Мы возвращаемся, каемся, поклоняемся и восхваляем нашего Господа.'",
            "reference": "Muslim [1342](2/998)."
          }
        ]
      },
      {
        "group_id": 97,
        "title": "При входе в город или деревню",
        "duas": [
          {
            "id": 208,
            "group_id": 97,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
            "translation": "О Аллах, Господь семи небес и всего, что они покрывают, Господь семи земель и всего, что они несут, Господь дьяволов и всех, кого они вводят в заблуждение, Господь ветров и всего, что они уносят. Я прошу Тебя о благе этой деревни, о благе её жителей и всего добра, что в ней есть, и прибегаю к Тебе от зла этой деревни, зла её жителей и всего зла, что в ней есть.",
            "reference": "Al-Hâkim (2/100) and he authenticated it and Adh-Dhahabî agreed with him, Ibn As-Sunnî [524], Al-Hâfiž declared it Ĥasan in Takrîj Al-Athkâr (5/154). Shaykh Ibn Bâz said that it has been narrated by An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548] with a Ĥasan chain. Also see Tuĥfat Al-Akhyâr (pg. 37)."
          }
        ]
      },
      {
        "group_id": 98,
        "title": "При входе на рынок",
        "duas": [
          {
            "id": 209,
            "group_id": 98,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "Нет божества, кроме Аллаха, единственного, без сотоварищей. Ему принадлежит власть и хвала. Он дарует жизнь и смерть, и Он живой и не умирает. В Его руке — вся благодать, и Он способен на всё.",
            "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) and Ibn Mâjah [2235]. Al-Albânî classed it as Ĥasan in Ŝaĥîĥ Ibn Mâjah (2/21) and Ŝaĥîĥ At-Tirmidhî (3/152)."
          }
        ]
      },
      {
        "group_id": 99,
        "title": "Когда транспортное средство спотыкается",
        "duas": [
          {
            "id": 210,
            "group_id": 99,
            "dua": "بِسْمِ اللهِ",
            "translation": "Во имя Аллаха.",
            "reference": "Abû Dâwud [4982](4/296). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/941)."
          }
        ]
      },
      {
        "group_id": 100,
        "title": "Молитва путешественника за остающегося дома",
        "duas": [
          {
            "id": 211,
            "group_id": 100,
            "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
            "translation": "Я поручаю вас Аллаху, Чьё попечение никогда не теряется.",
            "reference": "Aĥmad (2/403) and Ibn Mâjah [2825](2/943). Also see Ŝaĥîĥ Ibn Mâjah (2/133)."
          }
        ]
      },
      {
        "group_id": 101,
        "title": "Молитва за путешественника",
        "duas": [
          {
            "id": 212,
            "group_id": 101,
            "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
            "translation": "Я поручаю Аллаху твою религию, твою верность и завершение твоих дел.",
            "reference": "Aĥmad (2/7) and At-Tirmidhî [3443](5/499). Also see Ŝaĥîĥ At-Tirmidhî (2/155)."
          },
          {
            "id": 213,
            "group_id": 101,
            "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
            "translation": "Пусть Аллах дарует тебе богобоязненность, простит твои грехи и облегчит для тебя всё доброе, где бы ты ни находился.",
            "reference": "At-Tirmidhî [3444]. Also see Ŝaĥîĥ At-Tirmidhî (3/155)."
          }
        ]
      },
      {
        "group_id": 102,
        "title": "Восхваление при подъёме или спуске",
        "duas": [
          {
            "id": 214,
            "group_id": 102,
            "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
            "translation": "При подъёме говори (1) 'Аллах Велик', а при спуске говори (2) 'Слава Аллаху'.",
            "reference": "Al-Bukhârî [2993](6/135)."
          }
        ]
      },
      {
        "group_id": 103,
        "title": "Молитва путешественника на рассвете",
        "duas": [
          {
            "id": 215,
            "group_id": 103,
            "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
            "translation": "Да услышит свидетель нашу хвалу Аллаху за Его милость и блага, которые Он даровал нам. Господь наш, защити нас, даруй нам благодать и спаси нас от всякого зла. Я прибегаю к Аллаху от адского огня.",
            "reference": "Muslim [2718](4/2086)."
          }
        ]
      },
      {
        "group_id": 104,
        "title": "Остановка на ночлег",
        "duas": [
          {
            "id": 216,
            "group_id": 104,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "translation": "Я прибегаю к совершенным словам Аллаха от зла всего сотворённого Им.",
            "reference": "Muslim [2708](4/2080)."
          }
        ]
      },
      {
        "group_id": 105,
        "title": "При возвращении из путешествия",
        "duas": [
          {
            "id": 217,
            "group_id": 105,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
            "translation": "Аллах Велик, Аллах Велик, Аллах Велик. Нет божества, кроме Аллаха, единственного, без сотоварищей. Ему принадлежит власть и хвала, и Он способен на всё. Мы возвращаемся, каемся, поклоняемся и восхваляем нашего Господа. Аллах исполнил Своё обещание, помог Своему слуге и в одиночку победил союзников.",
            "reference": "Al-Bukhârî [1797](7/163) and Muslim [1344](2/980)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 6,
    "title": "Радость и Страдание",
    "group": [
      {
        "group_id": 34,
        "title": "От тревоги и печали",
        "duas": [
          {
            "id": 120,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
            "translation": "О Аллах, я — Твой раб, сын Твоего раба, сын Твоей рабыне, моя судьба в Твоих руках, Твоя воля в отношении меня неизменна, и Твое постановление справедливо. Прошу Тебя именем каждого из Твоих имен, которым Ты назвал Себя, или которое Ты открыл в Своей Книге, или научил одного из Твоих созданий, или сохранил в Своем знании сокровенного, сделай Коран весной моего сердца, светом моей груди, утешением моей печали и избавлением от моей тревоги.",
            "reference": "Aĥmad (1/391). Al-Albânî authenticated it in Al-Kalam Ať-Ťayyib [124]."
          },
          {
            "id": 121,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
            "translation": "О Аллах, я прибегаю к Тебе от тревоги и печали, слабости и лени, жадности и трусости, бремени долгов и от подавленности людьми.",
            "reference": "Al-Bukhârî [6363](7/158), see Fatĥ al-Bârî (11/173)."
          }
        ]
      },
      {
        "group_id": 35,
        "title": "Для того, кто в беде",
        "duas": [
          {
            "id": 122,
            "group_id": 35,
            "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
            "translation": "Нет божества, кроме Аллаха Великого и Терпеливого. Нет божества, кроме Аллаха, Господа великого престола. Нет божества, кроме Аллаха, Господа небес, Господа земли и Господа благородного престола.",
            "reference": "Al-Bukhârî [6346](7/154) and Muslim [2730](4/2092)."
          },
          {
            "id": 123,
            "group_id": 35,
            "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
            "translation": "О Аллах, я надеюсь на Твою милость, не оставляй меня на самого себя даже на мгновение и исправь все мои дела. Нет божества, кроме Тебя.",
            "reference": "Abû Dâwud [5090](4/324) and Aĥmad (5/42). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (3/959)."
          },
          {
            "id": 124,
            "group_id": 35,
            "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
            "translation": "Нет божества, кроме Тебя. Как совершенен Ты, поистине, я был из числа несправедливых.",
            "reference": "At-Tirmidhî [3505](5/529) and Al-Hâkim (1/505) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Tirmidhî (3/168)."
          },
          {
            "id": 125,
            "group_id": 35,
            "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
            "translation": "Аллах, Аллах — мой Господь, и я не придаю Ему сотоварищей.",
            "reference": "Abû Dâwud [1525](2/87). Also see Ŝaĥîĥ Ibn Mâjah (2/335)."
          }
        ]
      },
      {
        "group_id": 36,
        "title": "При столкновении с врагом или властями",
        "duas": [
          {
            "id": 126,
            "group_id": 36,
            "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
            "translation": "О Аллах, мы ставим Тебя перед ними и прибегаем к Тебе от их зла.",
            "reference": "Abû Dâwud [1537](2/89) and Al-Hâkim (2/142) and he authenticated it and Adh-Dhahabî agreed with him."
          },
          {
            "id": 127,
            "group_id": 36,
            "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
            "translation": "О Аллах, Ты — моя опора, и Ты — моя помощь, с Тобой я двигаюсь, с Тобой я атакую, и с Тобой я сражаюсь.",
            "reference": "Abû Dâwud [2632](3/42) and At-Tirmidhî [3584](5/572). Also see Ŝaĥîĥ At-Tirmidhî (3/183)."
          },
          {
            "id": 128,
            "group_id": 36,
            "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
            "translation": "Аллах нам достаточен, и как прекрасен Покровитель (Он).",
            "reference": "Al-Bukhârî [4563](5/172)."
          }
        ]
      },
      {
        "group_id": 37,
        "title": "Для тех, кто боится несправедливости правителя",
        "duas": [
          {
            "id": 129,
            "group_id": 37,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
            "translation": "О Аллах, Господь семи небес и великого трона, защити меня от такого-то [назовите имя] и от его союзников среди Твоих созданий, чтобы никто из них не навредил мне и не угнетал меня. Твоя защита непоколебима, Твоя хвала велика, нет божества, кроме Тебя.",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad [545]."
          },
          {
            "id": 130,
            "group_id": 37,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
            "translation": "Аллах велик, Аллах могущественнее всех созданий. Аллах могущественнее того, кого я боюсь и опасаюсь. Я прибегаю к Аллаху, нет божества, кроме Него, удерживающего семь небес от падения на землю без Его воли, от зла Твоего раба такого-то [назовите имя], его солдат, его последователей и сторонников из числа джиннов и людей. О Аллах, защити меня от их зла. Величие Твоей хвалы, защита Твоя непоколебима, благословенно Имя Твое, и нет божества, кроме Тебя.",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad (546)."
          }
        ]
      },
      {
        "group_id": 38,
        "title": "Против врагов",
        "duas": [
          {
            "id": 131,
            "group_id": 38,
            "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
            "translation": "О Аллах, Ниспосылающий Книгу, Быстрый в расчете, победи союзников. О Аллах, победи их и потряси их.",
            "reference": "Muslim [1742](3/1362)."
          }
        ]
      },
      {
        "group_id": 39,
        "title": "Когда боишься людей",
        "duas": [
          {
            "id": 132,
            "group_id": 39,
            "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
            "translation": "О Аллах, защити меня от них тем, что Ты выберешь.",
            "reference": "Muslim [3005](4/2300)."
          }
        ]
      },
      {
        "group_id": 40,
        "title": "Для того, кто сомневается в своей вере",
        "duas": [
          {
            "id": 133,
            "group_id": 40,
            "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
            "translation": "(1) Прибегать к Аллаху от Шайтана.(2) Отказаться от того, что вызывает сомнения.",
            "reference": "Al-Bukhârî [6/336](6/336) and Muslim [134,214](1/120)."
          },
          {
            "id": 134,
            "group_id": 40,
            "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
            "translation": "Я верю в Аллаха и Его посланников.",
            "reference": "Muslim [134,212](1/119-120)."
          },
          {
            "id": 135,
            "group_id": 40,
            "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
            "translation": "Он Первый и Последний, Явный и Сокрытый, и Он знает обо всем.",
            "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abî  Dâwud (3/962)."
          }
        ]
      },
      {
        "group_id": 41,
        "title": "При уплате долга",
        "duas": [
          {
            "id": 136,
            "group_id": 41,
            "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
            "translation": "О Аллах, сделай достаточным для меня то, что дозволено, и избавь меня от нужды в других Своей милостью.",
            "reference": "At-Tirmidhî [3563](5/650). Also see Ŝaĥîĥ At-Tirmidhî (3/180)."
          },
          {
            "id": 137,
            "group_id": 41,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
            "translation": "О Аллах, я прибегаю к Тебе от тревоги и печали, слабости и лени, жадности и трусости, бремени долгов и подавленности людьми.",
            "reference": "Al-Bukhârî [6363](7/158)."
          }
        ]
      },
      {
        "group_id": 53,
        "title": "Для тех, кого постигла беда",
        "duas": [
          {
            "id": 154,
            "group_id": 53,
            "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
            "translation": "Поистине, мы принадлежим Аллаху, и к Нему мы вернёмся. О Аллах, воздай мне за моё несчастье и замени его на нечто лучшее.",
            "reference": "Muslim [918](2/632)."
          }
        ]
      },
      {
        "group_id": 92,
        "title": "Страх перед ширком",
        "duas": [
          {
            "id": 203,
            "group_id": 92,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
            "translation": "О Аллах, я прибегаю к Тебе, чтобы не предать Тебе соучастников, зная об этом, и прошу у Тебя прощения за то, чего не знаю.",
            "reference": "Aĥmad (4/403). Also see Ŝaĥîĥ Al-Jâmi' [3731](3/233) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) by Al-Albânî."
          }
        ]
      },
      {
        "group_id": 94,
        "title": "Запрет придавать значения приметам",
        "duas": [
          {
            "id": 205,
            "group_id": 94,
            "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
            "translation": "О Аллах, нет примет, есть только полагание на Тебя, нет добра, кроме Твоего добра, и нет божества, кроме Тебя.",
            "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54). The Prophet (salla Allaahu ʻalayhi wa salaam) liked Al-Fa'al [الفأل](good omens). When he heard a good word from a man, he liked it and said: \"We took your good omens from your mouth\", narrated by Abû Dâwud [3917] and Imâm Aĥmad; and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah](2/363). This narration can also be found in Abu As-Shaykh's book [Akhlâq An-Nabî (salla Allaahu ʻalayhi wa salaam)] (p. 270)."
          }
        ]
      },
      {
        "group_id": 106,
        "title": "Что говорить, получив приятные или неприятные новости",
        "duas": [
          {
            "id": 218,
            "group_id": 106,
            "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
            "translation": "При получении хороших новостей скажите: (1) 'Хвала Аллаху, благодаря чьей милости совершаются добрые дела.'При получении плохих новостей скажите: (2) 'Хвала Аллаху в любых обстоятельствах.'",
            "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] and Al-Hâkim (1/499) and he authenticated it. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [4640](4/201)."
          }
        ]
      },
      {
        "group_id": 122,
        "title": "Во времена удивления и радости",
        "duas": [
          {
            "id": 240,
            "group_id": 122,
            "dua": "سُبْحَانَ اللهِ!",
            "translation": "Как совершенен Аллах!",
            "reference": "Al-Bukhârî [155](1/210), [283](1/390) and Muslim [371], [314](414), [332](4/1857)."
          },
          {
            "id": 241,
            "group_id": 122,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "Аллах велик.",
            "reference": "Al-Bukhârî [4741](8/441). Also see Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) and Aĥmad (5/218)."
          }
        ]
      },
      {
        "group_id": 123,
        "title": "При получении радостных новостей",
        "duas": [
          {
            "id": 242,
            "group_id": 123,
            "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
            "translation": "Пророк (мир ему и благословение) совершал земной поклон в благодарность Аллаху, когда получал радостные новости или новости, которые приносили радость.",
            "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] and Ibn Mâjah [1394]. Also see Ŝaĥîĥ Ibn Mâjah (1/233) and Irwâ'-ul-Ghalîl (2/226)."
          }
        ]
      },
      {
        "group_id": 126,
        "title": "Когда испуган",
        "duas": [
          {
            "id": 245,
            "group_id": 126,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "Нет божества, кроме Аллаха.",
            "reference": "Al-Bukhârî [3346](6/381) and Muslim [2880](4/2208)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 7,
    "title": "Природа",
    "group": [
      {
        "group_id": 61,
        "title": "Во время шторма",
        "duas": [
          {
            "id": 166,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
            "translation": "О Аллах, я прошу у Тебя его [ветра] блага и прибегаю к Тебе от его зла.",
            "reference": "Abû Dâwud [5097](4/326) and Ibn Mâjah [3727](2/1228). Also see Ŝaĥîĥ Ibn Mâjah (2/305)."
          },
          {
            "id": 167,
            "group_id": 61,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
            "translation": "О Аллах, я прошу у Тебя его блага, блага в нём и блага того, с чем он был послан, и прибегаю к Тебе от его зла, зла в нём и зла того, с чем он был послан.",
            "reference": "Muslim [899](2/616) and Al-Bukhârî [3206](4/76)."
          }
        ]
      },
      {
        "group_id": 62,
        "title": "Услышав гром",
        "duas": [
          {
            "id": 168,
            "group_id": 62,
            "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
            "translation": "Как совершенен Тот, Которого прославляет гром с хвалой Его, и ангелы из страха перед Ним.",
            "reference": "Al-Muwaťťa' (2/992) and Al-Albânî declared its chain to be Ŝaĥîĥ and Mawqûf."
          }
        ]
      },
      {
        "group_id": 63,
        "title": "Мольба о дожде",
        "duas": [
          {
            "id": 169,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
            "translation": "О Аллах, пошли нам дождь обильный, благодатный, полезный, а не вредный, немедленно, а не потом.",
            "reference": "Abû Dâwud [1169](1/303). Al-Albânî declared it authentic in Ŝaĥîĥ Abû Dâwud (1/216)."
          },
          {
            "id": 170,
            "group_id": 63,
            "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
            "translation": "О Аллах, даруй нам дождь, о Аллах, даруй нам дождь, о Аллах, даруй нам дождь.",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/613)."
          },
          {
            "id": 171,
            "group_id": 63,
            "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
            "translation": "О Аллах, дай воду Твоим рабам и скоту, распространи Свою милость и оживи мертвую землю.",
            "reference": "Abû Dâwud [1176](1/305) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/218)."
          }
        ]
      },
      {
        "group_id": 64,
        "title": "Когда идёт дождь",
        "duas": [
          {
            "id": 172,
            "group_id": 64,
            "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
            "translation": "О Аллах, пусть это будет дождь полезный.",
            "reference": "Al-Bukhârî [1032](2/518)."
          }
        ]
      },
      {
        "group_id": 65,
        "title": "После дождя",
        "duas": [
          {
            "id": 173,
            "group_id": 65,
            "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
            "translation": "Мы были одарены дождем по милости и милосердию Аллаха.",
            "reference": "Al-Bukhârî [846](1/205) and Muslim [71](1/83)."
          }
        ]
      },
      {
        "group_id": 66,
        "title": "Мольба о ясной погоде",
        "duas": [
          {
            "id": 174,
            "group_id": 66,
            "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
            "translation": "О Аллах, пусть дождь идёт вокруг нас, а не на нас. О Аллах, [пусть он пойдет] на пастбищах, холмах, долинах и корнях деревьев.",
            "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/614)."
          }
        ]
      },
      {
        "group_id": 67,
        "title": "При виде полумесяца",
        "duas": [
          {
            "id": 175,
            "group_id": 67,
            "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
            "translation": "Аллах велик. О Аллах, пусть этот полумесяц взойдет над нами в безопасности, вере, мире и исламе, и в соответствии со всем, что Ты любишь и одобряешь. Наш Господь и твой Господь — Аллах.",
            "reference": "At-Tirmidhî [3451](5/405) and Ad-Dârimî (1/336) and the wording is his. Also see Ŝaĥîĥ At-Tirmidhî (3/157)."
          }
        ]
      },
      {
        "group_id": 76,
        "title": "При виде первых плодов",
        "duas": [
          {
            "id": 187,
            "group_id": 76,
            "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
            "translation": "О Аллах, благослови наши плоды, благослови наш город, благослови наш са' и благослови наш мудд.",
            "reference": "Muslim [1373](2/1000)."
          }
        ]
      },
      {
        "group_id": 110,
        "title": "При крике петуха или крике осла",
        "duas": [
          {
            "id": 228,
            "group_id": 110,
            "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
            "translation": "Если вы услышите крик петуха, просите у Аллаха Его милости, ибо он увидел ангела. А если услышите крик осла, прибегайте к Аллаху от шайтана, ибо он увидел шайтана.",
            "reference": "Al-Bukhârî [3303](6/350) and Muslim [2729](4/2092)."
          }
        ]
      },
      {
        "group_id": 111,
        "title": "При лае собак ночью",
        "duas": [
          {
            "id": 229,
            "group_id": 111,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "translation": "Если вы услышите лай собак или крик ослов ночью, прибегайте к Аллаху, ибо они видят то, что вы не видите.",
            "reference": "Abû Dâwud [5103](4/327) and Aĥmad (3/306). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/961)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 8,
    "title": "Хорошие манеры",
    "group": [
      {
        "group_id": 47,
        "title": "Поздравление по случаю рождения",
        "duas": [
          {
            "id": 145,
            "group_id": 47,
            "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
            "translation": "'Пусть Аллах благословит дарованное тебе (этого ребенка), и пусть ты будешь благодарен Дарующему. Пусть он (ребенок) достигнет зрелости, и пусть Аллах дарует ему добродетель по отношению к тебе.'Ответ: 'Пусть Аллах благословит все, что Он тебе дарует! Пусть Аллах вознаградит тебя прощением, дарует тебе ребенка, подобного моему, и даст тебе обильную награду.'",
            "reference": "An-Nawawî [Al-Athkâr](pg. 349). Also see Ŝaĥîĥ Al-Athkâr of Imam An-Nawawî (2/713) by Shaykh Salîm Al-Hilâlî."
          }
        ]
      },
      {
        "group_id": 75,
        "title": "Когда тебя оскорбляют во время поста",
        "duas": [
          {
            "id": 186,
            "group_id": 75,
            "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
            "translation": "Я пощусь, я пощусь.",
            "reference": "Al-Bukhârî [1894](4/103) and Muslim [1151](2/806)."
          }
        ]
      },
      {
        "group_id": 77,
        "title": "При чихании",
        "duas": [
          {
            "id": 188,
            "group_id": 77,
            "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
            "translation": "Когда один из вас чихает, скажите: (1) 'Хвала Аллаху.', затем его брат или друг должен ответить: (2) 'Да помилует тебя Аллах.', а тот, кто чихнул, отвечает: (3) 'Да направит вас Аллах и исправит ваше состояние.'",
            "reference": "Al-Bukhârî [6224](7/125)."
          }
        ]
      },
      {
        "group_id": 78,
        "title": "Когда неверующий восхваляет Аллаха после чихания",
        "duas": [
          {
            "id": 189,
            "group_id": 78,
            "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
            "translation": "Да направит вас Аллах и исправит ваше состояние.",
            "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) and Abû Dâwud [5038](4/308). Also see Ŝaĥîĥ At-Tirmidhî (2/354)."
          }
        ]
      },
      {
        "group_id": 80,
        "title": "В первую брачную ночь или при покупке животного",
        "duas": [
          {
            "id": 191,
            "group_id": 80,
            "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
            "translation": "О Аллах, я прошу у Тебя ее добра и добра, к которому Ты ее предрасположил, и прибегаю к Тебе от ее зла и зла, к которому Ты ее предрасположил.",
            "reference": "Abû Dâwud [2160](2/248) and Ibn Mâjah [1918](1/617). Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
          }
        ]
      },
      {
        "group_id": 82,
        "title": "Когда злой",
        "duas": [
          {
            "id": 193,
            "group_id": 82,
            "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
            "translation": "Прибегаю к защите Аллаха от проклятого шайтана.",
            "reference": "Al-Bukhârî [6048](7/99) and Muslim [2610](5/2015)."
          }
        ]
      },
      {
        "group_id": 83,
        "title": "Увидев человека в беде или испытании",
        "duas": [
          {
            "id": 194,
            "group_id": 83,
            "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
            "translation": "Хвала Аллаху, Который спас меня от того, чем Он испытал тебя, и Который, несомненно, даровал мне превосходство над многими из Его творений.",
            "reference": "At-Tirmidhî [3432](5/493,494). Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
          }
        ]
      },
      {
        "group_id": 84,
        "title": "На собрании",
        "duas": [
          {
            "id": 195,
            "group_id": 84,
            "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
            "translation": "О мой Господь, прости меня и прими мое покаяние. Поистине, Ты — Принимающий покаяния, Прощающий.",
            "reference": "At-Tirmidhî [3432]. Also see Ŝaĥîĥ At-Tirmidhî (3/153) and Ŝaĥîĥ Ibn Mâjah (2/321) and the wording is At-Tirmidhî's."
          }
        ]
      },
      {
        "group_id": 85,
        "title": "Искупление грехов, произносимое в конце собрания",
        "duas": [
          {
            "id": 196,
            "group_id": 85,
            "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
            "translation": "Как совершенен Ты, о Аллах, и хвала Тебе. Свидетельствую, что нет божества, достойного поклонения, кроме Тебя. Я прошу Твоего прощения и обращаюсь к Тебе с покаянием.",
            "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
          }
        ]
      },
      {
        "group_id": 86,
        "title": "Возвращение мольбы о прощении",
        "duas": [
          {
            "id": 197,
            "group_id": 86,
            "dua": "وَلَكَ",
            "translation": "И (пусть Аллах простит) тебя.",
            "reference": "Aĥmad (5/82) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
          }
        ]
      },
      {
        "group_id": 87,
        "title": "Тому, кто оказал вам услугу",
        "duas": [
          {
            "id": 198,
            "group_id": 87,
            "dua": "جَزَاكَ اللهُ خَيْراً",
            "translation": "Пусть Аллах вознаградит тебя благом.",
            "reference": "At-Tirmidhî [2035]. Also see Ŝaĥîĥ Al-Jâmi' [6244] and Ŝaĥîĥ At-Tirmidhî (2/200)."
          }
        ]
      },
      {
        "group_id": 89,
        "title": "К тому, кто выразил свою любовь к вам ради Аллаха",
        "duas": [
          {
            "id": 200,
            "group_id": 89,
            "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
            "translation": "Пусть любит тебя Тот, ради Кого ты полюбил меня.",
            "reference": "Abû Dâwud [5125](4/333) and Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/965)."
          }
        ]
      },
      {
        "group_id": 90,
        "title": "Тому, кто предложил вам часть своего имущества",
        "duas": [
          {
            "id": 201,
            "group_id": 90,
            "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
            "translation": "Пусть Аллах благословит тебя, твою семью и имущество.",
            "reference": "Abû Dâwud [5125](4/333) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (3/965)."
          }
        ]
      },
      {
        "group_id": 91,
        "title": "Должнику, когда его долг выплачен",
        "duas": [
          {
            "id": 202,
            "group_id": 91,
            "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
            "translation": "Пусть Аллах благословит тебя, твою семью и имущество. Поистине, похвала и выполнение — это вознаграждение за ссуду.",
            "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) and Ibn Mâjah [2424](2/809). Also see Ŝaĥîĥ Ibn Mâjah (2/55)."
          }
        ]
      },
      {
        "group_id": 93,
        "title": "Ответная мольба после дарения подарка или милостыни",
        "duas": [
          {
            "id": 204,
            "group_id": 93,
            "dua": "وَفِيْكَ بَارَكَ اللهُ",
            "translation": "Пусть Аллах благословит тебя.",
            "reference": "Ibn As-Sunnî [278](pg. 138). Also see Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) with research by Bashîr Muĥammad 'Uyun."
          }
        ]
      },
      {
        "group_id": 108,
        "title": "Превосходство распространения исламского приветствия",
        "duas": [
          {
            "id": 224,
            "group_id": 108,
            "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
            "translation": "Пророк (салла Аллаху алейхи ва саллам) сказал: «Вы не войдете в рай, пока не уверуете, и не уверуете, пока не полюбите друг друга. Не указать ли вам на то, что, если вы будете делать, вы непременно будете любить друг друга? Распространяйте приветствие (салям) среди вас.»",
            "reference": "Muslim [54](1/74)."
          },
          {
            "id": 225,
            "group_id": 108,
            "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
            "translation": "Аммар бин Ясир (РадиАллаху ʻанху) сказал: «Три характеристики, которые, если их объединить, составляют веру: справедливость к себе, распространение приветствия всем людям и милостыня из того малого, что имеешь.»",
            "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
          },
          {
            "id": 226,
            "group_id": 108,
            "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
            "translation": "Абдуллах Ибн 'Амр (РадиАллаху ʻанху) передал, что человек спросил Пророка (салла Аллаху алейхи ва саллам): «Какой ислам лучше?». Он (салла Аллаху алейхи ва саллам) ответил: «Кормить (бедных) и приветствовать тех, кого знаешь и тех, кого не знаешь.»",
            "reference": "Al-Bukhârî [12](1/55) and Muslim [39](1/65)."
          }
        ]
      },
      {
        "group_id": 109,
        "title": "Ответ на приветствие неверующего",
        "duas": [
          {
            "id": 227,
            "group_id": 109,
            "dua": "وَ عَلَيْكُمْ",
            "translation": "И вам.",
            "reference": "Al-Bukhârî [6258](11/42) and Muslim [2163](4/1705)."
          }
        ]
      },
      {
        "group_id": 112,
        "title": "Тому, кого ты оскорбил",
        "duas": [
          {
            "id": 230,
            "group_id": 112,
            "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
            "translation": "О Аллах, если я оскорбил какого-либо верующего, пусть это будет причиной его приближения к Тебе в День Воскресения.",
            "reference": "Al-Bukhârî [6361](11/171) and Muslim [2601](4/2007)."
          }
        ]
      },
      {
        "group_id": 113,
        "title": "Этикет восхваления другого мусульманина",
        "duas": [
          {
            "id": 231,
            "group_id": 113,
            "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
            "translation": "Пророк (салла Аллаху алейхи ва саллам) сказал: «Если кто-то из вас должен похвалить своего товарища, пусть скажет: 'Я считаю такого-то, и Аллах является его счетоводом, я не возлагаю похвалу на кого-либо, кроме Аллаха. Я считаю его, если он знает об этом, таким-то и таким-то'.»",
            "reference": "Muslim [3000](4/2296) and Al-Bukhârî [2662]."
          }
        ]
      },
      {
        "group_id": 114,
        "title": "Для того, кого похвалили",
        "duas": [
          {
            "id": 232,
            "group_id": 114,
            "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
            "translation": "О Аллах, не наказывай меня за то, что они говорят, прости мне то, чего они не знают (и сделай меня лучше, чем они думают обо мне).",
            "reference": "Al-Bukhârî [Adab Al-Mufrad][761] and Al-Albânî declared its chain Ĥasan in Ŝaĥîĥ Adab Al-Mufrad [585]. What is between the brackets is an extension from Al-Baihaqî [Shu'ab Al-Imân](4/228) through a different way."
          }
        ]
      }
    ]
  },
  {
  "category_id": 9,
  "title": "Дом и Семья",
  "group": [
    {
      "group_id": 2,
      "title": "Когда Надеваешь Одежду",
      "duas": [
        {
          "id": 5,
          "group_id": 2,
          "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
          "translation": "Хвала Аллаху, который одел меня в эту (одежду) и даровал мне её, хотя у меня не было ни силы, ни способности.",
          "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] and Ibn Mâjah [3285]. Also see Irwâ'-ul-Ghalîl (7/47)."
        }
      ]
    },
    {
      "group_id": 3,
      "title": "Когда Надеваешь Новую Одежду",
      "duas": [
        {
          "id": 6,
          "group_id": 3,
          "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
          "translation": "О Аллах, Тебе хвала, Ты одел меня в это (одежду), я прошу Тебя о благе, которое она несёт, и о благе, для которого она была сделана, и я прошу у Тебя защиты от зла, которое в ней, и зла, для которого она была сделана.",
          "reference": "Abû Dâwud [4020] and At-Tirmidhî [1767] and Al-Baghawî. The wording is from Abû Dâwud. Also see Mukhtaŝar Shama'il At-Tirmidhî by Al-Albânî (p. 47)."
        }
      ]
    },
    {
      "group_id": 4,
      "title": "К Тому, Кто Надел Новую Одежду",
      "duas": [
        {
          "id": 7,
          "group_id": 4,
          "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
          "translation": "Пусть она послужит тебе долго, и да заменит её Аллах (другой).",
          "reference": "Abû Dâwud [4020](4/41). Also see Ŝaĥiĥ Abû Dâwud (2/760)."
        },
        {
          "id": 8,
          "group_id": 4,
          "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
          "translation": "Носи новую одежду, живи достойно и умри шахидом.",
          "reference": "Ibn Mâjah [3558](2/1178) and Al-Baghawî (12/41). Also see Ŝaĥîĥ Ibn Mâjah (2/275)."
        }
      ]
    },
    {
      "group_id": 5,
      "title": "Перед Тем, Как Раздеваться",
      "duas": [
        {
          "id": 9,
          "group_id": 5,
          "dua": "بِسْمِ اللهِ",
          "translation": "Во имя Аллаха.",
          "reference": "At-Tirmidhî [606](2/505) and Sahîh Al-Jâmi' [3210](3/203). Also see Irwâ'-ul-Ghalîl [50]."
        }
      ]
    },
    {
      "group_id": 6,
      "title": "Перед Входом В Туалет",
      "duas": [
        {
          "id": 10,
          "group_id": 6,
          "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
          "translation": "(Во имя Аллаха). О Аллах, я прибегаю к Твоей защите от зла и злодеев.",
          "reference": "Al-Bukhârî [142](1/45) and Muslim [375](1/283). The narration with the extension \"In the name of Allah\" has been collected by Sa'eed bin Manŝoor, see Fatĥ al-Bârî (1/244)."
        }
      ]
    },
    {
      "group_id": 7,
      "title": "После Выхода Из Туалета",
      "duas": [
        {
          "id": 11,
          "group_id": 7,
          "dua": "غُفْرَانَكَ",
          "translation": "Прошу Твоего прощения (Аллах).",
          "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
        }
      ]
    },
    {
      "group_id": 10,
      "title": "При Входе В Дом",
      "duas": [
        {
          "id": 16,
          "group_id": 10,
          "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
          "translation": "Во имя Аллаха, я полагаюсь на Аллаха, и нет силы и мощи, кроме как у Аллаха.",
          "reference": "Abû Dâwud [5094](4/325) and At-Tirmidhî [3427](5/490). Also see Ŝaĥiĥ At-Tirmidhî (3/151)."
        },
        {
          "id": 17,
          "group_id": 10,
          "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
          "translation": "О Аллах, я прошу у Тебя защиты, чтобы не сбиться с пути или не сбить с него других, не ошибиться или не быть ввергнутым в ошибку, не притеснить или не быть притеснённым, не поступить глупо или чтобы со мной не поступили глупо.",
          "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) and Ibn Mâjah [3884]. Also see Ŝaĥîĥ At-Tirmidhî (3/152) and Ŝaĥîĥ Ibn Mâjah (2/336)."
        }
      ]
    },
    {
      "group_id": 11,
      "title": "Когда Выходишь Из Дома",
      "duas": [
        {
          "id": 18,
          "group_id": 11,
          "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
          "translation": "Во имя Аллаха мы входим и во имя Аллаха мы выходим, и на нашего Господа мы полагаемся.",
          "reference": "Abû Dâwud [5096](4/325) and Shaykh Abdul 'Azîz bin Bâz graded its chain ĥasan in [Tuĥfat al-Akhyâr](28)."
        }
      ]
    },
    {
      "group_id": 45,
      "title": "Для Изгнания Дьявола И Его Нашептываний",
      "duas": [
        {
          "id": 141,
          "group_id": 45,
          "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
          "translation": "Ищи защиты у Аллаха от него.",
          "reference": "Abû Dâwud (1/206) and At-Tirmidhî. Also see Ŝaĥîĥ At-Tirmidhî (1/77)."
        },
        {
          "id": 142,
          "group_id": 45,
          "dua": "الأذَانُ",
          "translation": "Азан (Призыв к молитве).",
          "reference": "Al-Bukhârî [608](1/151) and Muslim [389](1/291)."
        },
        {
          "id": 143,
          "group_id": 45,
          "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
          "translation": "Истинные слова поминания и чтение Корана.",
          "reference": "Muslim [780](1/539)."
        }
      ]
    },
    {
      "group_id": 79,
      "title": "Молитва Для Молодожёнов",
      "duas": [
        {
          "id": 190,
          "group_id": 79,
          "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
          "translation": "Да благословит тебя Аллах (в отношении твоего супруга) и да благословит тебя, и да объединит вас обоих в добре.",
          "reference": "Abû Dâwud [2130], At-Tirmidhî [1091], and Ibn Mâjah [1905]. Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
        }
      ]
    },
    {
      "group_id": 81,
      "title": "Перед Половым Актом",
      "duas": [
        {
          "id": 192,
          "group_id": 81,
          "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
          "translation": "Во имя Аллаха. О Аллах, отдалите дьявола от нас и от того, что Ты даровал нам.",
          "reference": "Al-Bukhârî [3271](6/141) and Muslim [1434](2/1028)."
        }
      ]
    },
    {
      "group_id": 125,
      "title": "Когда Боязнь Угрозы Сглаза",
      "duas": [
        {
          "id": 244,
          "group_id": 125,
          "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
          "translation": "Если ты увидел что-то от брата, себя или своего имущества, что тебе понравилось, пожелай благословения для этого, ведь сглаз — это правда.",
          "reference": "Aĥmad (4/447), Ibn Mâjah [3509] and Mâlik [1697-1698]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [556](1/212). Also see research of Zâd al-Ma'âd by Al-Arnâ'ûť."
        }
      ]
    },
    {
      "group_id": 128,
      "title": "Для Защиты От Ловушек Упрямых Шайтанов",
      "duas": [
        {
          "id": 247,
          "group_id": 128,
          "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
          "translation": "Я прибегаю к защите совершенных слов Аллаха, которые не может преодолеть ни праведный, ни грешник, от всего зла, которое Он сотворил, сотворил и вывел в бытие. (Я прибегаю к защите) от зла, что спускается с неба, и от зла, что поднимается к нему. (Я прибегаю к защите) от зла, что распространилось по Земле, и от зла, что выходит из неё, и я прибегаю к защите от зла искушений ночи и дня, и от зла того, кто приходит ночью, кроме тех, кто приносит благо, о Милосердный.",
          "reference": "Aĥmad (3/419) with a Ŝaĥîĥ chain, Ibn As-Sunnî [637]. Al-Arnâ'ûť declared its chain Ŝaĥîĥ in his research of Ať-Ťaĥawiyyah (pg. 133). Also see Majma' Az-Zawâ'id (10/127)."
        }
      ]
    },
    {
      "group_id": 132,
      "title": "Общие И Полезные Правила",
      "duas": [
        {
          "id": 267,
          "group_id": 132,
          "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
          "translation": "Когда наступает ночь, удержите своих детей от выхода на улицу, потому что в это время распространяются дьяволы. Когда пройдёт немного времени, отпустите их. Закройте двери и упомяните имя Аллаха, потому что дьявол не открывает запертые двери. Затяните ваши сосуды для воды и упомяните имя Аллаха, накройте свои сосуды чем-нибудь и упомяните имя Аллаха, и погасите свои лампы.",
          "reference": "Al-Bukhârî [5623](10/88) and Muslim [2012](3/1595)."
        }
      ]
    }
  ]
},
  {
    "category_id": 10,
    "title": "Еда и напитки",
    "group": [
        {
            "group_id": 68,
            "title": "При завершении поста",
            "duas": [
                {
                    "id": 176,
                    "group_id": 68,
                    "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
                    "translation": "Жажда прошла, вены наполнились влагой, и награда подтверждена, если на то воля Аллаха.",
                    "reference": "Abû Dâwud [2357](2/306). Also see Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
                },
                {
                    "id": 177,
                    "group_id": 68,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
                    "translation": "О Аллах, я прошу Тебя Твоей милостью, которая объемлет всё, прости меня.",
                    "reference": "Ibn Mâjah [1753](1/557) and Al-Hâfiž declared it Ĥasan in this takhrîj of Al-Athkâr. Also see Sharĥ Al-Athkâr (4/342)."
                }
            ]
        },
        {
            "group_id": 69,
            "title": "Перед едой",
            "duas": [
                {
                    "id": 178,
                    "group_id": 69,
                    "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
                    "translation": "С именем Аллаха (в начале и в конце)*.",
                    "reference": "* The words in the bracket are to be said if one forgets to recite the dua before eating and remembers while eating.Abû Dâwud [3767](3/347) and At-Tirmidhî [1858](4/288). Also see Ŝaĥîĥ At-Tirmidhî (2/167)."
                },
                {
                    "id": 179,
                    "group_id": 69,
                    "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
                    "translation": "(1) «О Аллах, благослови это для нас и дай нам лучшее». Если подают молоко, то произносится следующее: (2) «О Аллах, благослови это для нас и дай нам больше его».",
                    "reference": "Abû Dâwud [3767] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî declared it weak, see Al-Kalam Ať-Ťayyib [184]."
                }
            ]
        },
        {
            "group_id": 70,
            "title": "После завершения еды",
            "duas": [
                {
                    "id": 180,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
                    "translation": "Вся хвала Аллаху, который накормил меня этим и наделил меня этим, без какой-либо моей силы или мощи.",
                    "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] and Ibn Mâjah [3285]. Also see Ŝaĥîĥ At-Tirmidhî (3/159)."
                },
                {
                    "id": 181,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
                    "translation": "Хвала Аллаху с великой, чистой и благословенной хвалой, непрекращающейся и незаменимой, Он — наш Господь.",
                    "reference": "Al-Bukhârî [5458](6/214) and At-Tirmidhî [3456](5/507) and the wording is his."
                }
            ]
        },
        {
            "group_id": 71,
            "title": "Мольба гостя за хозяина",
            "duas": [
                {
                    "id": 182,
                    "group_id": 71,
                    "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
                    "translation": "О Аллах, благослови для них то, что Ты им даровал, прости их и смилуйся над ними.",
                    "reference": "Muslim [2042](3/1615)."
                }
            ]
        },
        {
            "group_id": 72,
            "title": "К тому, кто предложил напиток или намеревался это сделать",
            "duas": [
                {
                    "id": 183,
                    "group_id": 72,
                    "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                    "translation": "О Аллах, накорми того, кто накормил меня, и дай пить тому, кто напоил меня.",
                    "reference": "Muslim [2055](3/1626)."
                }
            ]
        },
        {
            "group_id": 73,
            "title": "При завершении поста в доме кого-либо",
            "duas": [
                {
                    "id": 184,
                    "group_id": 73,
                    "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
                    "translation": "Пусть те, кто постился, прервут пост в вашем доме, пусть праведники едят вашу еду, и пусть ангелы молятся за вас.",
                    "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/730)."
                }
            ]
        },
        {
            "group_id": 74,
            "title": "Когда человек соблюдает пост, но ему предлагают еду",
            "duas": [
                {
                    "id": 185,
                    "group_id": 74,
                    "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
                    "translation": "Если кого-то из вас приглашают на еду, пусть он примет приглашение. Если он постится, пусть молится (за присутствующих), а если не постится, пусть ест. (Значение 'пусть молится' здесь означает 'пусть вознесет мольбу').",
                    "reference": "Muslim [1431](2/1054)."
                }
            ]
        }
    ]
},
  {
    "category_id": 11,
    "title": "Болезнь и Смерть",
    "group": [
      {
        "group_id": 48,
        "title": "Поручение детей под защиту Аллаха",
        "duas": [
          {
            "id": 146,
            "group_id": 48,
            "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
            "translation": "Я поручаю вас защите совершенных слов Аллаха от любого шайтана, вредоносных существ и злого глаза.",
            "reference": "Al-Bukhârî [3371](4/119)."
          }
        ]
      },
      {
        "group_id": 49,
        "title": "При посещении больного",
        "duas": [
          {
            "id": 147,
            "group_id": 49,
            "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
            "translation": "Не переживай, это (болезнь) может быть очищением, если на то будет воля Аллаха.",
            "reference": "Al-Bukhârî [3616](10/118)."
          },
          {
            "id": 148,
            "group_id": 49,
            "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
            "translation": "Я прошу Аллаха, Величайшего, Господа величественного трона, чтобы Он исцелил тебя. (Семь раз)",
            "reference": "At-Tirmidhî [2083] и Abû Dâwud [3106]. Также см. Ŝaĥîĥ At-Tirmidhî (2/210) и Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
          }
        ]
      },
      {
        "group_id": 50,
        "title": "Преимущества посещения больных",
        "duas": [
          {
            "id": 149,
            "group_id": 50,
            "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
            "translation": "Если человек навещает своего больного мусульманского брата, это как если бы он шел, собирая плоды Рая, пока не сядет, и когда он садится, его окутывает милость. И если это произошло утром, семьдесят тысяч ангелов будут молиться за него до вечера, а если вечером, то семьдесят тысяч ангелов будут молиться за него до утра.",
            "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] и Aĥmad (1/97). Также см. Ŝaĥîĥ Ibn Mâjah (1/244) и Ŝaĥîĥ At-Tirmidhî (1/286). Шейх Ахмад Шакир также подтвердил достоверность."
          }
        ]
      },
      {
        "group_id": 51,
        "title": "Когда больной утратил надежду на жизнь",
        "duas": [
          {
            "id": 150,
            "group_id": 51,
            "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
            "translation": "О Аллах, прости меня, смилуйся надо мной и соедини меня с высшими спутниками.",
            "reference": "Al-Bukhârî [4440](7/10) и Muslim [2444](4/1893)."
          },
          {
            "id": 151,
            "group_id": 51,
            "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
            "translation": "Нет божества, кроме Аллаха, поистине смерть сопровождается агонией.",
            "reference": "Al-Bukhârî [4449](8/144)."
          },
          {
            "id": 152,
            "group_id": 51,
            "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "Нет божества, кроме Аллаха, и Аллах Велик. Нет божества, кроме Аллаха, одного, без сотоварища. Нет божества, кроме Аллаха, Ему принадлежит власть и хвала. Нет божества, кроме Аллаха, и нет силы и мощи, кроме как у Аллаха.",
            "reference": "At-Tirmidhî [3430] и Ibn Mâjah [3794]. Al-Albânî подтвердил достоверность. Также см. Ŝaĥîĥ At-Tirmidhî (3/152) и Ŝaĥîĥ Ibn Mâjah (2/317)."
          }
        ]
      },
      {
        "group_id": 52,
        "title": "Назидание для умирающего",
        "duas": [
          {
            "id": 153,
            "group_id": 52,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "Тот, чьи последние слова будут 'Нет божества, кроме Аллаха', войдет в Джаннат.",
            "reference": "Abû Dâwud [3116](3/190). Также см. Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
          }
        ]
      },
      {
        "group_id": 54,
        "title": "Когда закрывают глаза покойному",
        "duas": [
          {
            "id": 155,
            "group_id": 54,
            "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
            "translation": "О Аллах, прости (имя умершего) и возвысь его степень среди праведников, и будь защитой для его потомков, и прости нас и его, о Господь миров. Расширь ему могилу и освети её.",
            "reference": "Muslim [920](2/634)."
          }
        ]
      },
      {
  "group_id": 55,
  "title": "За умершего на похоронной молитве",
  "duas": [
    {
      "id": 156,
      "group_id": 55,
      "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
      "translation": "О Аллах, прости его и смилуйся над ним, избавь его от страданий и прости его, почести его приём и расширь его вход. Омой его водой, снегом и льдом, и очисти его от грехов, как белая одежда очищается от грязи. Дай ему взамен дом лучше его прежнего, семью лучше его семьи, супругу лучше его супруги, введи его в Рай и защити его от наказания в могиле (и наказания Огня).",
      "reference": "Muslim [963](2/663)."
    },
    {
      "id": 157,
      "group_id": 55,
      "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
      "translation": "О Аллах, прости наших живых и умерших, присутствующих и отсутствующих, наших малых и великих, наших мужчин и женщин. О Аллах, кого Ты оставляешь в живых среди нас, дай прожить на Исламе, а кого забираешь среди нас, забери на вере. О Аллах, не лишай нас его награды и не дай нам сбиться с пути после него.",
      "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] и Aĥmad (2/368). Также см. Ŝaĥîĥ Ibn Mâjah (1/251)."
    },
    {
      "id": 158,
      "group_id": 55,
      "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
      "translation": "О Аллах, такой-то сын такого-то находится под Твоей защитой и покровительством, защити его от испытания могилы и наказания Огня. Поистине, Ты верен и правдив. Прости и смилуйся над ним, поистине Ты – Прощающий, Милостивый.",
      "reference": "Ibn Mâjah [1499] и Abû Dâwud (3/211). Также см. Ŝaĥîĥ Ibn Mâjah (1/251)."
    },
    {
      "id": 159,
      "group_id": 55,
      "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
      "translation": "О Аллах, Твой раб и сын Твоей рабынь нуждается в Твоей милости, а Ты не нуждаешься в его наказании. Если он был праведником, то увеличь его благодеяния, а если был грешником, то прости его грехи.",
      "reference": "Al-Hâkim (1/359 )и он подтвердил достоверность, а Ад-Дахаби согласился с ним. Также см. Aĥkâm Al-Janâ'iz от Al-Albânî (стр. 125)."
    }
  ]
},
      {
        "group_id": 56,
        "title": "Когда умерший – ребенок, на погребальной молитве",
        "duas": [
          {
            "id": 160,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
            "translation": "О Господь, сделай его предшествующей наградой и сокровищем для его родителей, и пусть он будет заступником, чьи мольбы будут приняты. О Аллах, увеличь их благие деяния через него и возвеличь их награду. Соедини его с праведными верующими, поставь его под опеку Ибрахима и защити его Своей милостью от мучений Ада. Дай ему взамен лучший дом и лучшую семью. О Аллах, прости наших предков, наше потомство и тех, кто был до нас в вере.",
            "reference": "См. Al-Mughnî от Ibn Qudâmah (3/416) и Ad-Durûs  Al-Muhimmah Li'âmah Al-Ummah от Shaykh Ibn Bâz (стр. 15)."
          },
          {
            "id": 161,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
            "translation": "О Аллах, сделай его для нас предшествующей наградой, предоплатой и воздаянием.",
            "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
          }
        ]
      },
      {
        "group_id": 57,
        "title": "Соболезнование",
        "duas": [
          {
            "id": 162,
            "group_id": 57,
            "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
            "translation": "Поистине, Аллаху принадлежит то, что Он забрал, и Ему принадлежит то, что Он дал, и у всего с Ним есть назначенный срок. Проявляй терпение и рассчитывай на награду.",
            "reference": "Al-Bukhârî [1284](2/80) и Muslim [923](2/636)."
          }
        ]
      },
      {
        "group_id": 58,
        "title": "Когда покойного кладут в могилу",
        "duas": [
          {
            "id": 163,
            "group_id": 58,
            "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
            "translation": "Во имя Аллаха и по сунне Посланника Аллаха.",
            "reference": "Abû Dâwud [3213](3/314) с достоверной цепочкой и Aĥmad (2/40) с выражением: (بسم الله و على ملة رسول الله) и его цепочка достоверна."
          }
        ]
      },
      {
        "group_id": 59,
        "title": "После погребения покойного",
        "duas": [
          {
            "id": 164,
            "group_id": 59,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
            "translation": "О Аллах, прости его, О Аллах, укрепи его.",
            "reference": "Abû Dâwud [3221](3/315) и Al-Hâkim (1/370), и он подтвердил достоверность, и Ад-Дахаби согласился с ним."
          }
        ]
      },
      {
        "group_id": 60,
        "title": "Посещение могил",
        "duas": [
          {
            "id": 165,
            "group_id": 60,
            "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
            "translation": "Мир вам, о обитатели могил, среди верующих и мусульман. Поистине, мы присоединимся к вам, если будет на то воля Аллаха. Мы просим Аллаха о благополучии для нас и для вас.",
            "reference": "Muslim [975](2/671) и Ibn Mâjah [1547](1/494), и это его слова. То, что в скобках, взято из хадиса 'Айши, собранного Muslim [974](2/671)."
          }
        ]
      },
      {
        "group_id": 124,
        "title": "Когда чувствуешь боль в теле",
        "duas": [
          {
            "id": 243,
            "group_id": 124,
            "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
            "translation": "Произнеси «Во имя Аллаха» (трижды), затем «Я ищу защиты у Аллаха и Его силы от зла, которое я ощущаю и опасаюсь» (семь раз).",
            "reference": "Muslim [2202](4/1728)."
          }
        ]
      }
    ]
  }
]








]