[
  {
      "category_id": 1,
      "title": "Sabah ve Akşam",
      "group": [
        {
          "group_id": 1,
          "title": "Uyandığında",
          "duas": [
            {
              "id": 1,
              "group_id": 1,
              "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
              "translation": "Bizi öldürdükten sonra dirilten Allah’a hamd olsun ve dönüş O’nadır.",
              "reference": "Al-Bukhârî [6312], see Fatĥ al-Bârî (11/113) and Muslim [2711](4/2083)."
            },
            {
              "id": 2,
              "group_id": 1,
              "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
              "translation": "Allah’tan başka ilah yoktur, sadece O vardır, O’nun ortağı yoktur, mülk O’nundur ve hamd O’na aittir, O her şeye kadirdir. SubhanAllah, Elhamdülillah, Allah’tan başka ilah yoktur, Allah en büyüktür. Allah’ın izni olmadan güç ve kuvvet yoktur. Ey Rabbim, beni affet. (Kim bunu söylerse affedilir ve Allah’a dua ederse duası kabul edilir; abdest alıp namaz kılarsa, namazı kabul edilir.)",
              "reference": "Al-Bukhârî [1154], see Fatĥ al-Bârî (3/39) and the wording is of Ibn Mâjah (2/335), also see Ŝaĥiĥ Ibn Mâjah (2/335). "
            },
            {
              "id": 3,
              "group_id": 1,
              "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
              "translation": "Vücuduma sağlık veren, ruhumu geri döndüren ve beni kendisini zikretmeye izin veren Allah’a hamd olsun.",
              "reference": "At-Tirmidhî [3401](5/473), also see Ŝaĥiĥ At-Tirmidhî (3/144)."
            },
            {
              "id": 4,
              "group_id": 1,
              "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
              "translation": "Al-i İmran suresinin 190-200. ayetlerini oku.",
              "reference": "Al-Bukhârî [4572], see Fatĥ al-Bârî (8/237) and Muslim [763](1/530)."
            }
          ]
        },
        {
          "group_id": 27,
          "title": "Sabah ve Akşam",
          "duas": [
            {
              "id": 75,
              "group_id": 27,
              "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
              "translation": "Sabah kalkarken Âyet el-Kürsi’yi okuyan kimse cinlerden akşama kadar korunur; akşamleyin okursa sabaha kadar korunur.",
              "reference": "Al-Hâkim (1/562) and Al-Albânî authenticated it in Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) and he attributed it to An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] and Ťabarânî [Al-Kabîr][541] and said that the latter's chain is good."
            },
            {
              "id": 76,
              "group_id": 27,
              "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
              "translation": "Şu sureleri oku:1. Sûre İhlas (Kur'ân : 112)2. Sûre Felak (Kur'ân : 113)3. Sûre Nas (Kur'ân : 114)[3 kez]",
              "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Also see Ŝaĥîĥ At-Tirmidhî (3/182)."
            },
            {
              "id": 77,
              "group_id": 27,
              "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
              "translation": "Sabaha eriştik ve tüm mülk Allah’ındır. Hamd Allah’a mahsustur. Allah’tan başka ilah yoktur, O tektir, ortağı yoktur, mülk O’nundur, hamd O’nadır, O her şeye gücü yetendir. Rabbim, senden bu günün hayrını ve ondan sonraki günlerin hayrını dilerim, bu günün şerrinden ve ondan sonraki günlerin şerrinden sana sığınırım. Rabbim, tembellikten ve kötü ihtiyarlıktan sana sığınırım. Rabbim, cehennem azabından ve kabir azabından sana sığınırım.Akşam olduğunda şu şekilde denir: Akşama eriştik ve tüm mülk Allah’ındır.Ayrıca şu şekilde denir: Allah’ım, bu gecenin ve sonraki gecelerin hayrını senden dilerim, bu gecenin ve sonraki gecelerin şerrinden sana sığınırım.",
              "reference": "Muslim [2723](4/2088)."
            },
            {
              "id": 78,
              "group_id": 27,
              "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
              "translation": "Allah’ım, senin izninle sabaha erdik, senin izninle akşama erdik, senin izninle yaşıyoruz ve ölüyoruz, ve dönüşümüz sanadır.Gece olduğunda şu şekilde denir: Allah’ım, senin izninle akşama erdik, senin izninle sabaha erdik, senin izninle yaşıyoruz ve ölüyoruz, ve dönüşümüz sanadır.",
              "reference": "At-Tirmidhî [3391](5/466). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
              "id": 79,
              "group_id": 27,
              "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
              "translation": "Allah’ım, sen benim Rabbimsin, senden başka ilah yoktur, beni sen yarattın ve ben senin kulunum, gücüm yettiğince senin ahdine ve vaadine bağlıyım, yaptığım kötülüklerin şerrinden sana sığınırım. Bana verdiğin nimetlerini kabul ediyorum ve günahlarımı itiraf ediyorum, beni bağışla, zira günahları senden başka bağışlayan yoktur.",
              "reference": "Al-Bukhârî [6306](7/150)."
            },
            {
              "id": 80,
              "group_id": 27,
              "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
              "translation": "Allah’ım, sabah vaktine ulaştım ve senin şahidin olarak, Arş'ını taşıyan melekleri, meleklerini ve tüm yarattıklarını da şahit tutuyorum ki, şüphesiz sen Allah’sın, senden başka ilah yoktur, sen teksin, ortağın yoktur, ve şüphesiz Muhammed senin kulun ve rasulündür. [Dört kez]",
              "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] and Ibn As-Sunnî [70]. Shaykh Ibn Bâz declared the chain of An-Nisâ'i and Abû Dâwud, Hasan in [Tuĥfat Al-Akhyâr][pg. 23]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [25]."
            },
            {
              "id": 81,
              "group_id": 27,
              "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
              "translation": "Allah’ım, sabaha erdiğimde bana veya yarattıklarından birine ulaşan her nimet yalnızca sendendir, sen teksin, ortağın yoktur. Sana hamd olsun, sana şükürler olsun.",
              "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Shaykh Ibn Bâz declared its chain Ĥasan in [Tuĥfat Al-Akhyâr][pg. 24]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [26]."
            },
            {
              "id": 82,
              "group_id": 27,
              "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
              "translation": "Allah’ım, bedenime sağlık ver, Allah’ım, işitme duyuma sağlık ver, Allah’ım, görme duyuma sağlık ver. Senden başka ilah yoktur. Allah’ım, senden küfür ve fakirlikten, kabir azabından sana sığınırım; senden başka ilah yoktur. [Üç kez]",
              "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 26]. Al-Albânî declared it weak. See Ďa'îf Al-J Al-Jâmi' [1210]."
            },
            {
              "id": 83,
              "group_id": 27,
              "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
              "translation": "Allah bana yeter, O'ndan başka ilah yoktur. O'na tevekkül ettim ve O, büyük Arş'ın Rabbidir. [Yedi kez]",
              "reference": "Ibn As-Sunnî [71][Marfû'] and Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic. Also see Zâd al-Ma'âd (2/376). Al-Albânî declared it weak. See Ďa'îf Abî Dâwud."
            },
            {
              "id": 84,
              "group_id": 27,
              "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
              "translation": "Allah’ım, senden dünyada ve ahirette af ve sağlık diliyorum. Allah’ım, senden dinimde, dünyamda, ailemde ve malımda af ve sağlık diliyorum. Allah’ım, ayıplarımı ört, korkularımı güvene dönüştür. Allah’ım, beni önümden, arkamdan, sağımda, solumdan ve üstümden koru, ve ayaklarımın altından kazaya uğramaktan senin büyüklüğüne sığınırım.",
              "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Also see Ŝaĥîĥ Ibn Mâjah (2/332)."
            },
            {
              "id": 85,
              "group_id": 27,
              "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
              "translation": "Allah’ım, gaybı ve görüneni bilen, göklerin ve yerin yaratıcısı, her şeyin Rabbi ve Hâkimi, şahitlik ederim ki senden başka ilah yoktur. Nefsimin şerrinden, şeytanın şerrinden ve onun şirkinden sana sığınırım ve nefsime kötülük işlememden veya başka bir Müslümana kötülük yapmaktan sana sığınırım.",
              "reference": "At-Tirmidhî [3392] and Abû Dâwud [5067]. Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
              "id": 86,
              "group_id": 27,
              "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
              "translation": "O'nun adıyla yeryüzünde ve gökyüzünde hiçbir şey zarar veremez ve O her şeyi işiten, her şeyi bilendir. [Üç kez]",
              "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Also see Ŝaĥîĥ Ibn Mâjah (2/332). Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 39]."
            },
            {
              "id": 87,
              "group_id": 27,
              "dua": " رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
              "translation": "Allah'tan, İslam'dan ve Peygamber Muhammed'den razıyım. [Üç kez]",
              "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) and At-Tirmidhî [3389](5/465). Shaykh Ibn Bâz declared it Ĥasan in [Tuĥfat Al-Akhyâr][39]."
            },
            {
              "id": 88,
              "group_id": 27,
              "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
              "translation": "Ey Hayy ve Kayyûm olan Allah'ım, rahmetinle yardım diliyorum, işlerimi düzelt ve beni bir göz açıp kapayıncaya kadar bile nefsime bırakma.",
              "reference": "Al-Hâkim (1/545); he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
            },
            {
              "id": 89,
              "group_id": 27,
              "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
              "translation": "Sabaha eriştik ve tüm mülk Alemlerin Rabbi olan Allah’ındır. Allah’ım, senden bu günün hayrını, fetihini, yardımını, nurunu, bereketini ve hidayetini dilerim ve içinde bulunan kötülükten ve sonrasındaki kötülükten sana sığınırım.Akşam olduğunda: Akşama eriştik ve tüm mülk Alemlerin Rabbi olan Allah’ındır. Allah’ım, senden bu gecenin hayrını, fetihini, yardımını, nurunu, bereketini ve hidayetini dilerim ve içinde bulunan kötülükten ve sonrasındaki kötülükten sana sığınırım.",
              "reference": "Abû Dâwud [5084](4/322), Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared its chain Ĥasan in their research of Zâd al-Ma'âd (2/273)."
            },
            {
              "id": 90,
              "group_id": 27,
              "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
              "translation": "İslam fıtratı, ihlas kelimesi, Peygamberimiz Muhammed'in dini ve atamız İbrahim'in milleti üzerine sabaha ulaştık, o hanif bir Müslüman’dı ve müşriklerden değildi.Akşam olduğunda: Akşama İslam fıtratı üzerine eriştik.",
              "reference": "Aĥmad (3/406,407) and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Also see Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
            },
            {
              "id": 91,
              "group_id": 27,
              "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
              "translation": "Allah her türlü noksandan münezzehtir ve O'nu hamd ile yüceltirim. [Yüz kez]",
              "reference": "Muslim [2723](4/2071)."
            },
            {
              "id": 92,
              "group_id": 27,
              "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
              "translation": "Allah’tan başka ilah yoktur, O tektir, ortağı yoktur, mülk O’nundur ve hamd O’nadır, O her şeye kadirdir.   veya  .",
              "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] from the ĥadîth of Abu Ayûb Al-Anŝârî  (May Allah be pleased with him). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb [650](1/272) and Tuĥfat Al-Akhyâr (pg. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] and Aĥmad (4/60). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb (1/270), Ŝaĥîĥ Abî  Dâwud  (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) and Zâd Al-Ma'âd (2/377)."
            },
            {
              "id": 93,
              "group_id": 27,
              "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
              "translation": "Allah’tan başka ilah yoktur, O tektir, ortağı yoktur, mülk O’nundur, hamd O’nadır ve O her şeye kadirdir. [Sabahleyin yüz kez]",
              "reference": "Al-Bukhârî [3293](4/95) and Muslim [2691](4/2071)."
            },
            {
              "id": 94,
              "group_id": 27,
              "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
              "translation": "Allah her türlü noksandan münezzehtir ve O'nu hamd ile yüceltirim, yaratıklarının sayısınca, kendi rızasıyla, Arş'ının ağırlığınca ve kelimelerinin mürekkebi kadar. [Sabah üç kez]",
              "reference": "Muslim [2726](4/2090)."
            },
            {
              "id": 95,
              "group_id": 27,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
              "translation": "Allah’ım, senden faydalı ilim, helal rızık ve kabul edilen amel dilerim. [Sabah vakti]",
              "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] and Ibn Mâjah [925]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic in their research of Zâd al-Ma'âd (2/375)."
            },
            {
              "id": 96,
              "group_id": 27,
              "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
              "translation": "Allah’tan af dilerim ve O'na tövbe ederim. [Günde yüz kez]",
              "reference": "Al-Bukhârî [6307](11/101) and Muslim [2702](4/2075)."
            },
            {
              "id": 97,
              "group_id": 27,
              "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
              "translation": "Allah'ın eksiksiz kelimeleriyle O'nun yarattığı her türlü kötülükten Allah'a sığınırım. [Akşamleyin üç kez]",
              "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Also see Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) and Tuĥfat Al-Akhyâr (p. 45)"
            },
            {
              "id": 98,
              "group_id": 27,
              "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
              "translation": "Allah’ım, peygamberimiz Muhammed'e salat ve selam eyle. [On kez]",
              "reference": "Ať-Ťabarânî through two chains, one of which is good. See Majm'u Az-Zawâ 'id (10/120) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
            }
          ]
        },
        {
          "group_id": 28,
          "title": "Uyumadan Önce",
          "duas": [
            {
              "id": 99,
              "group_id": 28,
              "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
              "translation": "Her gece yatağına girdiğinde, Peygamber (sallallahu aleyhi ve sellem) ellerini birleştirir, (kuru) tükürür, Kur'ân'ın son üç suresini okur, sonra elleriyle başından başlayarak yüzüne ve vücudunun mümkün olduğunca her yerine sıvazlardı; bunu üç kez yapardı.",
              "reference": "Al-Bukhârî [5017](9/62) and Muslim [2192](4/1723)."
            },
            {
              "id": 100,
              "group_id": 28,
              "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
              "translation": "Peygamber (sallallahu aleyhi ve sellem) dedi ki: 'Uyuyacağınız zaman Âyet-el Kürsi'yi okuyun, çünkü Allah'tan bir koruma size eşlik edecek ve sabaha kadar hiçbir şeytan size yaklaşamayacak.'",
              "reference": "Al-Bukhârî [2311](4/487)."
            },
            {
              "id": 101,
              "group_id": 28,
              "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
              "translation": "Peygamber (sallallahu aleyhi ve sellem) dedi ki: 'Kim gece Al-Bakara suresinin son iki ayetini okursa, bu iki ayet ona yeterli olacaktır.'",
              "reference": "Al-Bukhârî [4008](9/94) and Muslim [808](1/554)."
            },
            {
              "id": 102,
              "group_id": 28,
              "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
              "translation": "Biriniz yatağından kalkıp tekrar yatarsa, elbisesinin ucuyla yatağını üç kez silmelidir, çünkü yokluğunda ne olduğunu bilmez ve yattığında şu duayı etmelidir: 'Rabbim, adınla uzandım ve adınla kalkarım, eğer ruhumu alırsan ona merhamet et, eğer geri döndürürsen onu koru, salih kullarını koruduğun gibi.'",
              "reference": "Al-Bukhârî [6320](11/126) and Muslim [2714](4/2084)."
            },
            {
              "id": 103,
              "group_id": 28,
              "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
              "translation": "Allah’ım, şüphesiz ruhumu sen yarattın ve sen onu alacaksın, hayatı ve ölümü sana aittir. Eğer ruhumu yaşatırsan onu koru, eğer alırsan onu bağışla. Allah’ım, senden afiyet dilerim.",
              "reference": "Muslim [2712](4/2083) and Aĥmad (2/79)."
            },
            {
              "id": 104,
              "group_id": 28,
              "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
              "translation": "Allah’ım, kullarını dirilteceğin günde beni azabından koru.",
              "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
            },
            {
              "id": 105,
              "group_id": 28,
              "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
              "translation": "Allah’ım, senin adınla yaşar ve ölürüm.",
              "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
            },
            {
              "id": 106,
              "group_id": 28,
              "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
              "translation": "Allah her türlü noksandan münezzehtir [Otuz üç kez].Allah’a hamd olsun [Otuz üç kez].Allah en büyüktür [Otuz dört kez].",
              "reference": "Al-Bukhârî [3705](7/71) and Muslim [2727](4/2091)."
            },
            {
              "id": 107,
              "group_id": 28,
              "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
              "translation": "Allah’ım, yedi göğün ve yüce Arş’ın Rabbi, Rabbimiz ve her şeyin Rabbi, taneyi ve çekirdeği yaran, Tevrat, İncil ve Furkan’ı indiren sensin. Yakalayıp kontrol ettiğin her şeyin şerrinden sana sığınırım. Allah’ım, sen ilksin, senden önce hiçbir şey yoktur, sen sonsunsun, senden sonra hiçbir şey yoktur, sen yücesin, senden daha yukarıda hiçbir şey yoktur, sen gizlisin, senden daha yakın hiçbir şey yoktur. Borcumuzu öde ve bizi fakirlikten kurtar.",
              "reference": "Muslim [2713](4/2084)."
            },
            {
              "id": 108,
              "group_id": 28,
              "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
              "translation": "Bizi doyuran, içiren, bize yeten ve barındıran Allah’a hamd olsun, çünkü nice kimseler vardır ki, ne onları doyuracak ne de barındıracak kimseleri vardır.",
              "reference": "Muslim [2715](4/2085)."
            },
            {
              "id": 109,
              "group_id": 28,
              "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
              "translation": "Allah’ım, görüneni ve görünmeyeni bilen, göklerin ve yerin yaratıcısı, her şeyin Rabbi ve hükümdarı sensin. Şahitlik ederim ki, senden başka ilah yoktur. Nefsimin şerrinden, şeytanın şerrinden ve onun şirkinden sana sığınırım ve nefsime kötülük işlememden veya başka bir Müslümana kötülük yapmaktan sana sığınırım.",
              "reference": "Abû Dâwud [5083](4/317). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
            },
            {
              "id": 110,
              "group_id": 28,
              "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
              "translation": "Sûre Secde ve Sûre Mülk'ü oku.",
              "reference": "At-Tirmidhî [3404] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]. Also see Ŝaĥîĥ Al-Jâmi' [4873](4/255)."
            },
            {
              "id": 111,
              "group_id": 28,
              "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
              "translation": "Allah’ım, nefsimi sana teslim ettim, işimi sana havale ettim, yüzümü sana yönelttim, sırtımı sana dayadım, senden umarak ve korkarak, senden başka sığınak ve kurtuluş yoktur, indirdiğin Kitab’a ve gönderdiğin Peygamber’e iman ettim.",
              "reference": "Al-Bukhârî [6313,6315,7488](11/113) and Muslim [2710](4/2081)."
            }
          ]
        },
        {
          "group_id": 29,
          "title": "Gece Dönerken",
          "duas": [
            {
              "id": 112,
              "group_id": 29,
              "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
              "translation": "Allah’tan başka ilah yoktur, O tektir, kahredicidir. Göklerin, yerin ve onların arasında olanların Rabbi, Azîz ve Gaffar’dır.",
              "reference": "Al-Hâkim (1/540) and he authenticated it and Adh-Dhahabî agreed with him, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757). Also see Ŝaĥîĥ Al-Jâmi' [4693](4/213)."
            }
          ]
        },
        {
          "group_id": 30,
          "title": "Uykuda Korku, Endişe, Huzursuzluk Hissedince",
          "duas": [
            {
              "id": 113,
              "group_id": 30,
              "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
              "translation": "Allah’ın eksiksiz kelimeleriyle O’nun gazabından, cezasından, kullarının kötülüğünden, şeytanların vesveselerinden ve onların bana yaklaşmalarından Allah’a sığınırım.",
              "reference": "Abû Dâwud [3893](4/12). Also see Ŝaĥîĥ At-Tirmidhî (3/171)."
            }
          ]
        },
        {
          "group_id": 31,
          "title": "İyi veya Kötü Bir Rüya Gördüğünde",
          "duas": [
            {
              "id": 114,
              "group_id": 31,
              "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
              "translation": "Kötü bir rüya gördüğünüzde yapılacaklar:(1) Sol tarafınıza üç kez tükürün.(2) Şeytandan ve gördüğünüz kötülüğün şerrinden Allah’a sığının, üç kez.(3) Rüyayı kimseye anlatmayın.(4) Yattığınız tarafı değiştirin.",
              "reference": "Al-Bukhârî [7044] and Muslim [2261](4/1772)."
            },
            {
              "id": 115,
              "group_id": 31,
              "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
              "translation": "İsterseniz kalkıp namaz kılın.",
              "reference": "Muslim [2263](4/1773)."
            }
          ]
        }
      ]
    },
  {
      "category_id": 2,
      "title": "dua",
      "group": [
        {
          "group_id": 8,
          "title": "Abdeste Başlarken",
          "duas": [
            {
              "id": 12,
              "group_id": 8,
              "dua": "بِسْمِ اللهِ",
              "translation": "Allah'ın adıyla.",
              "reference": "Abû Dâwud [101], Ibn Mâjah [399] and Aĥmad (2/418). Also see Irwâ'-ul-Ghalîl (1/122)."
            }
          ]
        },
        {
          "group_id": 9,
          "title": "Abdesti Tamamladığında",
          "duas": [
            {
              "id": 13,
              "group_id": 9,
              "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
              "translation": "Allah’tan başka ilah olmadığına, O’nun bir olduğuna, ortağının bulunmadığına, Muhammed’in ise O’nun kulu ve elçisi olduğuna şehadet ederim.",
              "reference": "Muslim [234](1/209)."
            },
            {
              "id": 14,
              "group_id": 9,
              "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
              "translation": "Allah’ım, beni tövbe edenlerden ve temizlenenlerden eyle.",
              "reference": "At-Tirmidhî [55](1/78). Also see Ŝaĥiĥ At-Tirmidhî (1/18)."
            },
            {
              "id": 15,
              "group_id": 9,
              "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
              "translation": "Seni eksikliklerden tenzih eder ve sana hamd ederim Allah’ım. Senden başka ilah olmadığına şahitlik ederim. Senden bağışlanma diliyor ve sana tövbe ediyorum.",
              "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)."
            }
          ]
        },
        {
          "group_id": 12,
          "title": "Camiye Giderken",
          "duas": [
            {
              "id": 19,
              "group_id": 12,
              "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
              "translation": "Allah’ım! Kalbime nur, dilime nur, kulağıma nur, gözüme nur, üstüme nur, altıma nur, sağıma nur, soluma nur, önüme nur ve arkamıma nur ver. Nefsime nur ver, nurumu artır, nurumu çoğalt. Bana nur ver ve beni nur eyle. Allah’ım bana nur ihsan et, sinirlerime nur ver, bedenime nur, kanıma nur, saçıma nur ve derime nur ver. [Allah'ım! Kabrimde bana nur ver... kemiklerimde de nur ver]. [Nurumu artır, nurumu artır, nurumu artır]. [Bana üst üste nur ver].",
              "reference": "(1) Al-Bukhârî [6316](11/116) and Muslim [763](1/526,529,530).(2) At-Tirmidhî [3419](5/483)."
            }
          ]
        },
        {
          "group_id": 13,
          "title": "Camiye Girerken",
          "duas": [
            {
              "id": 20,
              "group_id": 13,
              "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
              "translation": "(Sağ ayağınla gir), ve ardından şöyle de: (Allah'ın yüce zatına, eski ve sonsuz hükümranlığına ve onun kıymetli yüzüne sığınırım, lanetli şeytandan). (Allah'ın adıyla ve dualarla). [Allah'ın Resûlü'ne selam olsun]. (Allah'ım, bana rahmet kapılarını aç).",
              "reference": "(1) Al-Hakim (1/218) and he authenticated it with the conditions of Muslim and Adh-Dhahabî agreed with him, Al-Baihaqî (2/442), and Al-Albânî  declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624).(2) Abû Dâwud [466]. Also see Ŝaĥîĥ Al-Jâmi' [4591].(3) An-Nisâ'i [88] and Al-Albânî declared it ĥasan.(4) Abû Dâwud [465](1/126). Also see Ŝaĥîĥ Al-Jâmi' [514](1/528).(5) Muslim [713](1/494), Ibn Mâjah [771] and Al-Albânî declared it ŝaĥîĥ due to its shawâhid; see Ŝaĥîĥ Ibn Mâjah (1/128-129)."
            }
          ]
        },
        {
          "group_id": 14,
          "title": "Camiden Çıkarken",
          "duas": [
            {
              "id": 21,
              "group_id": 14,
              "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢) ",
              "translation": "(Sol ayağınla çık), ve ardından şöyle de: (Allah'ın adıyla ve dualarla, Allah'ın Resûlü'ne selam olsun. Allah'ım, fazlından (ikramından) dilerim. Allah'ım, beni şeytandan koru).",
              "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) and Al-Albânî declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624)(2) See takhrîj of the previous hadith (du'a #20) and the extension( اللهم اعصمني من الشيطان الرجيم) is from Ibn Mâjah [773], see Ŝaĥîĥ Ibn Mâjah (1/129)."
            }
          ]
        },
        {
          "group_id": 15,
          "title": "Ezan Hakkında",
          "duas": [
            {
              "id": 22,
              "group_id": 15,
              "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
              "translation": "Müezzinin dediği gibi tekrarlar, ancak “Hayya 'ales-salâh” ve “Hayya 'alel-felâh” denildiğinde, “Lâ havle velâ kuvvete illâ billâh” der.",
              "reference": "Al-Bukhârî [611](1/152) and Muslim [383](1/288)."
            },
            {
              "id": 23,
              "group_id": 15,
              "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَ رَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
              "translation": "Müezzinin şehadetinden sonra şöyle der: ‘Ben de şehadet ederim ki Allah’tan başka ilah yoktur, O tektir ve ortağı yoktur. Muhammed O’nun kulu ve elçisidir. Allah’tan Rabbim olarak, Muhammed’den Resûlüm olarak, İslam’dan dinim olarak razıyım.’",
              "reference": "(1) Muslim [386](1/290).(2) Ibn Khuzaîymah [422](1/220)."
            },
            {
              "id": 24,
              "group_id": 15,
              "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
              "translation": "Müezzinin çağrısına cevap verdikten sonra Peygamber'e (salla Allaahu ʻalayhi wa salaam) salavat getirir.",
              "reference": "Muslim [384](1/288)."
            },
            {
              "id": 25,
              "group_id": 15,
              "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
              "translation": "Şöyle der: ‘Allah’ım, bu eksiksiz davetin ve kılınacak namazın Rabbi! Muhammed’e el-Vesîle ve el-Fadîle’yi ver ve onu Sana vaat edilen övülen makamda yeniden dirilt. [Şüphesiz Sen, verdiğin sözü yerine getirirsin].'",
              "reference": "Al-Bukhârî [614](1/152) and what is between the brackets is from Al-Baihaqî (1/410). Shaykh Abdul 'Azîz bin Bâz authenticated the chain of the latter in Tuĥfah Al-Akhbâr (p. 38)."
            },
            {
              "id": 26,
              "group_id": 15,
              "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
              "translation": "Kişi, ezan ile kamet arasında dua eder, çünkü o zaman yapılan dualar geri çevrilmez.",
              "reference": "At-Tirmidhî [212], Abû Dâwud [521] and Ahmad [3/119]. Also see Irwâ'-ul-Ghalîl (1/262)."
            }
          ]
        },
        {
          "group_id": 16,
          "title": "Namaza Başlarken (Tekbirden Sonra)",
          "duas": [
            {
              "id": 27,
              "group_id": 16,
              "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
              "translation": "Allah’ım! Doğu ile batı arasını uzaklaştırdığın gibi, benimle günahlarım arasını uzaklaştır. Allah’ım! Beyaz elbisenin kirden arındırıldığı gibi beni günahlarımdan arındır. Allah’ım! Beni günahlarımdan kar, su ve dolu ile yıka.",
              "reference": "Al-Bukhârî [744](1/181) and Muslim [598](1/419)."
            },
            {
              "id": 28,
              "group_id": 16,
              "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
              "translation": "Allah’ım! Seni tenzih ederim, hamdin sanadır. İsmin mübarektir, şanın yücedir. Senden başka ilah yoktur.",
              "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), and Ibn Mâjah [804, 806]. Also see Ŝaĥîĥ At-Tirmidhî (1/77) and Ŝaĥîĥ Ibn Mâjah (1/135)."
            },
            {
              "id": 29,
              "group_id": 16,
              "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلاَّ أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
              "translation": "Yüzümü, gökleri ve yeri yaratana, dosdoğru yönelttim ve ben müşriklerden değilim. Benim namazım, ibadetim, hayatım ve ölümüm, âlemlerin Rabbi olan Allah içindir. O’nun ortağı yoktur. Ben bununla emrolundum ve ben Müslümanlardanım. Allah’ım! Sen Meliksin. Senden başka ilah yoktur. Sen benim Rabbimsin ve ben Senin kulunum. Ben nefsime zulmettim ve günahımı itiraf ettim. Bütün günahlarımı bağışla. Şüphesiz günahları ancak Sen bağışlarsın. Beni güzel ahlaka yönelt. Şüphesiz, güzel ahlaka ancak Sen yöneltirsin ve kötü ahlaktan da ancak Sen koruyabilirsin. Sana kullukta bulunuyorum, Senin rızan için uğraşıyorum. Bütün hayırlar Senin elindedir. Şer ise sana ait değildir. Ben Seninle varım ve Sana döneceğim. Sen mübareksin ve yücesin. Senden bağışlanma diliyorum ve Sana tövbe ediyorum.",
              "reference": "Muslim [771](1/534)."
            },
            {
              "id": 30,
              "group_id": 16,
              "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
              "translation": "Allah’ım! Cebrail, Mikail ve İsrafil'in Rabbi! Gökleri ve yeri yaratan! Gaybı ve görüneni bilen! Sen, kullarının ihtilaf ettikleri şeyde hüküm verirsin. Hakkında ihtilaf edilen şeylerde beni izninle hakka hidayet et. Şüphesiz ki Sen, dilediğini dosdoğru yola hidayet edersin.",
              "reference": "Muslim [770](1/534)."
            },
            {
              "id": 31,
              "group_id": 16,
              "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
              "translation": "Allah en büyüktür, Allah en büyüktür, Allah en büyüktür. Hamd Allah’a mahsustur, hamd Allah’a mahsustur, hamd Allah’a mahsustur. Sabah ve akşam Allah’ı tesbih ederim. (Üç defa) Şeytanın kibrinden, nefesinden ve deliliğinden Allah’a sığınırım.",
              "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), and Muslim [601](1/420) with extension from: (مِنْ نَفْحِهِ )."
            },
            {
              "id": 32,
              "group_id": 16,
              "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ، وَ لِقَاؤُكَ الحَقُّ، وَ الجَنَّةُ حَقٌّ، وَ النَّارُ حَقٌّ، وَ النَّبِيُّونَ حَقٌّ، وَ مُحَمَّدٌﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ][اللهم لَكَ أسْلَمْتُ، وَ عَلَيْكَ تَوَكَّلْتُ، وَ بِكَ آمَنْتُ، وَ إلَيْكَ أنَبْتُ، وَ بِكَ خَاصَمْتُ، وَ إلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، و أخَّرْتُ، وَ مَا أسْرَرْتُ، وَ مَا أعْلَنْتُ][أنْتَ المُقَدِّمُ، وَ أنْتَ المُؤَخِّرُ لَا إله إلَّا أنْتَ][أنْتَ إلَهِي لَا إله إلَّا أنْتَ].",
              "translation": "Allah’ım! Hamd sanadır. Sen göklerin, yerin ve içindekilerin nurusun. Hamd sanadır. Sen göklerin, yerin ve içindekilerin yöneticisisin. Hamd sanadır. Sen göklerin, yerin ve içindekilerin Rabbisin. Hamd sanadır. Sen göklerin, yerin ve içindekilerin mülkü ve mülkün sahibisin. Hamd sanadır. Sen göklerin ve yerin Melikisin. Hamd sanadır. Sen hakikatsin, Senin vaadin haktır, Senin kavlin haktır, Seninle buluşmak haktır, cennet haktır, cehennem haktır, peygamberler haktır, Muhammed ﷺ haktır, kıyamet saati haktır. Allah’ım! Sana teslim oldum, sana tevekkül ettim, sana inandım, sana yöneldim, seninle mücadele ettim, ve senin hükmüne başvurdum. Geçmişteki ve gelecekteki, gizli ve açık işlediğim bütün günahlarımı affet. Sen, öncelik veren ve erteleyen sensin, senden başka ilah yoktur. Sen benim İlahımsın, senden başka ilah yoktur.",
              "reference": "Al-Bukhârî (3/3), (11/116), and [1120](13/371, 423, 465) and Muslim [769](1/532) in a summarised form."
            }
          ]
        },
        {
          "group_id": 17,
          "title": "Rükuya Eğilirken",
          "duas": [
            {
              "id": 33,
              "group_id": 17,
              "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
              "translation": "Yüce Rabbimi noksan sıfatlardan tenzih ederim. (Üç defa)",
              "reference": "Abû Dâwud [871],  At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
            },
            {
              "id": 34,
              "group_id": 17,
              "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
              "translation": "Seni eksikliklerden tenzih ederim Allah’ım. Hamd sanadır, beni bağışla Allah’ım.",
              "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
            },
            {
              "id": 35,
              "group_id": 17,
              "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
              "translation": "Eksikliklerden uzak, mukaddes ve meleklerin ve Ruh’un (Cebrail’in) Rabbi olan Allah’tır.",
              "reference": "Muslim [487](1/353) and Abû Dâwud [872](1/230)."
            },
            {
              "id": 36,
              "group_id": 17,
              "dua": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
              "translation": "Allah’ım! Senin için rükû ettim, Sana iman ettim ve Sana teslim oldum. Kulaklarım, gözlerim, aklım, kemiklerim, sinirlerim ve ayaklarım da Sana boyun eğdi.",
              "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] and An-Nisâ'i [2/130]. The extension is found in Ibn Ĥibân, see Ŝaĥîĥ Ibn Ĥibân [1901] and Ŝaĥîĥ Ibn Khuzaîmah [607]."
            },
            {
              "id": 37,
              "group_id": 17,
              "dua": "سُبْحَانَ ذِي الْجَبَروتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
              "translation": "Kudret, mülk, büyüklük ve azamet sahibi olan Allah’ı tesbih ederim.",
              "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) and Aĥmad (6/24)."
            }
          ]
        },
        {
          "group_id": 18,
          "title": "Rükudan Kalkarken",
          "duas": [
            {
              "id": 38,
              "group_id": 18,
              "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
              "translation": "Allah, kendisine hamd edenin hamdini işitir.",
              "reference": "Al-Bukhârî [795](2/282)."
            },
            {
              "id": 39,
              "group_id": 18,
              "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
              "translation": "Rabbimiz! Hamd sanadır. Bolca, temiz ve bereketli hamdler sanadır.",
              "reference": "Al-Bukhârî [799](2/284)."
            },
            {
              "id": 40,
              "group_id": 18,
              "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
              "translation": "Gökleri, yeri ve aralarındaki her şeyi dolduran, Senin dilediğin her şeyi kapsayan hamd sanadır. Sen övülmeye layık, şan ve büyüklük sahibisin. Kulların söylediği en doğru söz budur ve hepimiz Senin kulunuz. Allah’ım! Senin verdiğini kimse engelleyemez, Senin vermediğini kimse veremez. Senin yardımın olmadan kimseye mal, servet fayda vermez.",
              "reference": "Muslim [477](1/346)."
            }
          ]
        },
        {
          "group_id": 19,
          "title": "Secde Halinde",
          "duas": [
            {
              "id": 41,
              "group_id": 19,
              "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
              "translation": "En yüce Rabbimi noksan sıfatlardan tenzih ederim. (Üç defa)",
              "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] and Aĥmad (5/382, 394). Also see Ŝaĥîĥ At-Tirmidhî (1/83)."
            },
            {
              "id": 42,
              "group_id": 19,
              "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
              "translation": "Seni eksikliklerden tenzih ederim Allah’ım. Hamd sanadır, beni bağışla Allah’ım.",
              "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
            },
            {
              "id": 43,
              "group_id": 19,
              "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ",
              "translation": "Eksikliklerden uzak, mukaddes ve meleklerin ve Ruh’un (Cebrail’in) Rabbi olan Allah’tır.",
              "reference": "Muslim (1/533)."
            },
            {
              "id": 44,
              "group_id": 19,
              "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
              "translation": "Allah’ım! Sana secde ettim, Sana iman ettim ve Sana teslim oldum. Yüzüm, onu yaratan, ona şekil veren, onun işitme ve görme kabiliyetini yaratan Allah’a secde etti. Yaratıcıların en güzeli olan Allah ne yücedir.",
              "reference": "Muslim [771](1/534)."
            },
            {
              "id": 45,
              "group_id": 19,
              "dua": "سُبْحَانَ ذِي الْجَبَرُوتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ",
              "translation": "Kudret, mülk, büyüklük ve azamet sahibi olan Allah’ı tesbih ederim.",
              "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), and An-Nisâ'i (2/191). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/166)."
            },
            {
              "id": 46,
              "group_id": 19,
              "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
              "translation": "Allah’ım! Küçüğünü ve büyüğünü, ilkini ve sonunu, gizlisini ve aşikâr olanını, bütün günahlarımı bağışla.",
              "reference": "Muslim [483](1/350)."
            },
            {
              "id": 47,
              "group_id": 19,
              "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْذُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
              "translation": "Allah’ım! Rızanı gazabından, affını azabından koruyucu kılarak Sana sığınırım. Senden de yine Sana sığınırım. Sana olan övgüleri sayamam. Sen kendini nasıl övdüysen öylesin.",
              "reference": "Muslim [486](1/352)."
            }
          ]
        },
        {
          "group_id": 20,
          "title": "İki Secde Arasında",
          "duas": [
            {
              "id": 48,
              "group_id": 20,
              "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
              "translation": "Rabbim, beni bağışla! Rabbim, beni bağışla!",
              "reference": "Abû Dâwud [874](1/231). Also see Ŝaĥîĥ Ibn Mâjah (1/148)."
            },
            {
              "id": 49,
              "group_id": 20,
              "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
              "translation": "Allah’ım! Beni bağışla, bana merhamet et, beni doğru yola ilet, noksanlarımı gider, bana afiyet ver, bana rızık ver ve derecemi yükselt.",
              "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]. Also see Ŝaĥîĥ At-Tirmidhî (1/90) and Ŝaĥîĥ Ibn Mâjah (1/148)."
            }
          ]
        },
        {
          "group_id": 21,
          "title": "Kur'an Tilavetinde Secde Ederken",
          "duas": [
            {
              "id": 50,
              "group_id": 21,
              "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
              "translation": "Yüzüm, onu yaratan ve ona işitme ve görme kabiliyeti veren Allah’a secde etti. O’nun kudretiyle. (Yaratıcıların en güzeli olan Allah ne yücedir).",
              "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) and Al-Hâkim declated it authentic and Ad-Dhahabî agreed with him (1/220). The extension is from Ŝûrah Al-Mu'minûn."
            },
            {
              "id": 51,
              "group_id": 21,
              "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنِّي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
              "translation": "Allah’ım! Bu secdeyi bana bir sevap olarak yaz, bu secde ile benden bir günah sil, bunu benim için bir azık kıl ve bunu benden tıpkı kulun Davud’dan kabul ettiğin gibi kabul et.",
              "reference": "At-Tirmidhî [579](2/473) and Al-Al-Hâkim declared it Ŝaĥîĥ and Ad-Dhahabî agreed with him (1/219)."
            }
          ]
        },
        {
          "group_id": 22,
          "title": "Teşehhüd",
          "duas": [
            {
              "id": 52,
              "group_id": 22,
              "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
              "translation": "Tahiyyât, salât ve tayyibât Allah’adır. Ey Nebi, Allah’ın selamı, rahmeti ve bereketi senin üzerine olsun. Selam bizim ve Allah’ın salih kullarının üzerine olsun. Şehadet ederim ki, Allah’tan başka ilah yoktur ve Muhammed O’nun kulu ve Resulüdür.",
              "reference": "Al-Bukhârî [831](2/311) and Muslim [402](1/301)."
            }
          ]
        },
        {
          "group_id": 23,
          "title": "Teşehhüdden Sonra Peygamberimize (S.A.V.) Salat Okunması",
          "duas": [
            {
              "id": 53,
              "group_id": 23,
              "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
              "translation": "Allah’ım! Muhammed’e ve Muhammed’in âline, İbrahim ve İbrahim’in âline salât ettiğin gibi salât eyle. Şüphesiz Sen, Hamîd ve Mecîd’sin. Allah’ım! Muhammed’e ve Muhammed’in âline, İbrahim ve İbrahim’in âline bereket verdiğin gibi bereket ver. Şüphesiz Sen, Hamîd ve Mecîd’sin.",
              "reference": "Al-Bukhârî [337](6/408)."
            },
            {
              "id": 54,
              "group_id": 23,
              "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
              "translation": "Allah’ım! Muhammed’e, hanımlarına ve zürriyetine, İbrahim’in âline salât ettiğin gibi salât eyle. Allah’ım! Muhammed’e, hanımlarına ve zürriyetine, İbrahim’in âline bereket verdiğin gibi bereket ver. Şüphesiz Sen, Hamîd ve Mecîd’sin.",
              "reference": "Al-Bukhârî [3369](2/407) and Muslim [407](1/306)."
            }
          ]
        },
        {
          "group_id": 24,
          "title": "Son Teşehhüdden Sonra ve Selamdan Önce",
          "duas": [
            {
              "id": 55,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
              "translation": "Allah’ım! Kabir azabından, cehennem azabından, hayatın ve ölümün fitnesinden ve Mesih Deccal’in fitnesinin şerrinden Sana sığınırım.",
              "reference": "Al-Bukhârî 2/102 and Muslim 1/412."
            },
            {
              "id": 56,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
              "translation": "Allah’ım! Kabir azabından, Mesih Deccal’in fitnesinden, hayatın ve ölümün fitnesinden Sana sığınırım. Allah’ım! Günah işlemekten ve borç yükünden Sana sığınırım.",
              "reference": "Al-Bukhârî [832](2/102) and Muslim [589](1/412) and the wording is the latter's."
            },
            {
              "id": 57,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
              "translation": "Allah’ım! Nefsime çok zulmettim. Günahları ancak Sen affedersin. Katından bana bir mağfiret nasip et ve bana merhamet et. Şüphesiz Sen, çok bağışlayan ve çok merhamet edensin.",
              "reference": "Al-Bukhârî [7387](8/168) and Muslim [2705](4/2078)."
            },
            {
              "id": 58,
              "group_id": 24,
              "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
              "translation": "Allah’ım! Geçmişteki ve gelecekteki, gizlediğim ve açıkladığım, haddi aştığım ve Senin benden daha iyi bildiğin günahlarımı bağışla. Sen öne geçirirsin ve geri bırakırsın. Senden başka ilah yoktur.",
              "reference": "Muslim [771](1/534)."
            },
            {
              "id": 59,
              "group_id": 24,
              "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
              "translation": "Allah’ım! Seni anmamda, Sana şükretmemde ve Sana güzel bir şekilde ibadet etmemde bana yardım et.",
              "reference": "Abû Dâwud [1522](2/86) and An-Nisâ'i (3/53). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/284)."
            },
            {
              "id": 60,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْذُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
              "translation": "Allah’ım! Cimrilikten Sana sığınırım. Korkaklıktan Sana sığınırım. Ömrün en rezil zamanına kadar yaşamaktan Sana sığınırım. Dünya fitnesinden ve kabir azabından Sana sığınırım.",
              "reference": "Al-Bukhârî [2822](6/35)."
            },
            {
              "id": 61,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنْ النَّارِ",
              "translation": "Allah’ım! Senden cenneti dilerim ve cehennemden Sana sığınırım.",
              "reference": "Abû Dâwud [792] and Ibn Mâjah, see Ŝaĥîĥ Ibn Mâjah (2/328)."
            },
            {
              "id": 62,
              "group_id": 24,
              "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
              "translation": "Allah’ım! Gayba olan ilminden ve mahlûkata olan kudretinden ötürü, hayatı benim için hayırlı kıldığın sürece beni yaşat ve ölümü benim için hayırlı kıldığın zaman beni vefat ettir. Allah’ım! Gizlide ve açıkta Sana olan haşyetimi arttırmanı, rıza ve gazap hallerinde hak sözü söyleyebilmeyi, fakirlikte ve zenginlikte orta yolu bulabilmeyi, tükenmez nimetleri, bitmeyen göz aydınlığını, takdirinden sonra rızanı, ölümden sonraki huzurlu yaşamı, Sana kavuşmayı arzulamayı ve Sana bakmanın lezzetini nasip etmeni dilerim. Zararlı bir musibetle karşılaşmadan ve fitneye düşmeden Sana kavuşmayı dilerim. Allah’ım! Bizi iman ziyneti ile süsle ve bizi hidayet rehberlerinden eyle.",
              "reference": "An-Nisâ'i (4/54, 55) and Aĥmad (4/364). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/281)."
            },
            {
              "id": 63,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
              "translation": "Allah’ım! Senden dilerim. Çünkü Sen, doğurmayan, doğurulmayan ve hiçbir şeyin dengi olmayan, tektir, samed olan Allah’sın. Günahlarımı bağışla. Şüphesiz ki Sen, çok bağışlayansın, çok merhamet edensin.",
              "reference": "An-Nisâ'i (3/52) and Aĥmad (4/238). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/280)."
            },
            {
              "id": 64,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَسأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْذُ بِكَ مِنَ النَّارِ",
              "translation": "Allah’ım! Senden dilerim. Şüphesiz ki Sana hamdolsun, Senden başka ilah yoktur. Sen, tektir ve ortağın yoktur. Ey bağış sahibi! Ey gökleri ve yeri benzersiz yaratan! Ey celal ve ikram sahibi! Ey Hayy, ey Kayyum! Senden cenneti dilerim ve cehennemden Sana sığınırım.",
              "reference": "Abû Dâwud [1495], An-Nisâ'i (3/52), Ibn Mâjah [3858] and At-Tirmidhî [3544]. Also see Ŝaĥîĥ Ibn Mâjah (2/329)."
            },
            {
              "id": 65,
              "group_id": 24,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
              "translation": "Allah’ım! Senden dilerim, çünkü şehadet ederim ki Sen Allah’sın. Senden başka ilah yoktur. Sen, doğurmayan, doğurulmayan ve hiçbir şeyin dengi olmayan tektir, samed’sin.",
              "reference": "Abû Dâwud [1493](2/62), At-Tirmidhî [3475](5/515), Ibn Mâjah [3857](2/1267) and Aĥmad (5/360). Also see Ŝaĥîĥ Ibn Mâjah (2/329) and Ŝaĥîĥ At-Tirmidhî (3/163)."
            }
          ]
        },
        {
          "group_id": 25,
          "title": "Selamdan Sonra",
          "duas": [
            {
              "id": 66,
              "group_id": 25,
              "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
              "translation": "(1) Üç defa “Estağfirullah” dersiniz. (2) Allah’ım! Sen es-Selâm’sın ve Selam Sen’dendir. Yücesin ey celâl ve ikram sahibi.",
              "reference": "Muslim [591](1/414)."
            },
            {
              "id": 67,
              "group_id": 25,
              "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الجَدُّ",
              "translation": "Allah’tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O’nundur ve hamd O’nadır. O her şeye kadirdir. Allah’ım! Verdiğini engelleyebilecek kimse yoktur. Engellediğini verebilecek kimse yoktur. Hiçbir zenginlik Senin karşında fayda vermez.",
              "reference": "Al-Bukhârî [844](1/255) and Muslim [593](1/414)."
            },
            {
              "id": 68,
              "group_id": 25,
              "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
              "translation": "Allah’tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O’nundur ve hamd O’nadır. O her şeye kadirdir. Allah’tan başka ilah yoktur. O’ndan başka kimseye ibadet etmeyiz. Nimet O’nundur, fazilet O’nundur ve güzel övgüler O’nundur. Allah’tan başka ilah yoktur. Dini O’na has kılarak ibadet ederiz, kâfirler istemese de.",
              "reference": "Muslim [594](1/415)."
            },
            {
              "id": 69,
              "group_id": 25,
              "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
              "translation": "(1) Otuz üç defa ‘Sübhanallah’, ‘Elhamdülillah’ ve ‘Allahu ekber’ dersiniz. (2) Allah’tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O’nundur ve hamd O’nadır. O her şeye kadirdir.",
              "reference": "Muslim [597](1/418)."
            },
            {
              "id": 70,
              "group_id": 25,
              "dua": "(١) (قُلْ هُوَ اللَّهُ أَحَدٌ...)(٢) (قٌلْ أَعُوْذُ بِرَبَّ الْفَلَقِ...)(٣) (قُلْ أَعُوْذُ بِرَبَّ النَّاسِ...)",
              "translation": "Zuhr, Asr ve Isha namazlarından sonra birer defa, Fajr ve Maghrib namazlarından sonra üçer defa şu sureleri okursunuz: (1) İhlas Suresi (2) Felak Suresi (3) Nas Suresi.",
              "reference": "Abû Dâwud [1523](2/86) and An-Nisâ'i (3/68). Also see Ŝaĥîĥ At-Tirmidhî (2/8)."
            },
            {
              "id": 71,
              "group_id": 25,
              "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
              "translation": "Her namazdan sonra Ayetel Kürsi'yi okumak sünnettir: [Bakara: 255]",
              "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) and Ibn Sinnî [121]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [6464](5/339) and Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [972](2/697)."
            },
            {
              "id": 72,
              "group_id": 25,
              "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
              "translation": "Allah’tan başka ilah yoktur. O tektir, ortağı yoktur. Mülk O’nundur ve hamd O’nadır. O diriltir ve öldürür. O her şeye kadirdir. (Akşam ve sabah namazlarından sonra on defa)",
              "reference": "At-Tirmidhî [3474]5/515 and Aĥmad (4/227). Also see Zâd Al-Ma'âd (1/300)."
            },
            {
              "id": 73,
              "group_id": 25,
              "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
              "translation": "Allah’ım! Senden faydalı ilim, helal rızık ve makbul amel dilerim. (Sabah namazının selamından sonra okunur).",
              "reference": "Ibn Mâjah [925]. Also see Ŝaĥîĥ Ibn Mâjah (1/152) and Majmu' Az-Zawâ'id [95](10/111)."
            }
          ]
        },
        {
          "group_id": 32,
          "title": "Vitir Namazında Kunut Duası",
          "duas": [
            {
              "id": 116,
              "group_id": 32,
              "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْضِي وَلَا يُقْضَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
              "translation": "Allah’ım! Hidayet ettiklerinin arasında bana da hidayet ver. Afiyet verdiklerinin arasında bana da afiyet ver. Dost edindiklerinin arasında beni de dost edin. Bana verdiklerinde bereket ver. Hükmettiklerinin şerrinden beni koru. Sen hükmedersin, Sana hükmedilmez. Senden dost edindiklerin asla zelil olmaz, düşman edindiklerin de asla aziz olamaz. Rabbimiz, Sen yücesin, mübareksin.",
              "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). What is between the brackets is from Al-Baihaqî. Also see Ŝaĥîĥ At-Tirmidhî (1/144), Ŝaĥîĥ Ibn Mâjah (1/194), and Irwâ'-ul-Ghalîl (2/172)."
            },
            {
              "id": 117,
              "group_id": 32,
              "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
              "translation": "Allah’ım! Rızanı gazabından, affını azabından koruyucu kılarak Sana sığınırım. Senden de yine Sana sığınırım. Sana olan övgüleri sayamam. Sen kendini nasıl övdüysen öylesin.",
              "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], and Aĥmad (1/96,118,150). Also see Ŝaĥîĥ At-Tirmidhî (3/180), Ŝaĥîĥ Ibn Mâjah (1/194) and Irwâ'-ul-Ghalîl (2/175)."
            },
            {
              "id": 118,
              "group_id": 32,
              "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
              "translation": "Allah’ım! Ancak Sana ibadet ederiz, Sana namaz kılar ve Sana secde ederiz. Sana koşar ve Sana hizmet ederiz. Rahmetini umarız ve azabından korkarız. Şüphesiz ki Senin azabın kâfirlere isabet edecektir. Allah’ım! Senden yardım dileriz, senden mağfiret dileriz. Sana hamd ederiz ve seni inkâr etmeyiz. Sana iman ederiz ve Sana boyun eğeriz. Sana inanmayanları reddederiz ve onlardan uzak dururuz.",
              "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) and he declared its chain Ŝaĥîĥ. Al-Albânî said in [Irwâ'-ul-Ghalîl](2/170) that its chain is Ŝaĥîĥ and that the narration is mawqûf through 'Umar (RadiAllah ʻanhu)."
            }
          ]
        },
        {
          "group_id": 33,
          "title": "Vitir Namazının Selamından Hemen Sonra",
          "duas": [
            {
              "id": 119,
              "group_id": 33,
              "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
              "translation": "Melik ve Kuddüs olan Allah’ı tesbih ederim. (Üç defa, üçüncüde sesi yükselterek ve uzatarak: [Meleklerin ve Ruh’un (Cebrail’in) Rabbi] derdi.)",
              "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) and the extension in brackets is from him and its chain is Ŝaĥîĥ. Also see the research of Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť on Zâd al-Ma'âd (1/337)."
            }
          ]
        },
        {
          "group_id": 42,
          "title": "Namaz veya Tilavet Sırasında Vesvese Verildiğinde",
          "duas": [
            {
              "id": 138,
              "group_id": 42,
              "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
              "translation": "Allah’ın lanetlediği şeytandan Allah’a sığınırım, ve sol tarafına (üç defa) kuru bir şekilde tükür.",
              "reference": "Muslim [2203](4/1729)."
            }
          ]
        }
      ]
  },
  {
  "category_id": 3,
  "title": "Allah'ı Övme",
  "group": [
    {
      "group_id": 26,
      "title": "Karar Vermede Ya Da Doğru Yol Seçiminde Rehberlik Aramak İçin",
      "duas": [
        {
          "id": 74,
          "group_id": 26,
          "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
          "translation": "Câbir bin Abdullah'ın (RA) rivayet ettiğine göre, Allah Resulü (salla Allaahu ʻaleyhi ve sellem) bize bütün işlerimizde istihâre namazı kılmamızı emrederdi. Aynı şekilde bize Kur’ân’dan bir sûre öğrettiği gibi bize bunu da öğretirdi. Ve derdi ki: “Sizden biri bir işi yapmaya niyetlenirse, farz namazlardan ayrı olarak iki rekât namaz kılsın ve sonra şöyle dua etsin:‘Allah’ım, Senin ilminle hayır dilerim, kudretinle güç talep ederim ve Senin büyük lütfunu isterim. Çünkü Sen her şeye kadirsin, ben ise değilim. Sen bilirsin, ben ise bilmem. Gizlilikleri bilen Sensin. Allah’ım, bu işin benim dinim, yaşamım ve sonucum için hayırlı olduğunu biliyorsan, bunu bana nasip et, bana kolaylaştır ve bereketli kıl. Bu işin benim dinim, yaşamım ve sonucum için kötü olduğunu biliyorsan, onu benden uzaklaştır ve beni ondan uzaklaştır. Benim için hayır olanı takdir et ve beni onunla razı kıl.'(١)Yaratıcısından rehberlik isteyen, mümin kardeşleriyle istişare eden ve sonra kararlılığını sürdüren kimse pişman olmaz; çünkü Allah şöyle buyurmuştur: {…Ve onlarla istişare et. Kararını verdiğinde ise Allah'a tevekkül et…}(٢)",
          "reference": "(1) Al-Bukhârî [1162](7/162).(2) Kur'an Al-'Imran [3:159]."
        }
      ]
    },
    {
      "group_id": 43,
      "title": "İşleri Zorlaşan Kişi İçin",
      "duas": [
        {
          "id": 139,
          "group_id": 43,
          "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
          "translation": "Allah'ım, Senin kolaylaştırdığından başka hiçbir şey kolay değildir. Eğer dilersen, zorluğu da kolaylaştırırsın.",
          "reference": "Ibn Ĥibbân in his Ŝaĥîĥ [2427], Mawârid and Ibn As-Sunnî [351]. And Ibn Ĥajar said: \"This ĥadîth is Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť also declared it Ŝaĥîĥ in his takrîj of Imam Nawawî 's Athkâr (pg. 106). "
        }
      ]
    },
    {
      "group_id": 44,
      "title": "Bir Günah İşlediğinde",
      "duas": [
        {
          "id": 140,
          "group_id": 44,
          "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
          "translation": "Kim bir günah işler ve bunun sonucu olarak abdest alır, iki rekât namaz kılar ve ardından Allah'tan af dilerse, Allah onu bağışlar.",
          "reference": "Abû Dâwud [1521](2/86) and At-Tirmidhî [406,3006](2/257). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 46,
      "title": "Bir Felakete Uğradığında veya Bir İşin Tesiri Altına Girdiğinde",
      "duas": [
        {
          "id": 144,
          "group_id": 46,
          "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
          "translation": "Allah takdir etti ve dilediğini yaptı.",
          "reference": "Muslim [2664](4/2052)."
        }
      ]
    },
    {
      "group_id": 88,
      "title": "Deccal'dan Korunmak İçin",
      "duas": [
        {
          "id": 199,
          "group_id": 88,
          "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
          "translation": "Kim Kehf Suresi'nin ilk on ayetini ezberlerse, Deccal'dan korunur.",
          "reference": "Muslim [809](1/555)."
        }
      ]
    },
    {
      "group_id": 107,
      "title": "Peygamberimize (saws) Salat Ve Selam Göndermenin Fazileti",
      "duas": [
        {
          "id": 219,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
          "translation": "Peygamberimiz (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kim bana bir defa salât ederse, Allah ona on defa salât eder.'",
          "reference": "Muslim [408](1/288)."
        },
        {
          "id": 220,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
          "translation": "Peygamberimiz (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kabrimi bayram yeri haline getirmeyin. Bana salât gönderin, zira sizin salâtlarınız nerede olursanız olun bana ulaşır.'",
          "reference": "Abû Dâwud [2042](2/218) and Aĥmad (2/367). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/383)."
        },
        {
          "id": 221,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
          "translation": "Peygamberimiz (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Ben anıldığımda bana salât göndermeyen kişi cimridir.'",
          "reference": "At-Tirmidhî [3546](5/551). Also see Ŝaĥîĥ Al-Jâmi' [2787](3/25) and Ŝaĥîĥ At-Tirmidhî (3/177)."
        },
        {
          "id": 222,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
          "translation": "Peygamberimiz (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Allah'ın yeryüzünü dolaşan melekleri vardır; ümmetimin selamlarını bana iletirler.'",
          "reference": "An-Nisâ'i (3/43) and Al-Hâkim (2/421). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/274)."
        },
        {
          "id": 223,
          "group_id": 107,
          "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
          "translation": "Peygamberimiz (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Her kim bana selam verirse, Allah ruhumu bana geri verir ve ben de ona selamını alarak karşılık veririm.'",
          "reference": "Abû Dâwud (2041). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/283)."
        }
      ]
    },
    {
      "group_id": 129,
      "title": "Tevbe ve İstiğfar",
      "duas": [
        {
          "id": 248,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Vallahi, ben her gün Allah’tan yetmişten fazla defa istiğfar ederim ve O’na tevbe ederim.'",
          "reference": "Al-Bukhârî [6307](11/101)."
        },
        {
          "id": 249,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Ey insanlar! Allah’a tevbe ediniz. Zira ben, Allah’a günde yüz defa tevbe ederim.'",
          "reference": "Muslim [2702](4/2076)."
        },
        {
          "id": 250,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kim, “Büyük olan Allah’tan, kendisinden başka ilah olmayan, ebedi diri ve her şeyi ayakta tutan Allah’tan mağfiret dilerim ve O’na tevbe ederim” derse, Allah onun günahlarını bağışlar. Eğer savaştan kaçmış bile olsa.'",
          "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511) ve Adh-Dhahabî onayladı. Al-Albânî de bu hadisi sahih kabul etmiştir, bkz. Ŝaĥîĥ At-Tirmidhî (3/182)."
        },
        {
          "id": 251,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Rabbin kula en yakın olduğu an, gecenin son üçte biridir. O vakitte Allah'ı ananlardan olabilirsen, öyle ol.'",
          "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), ve Al-Hâkim. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/183)."
        },
        {
          "id": 252,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kulun Rabbine en yakın olduğu an, secdededir. O halde secdede çokça dua edin.'",
          "reference": "Muslim [482](1/350)."
        },
        {
          "id": 253,
          "group_id": 129,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Şüphesiz ki kalbime bir örtü gelir ve ben de günde yüz defa Allah’tan af dilerim.'",
          "reference": "Muslim [2702](4/2075)."
        }
      ]
    },
    {
      "group_id": 130,
      "title": "Allah'ı Zikretmenin ve O'nu Yüceltmenin Fazileti",
      "duas": [
        {
          "id": 254,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kim günde yüz defa “Sübhânallâhi ve bi hamdihi” derse, günahları deniz köpüğü kadar bile olsa silinir.'",
          "reference": "Al-Bukhârî [6405](7/168) ve Muslim [2691](4/2071)."
        },
        {
          "id": 255,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kim, “Lâ ilâhe illallah, vahdehû lâ şerîke leh, lehul mulku ve lehul hamdu ve hüve alâ külli şey’in kadîr” duasını on defa söylerse, İsmail’in soyundan dört köleyi âzat etmiş gibi olur.'",
          "reference": "Al-Bukhârî (7/67) ve Muslim (4/2017)."
        },
        {
          "id": 256,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Dilde hafif, terazide ağır ve Rahman’a sevgili olan iki söz vardır: “Sübhânallâhi ve bi hamdihi, Sübhânallâhil azîm.'",
          "reference": "Al-Bukhârî [3462](7/168) ve Muslim [2694](4/2072)."
        },
        {
          "id": 257,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Sübhânallâh, elhamdülillâh, lâ ilâhe illallâh ve Allahu ekber demek, güneşin üzerine doğduğu her şeyden daha sevimlidir.'",
          "reference": "Muslim [2695](4/2072)."
        },
        {
          "id": 258,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Her biriniz, her gün bin sevap kazanamaz mı?' Yanındaki bir sahabe sordu: 'Bir kişi nasıl bin sevap kazanır?' O şöyle cevapladı: 'Günde yüz tesbih çeker (Sübhânallâh der), böylece ona bin sevap yazılır veya ondan bin günah silinir.'",
          "reference": "Muslim [2698](4/2073)."
        },
        {
          "id": 259,
          "group_id": 130,
          "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Kim, “Sübhânallâhi’l-azîm ve bi hamdihi” derse, cennette ona bir hurma ağacı dikilir.'",
          "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) ve Adh-Dhahabî onayladı. Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [6429](5/531)."
        },
        {
          "id": 260,
          "group_id": 130,
          "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) Abdullah bin Kays'e (RadiyAllahu 'anh) şöyle dedi: 'Ey Abdullah bin Kays, sana cennet hazinelerinden birini göstereyim mi?' O da 'Evet ya Resûlallah' dedi. Peygamberimiz de şöyle buyurdu: 'Lâ havle ve lâ kuvvete illâ billâh de.'",
          "reference": "Al-Bukhârî [4205](11/213) ve Muslim [2704](4/2076)."
        },
        {
          "id": 261,
          "group_id": 130,
          "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
          "translation": "Resûlullah (salla Allaahu ʻaleyhi ve sellem) şöyle buyurdu: 'Allah’a en sevgili dört kelime vardır: “Sübhânallâh”, “Elhamdülillâh”, “Lâ ilâhe illallâh” ve “Allahu ekber”. Hangisiyle başlayacağın fark etmez.'",
          "reference": "Muslim [2137](3/1685)."
        },
        {
          "id": 262,
          "group_id": 130,
          "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
          "translation": "Bir bedevi Resûlullah’a (salla Allaahu ʻaleyhi ve sellem) gelerek şöyle dedi: 'Bana söyleyeceğim bir söz öğret.' Peygamberimiz şöyle buyurdu: 'Lâ ilâhe illallah vahdehû lâ şerîke leh, Allahu ekber kebîran, elhamdülillâhi kesîran, sübhânallâhi rabbil âlemîn, lâ havle velâ kuvvete illâ billâh'il-azîz'il-hakîm de.' Adam dedi ki: 'Bu sözler Rabbim için, ya benim için ne söyleyeyim?' Peygamberimiz de 'Allah’ım beni affet, bana merhamet et, bana hidayet et ve bana rızık ver' de.'",
          "reference": "Muslim [2696](4/2072)."
        },
        {
          "id": 263,
          "group_id": 130,
          "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
          "translation": "Bir adam İslam’a girdiğinde, Peygamber (salla Allaahu ʻaleyhi ve sellem) ona namazı öğretirdi. Sonra ona bu kelimelerle dua etmesini emrederdi: 'Allah’ım beni affet, bana merhamet et, bana hidayet et, bana sağlık ver ve bana rızık ver.'",
          "reference": "Muslim [2697](4/2073)."
        },
        {
          "id": 264,
          "group_id": 130,
          "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
          "translation": "Şüphesiz ki en faziletli dua: “Elhamdülillâh” ve en faziletli zikir: “Lâ ilâhe illallah”tır.",
          "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), ve Al-Hâkim (1/503) ve Adh-Dhahabî onayladı."
        },
        {
          "id": 265,
          "group_id": 130,
          "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
          "translation": "Bâkî kalan ve salih ameller: Sübhânallâh, Elhamdülillâh, Lâ ilâhe illallâh, Allahu ekber ve Lâ havle ve lâ kuvvete illâ billâh.",
          "reference": "Aĥmad [513](3/75) ve sahih bir isnadla rivayet edilmiştir."
        }
      ]
    },
    {
    "group_id": 131,
    "title": "Peygamberimizin (salla Allaahu ʻaleyhi ve sellem) Tesbihi Nasıl Çektiği",
    "duas": [
        {
            "id": 266,
            "group_id": 131,
            "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
            "translation": "'Abdullah ibn 'Amr (RadiyAllahu ʻanhu) şöyle dedi: 'Resûlullah'ın (salla Allaahu ʻaleyhi ve sellem) tesbihi sağ eliyle çektiğini gördüm.'",
            "reference": "Abû Dâwud [1502](2/81) ve At-Tirmidhî [3486](5/521). Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
        }
    ]
}
  ]
},
  {
    "category_id": 4,
    "title": "Hac & Umre",
    "group": [
      {
        "group_id": 115,
        "title": "Hac veya Umre Yapan Kişinin Telbiyyesi",
        "duas": [
          {
            "id": 233,
            "group_id": 115,
            "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
            "translation": "İşte buradayım Allah'ım, (davetine icabet ettim), işte buradayım. İşte buradayım, Senin ortağın yok, işte buradayım. Şüphesiz hamd, nimet ve mülk yalnızca Sana aittir. Senin ortağın yoktur.",
            "reference": "Al-Bukhârî [1549](3/408) ve Muslim [1184](2/841)."
          }
        ]
      },
      {
        "group_id": 116,
        "title": "Hacerü'l-Esved'den Geçerken Tekbir Getirmek",
        "duas": [
          {
            "id": 234,
            "group_id": 116,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "Allah en büyüktür.",
            "reference": "Al-Bukhârî [1612](1/476)."
          }
        ]
      },
      {
        "group_id": 117,
        "title": "Yemeni Köşesi ile Hacerü'l-Esved Arasında",
        "duas": [
          {
            "id": 235,
            "group_id": 117,
            "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
            "translation": "Ey Rabbimiz! Bize dünyada iyilik ver, ahirette de iyilik ver ve bizi ateşin azabından koru.",
            "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) ve Al-Baghawî Sharĥ As-Sunnah (7/128). Al-Albânî, Ŝaĥîĥ Abû Dâwud'da (1/354) bunu hasen olarak kabul etmiştir.(2) Sûrah Al-Baqarah: 201."
          }
        ]
      },
      {
        "group_id": 118,
        "title": "Safa Ve Merve Dağlarında",
        "duas": [
          {
            "id": 236,
            "group_id": 118,
            "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
            "translation": "Şüphesiz Safa ve Merve Allah'ın (şiarlarından) ibadet yerlerindendir… Allah'tan başka ibadet edilecek kimse yoktur, Allah en büyüktür. Allah'tan başka ibadet edilecek kimse yoktur, yalnız başına, ortağı olmaksızın O vardır. Mülk ve hamd yalnız O'na aittir ve O her şeye gücü yetendir. Allah'tan başka ibadet edilecek kimse yoktur, yalnız başına. O vaadini yerine getirdi, kuluna yardım etti ve müttefikleri tek başına mağlup etti.",
            "reference": "Muslim [1218](2/888)."
          }
        ]
      },
      {
        "group_id": 119,
        "title": "Arafat Günü",
        "duas": [
          {
            "id": 237,
            "group_id": 119,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "Allah'tan başka ibadet edilecek kimse yoktur, yalnız başına, ortağı yoktur. Mülk ve hamd yalnızca O'na aittir ve O her şeye gücü yetendir.",
            "reference": "At-Tirmidhî [3585]. Al-Albânî, Ŝaĥîĥ At-Tirmidhî (3/184) ve Al-Aĥâdîth Aŝ-Ŝaĥîĥah (4/6) adlı eserlerde bunu sahih olarak kabul etmiştir."
          }
        ]
      },
      {
        "group_id": 120,
        "title": "Müzdelife'de Zikir",
        "duas": [
          {
            "id": 238,
            "group_id": 120,
            "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
            "translation": "Peygamber (salla Allaahu ʻaleyhi ve sellem) Al-Kaswa'ya binerek Al-Maş'ar Al-Haram'a ulaştı, kıbleye döndü, Allah'a dua etti, büyüklüğünü ve birliğini yüceltti. Güneş doğmadan önce hareket etmeden önce orada durdu.",
            "reference": "Muslim [1218](2/891)."
          }
        ]
      },
      {
        "group_id": 121,
        "title": "Cemarat'ta Her Taşı Attığında",
        "duas": [
          {
            "id": 239,
            "group_id": 121,
            "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
            "translation": "Peygamber (salla Allaahu ʻaleyhi ve sellem), her taş attığında tekbir getirirdi. İlk ve ikinci cemaratlardan sonra kıbleye dönerek ellerini kaldırıp dua ederdi. Ancak Akabe Cemresi'ne gelince, taş atar ve tekbir getirir, ama orada durmazdı.",
            "reference": "Al-Bukhârî [1752, 1753](3/583-584), ayrıca bkz. Al-Bukhârî [1750](3/581) ve Muslim [1296]."
          }
        ]
      },
      {
        "group_id": 127,
        "title": "Kurban Keserken Veya Bir Kurban Sunarken",
        "duas": [
          {
            "id": 246,
            "group_id": 127,
            "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
            "translation": "Allah'ın adıyla ve Allah en büyüktür. Allah'ım, bu Senden ve Sana aittir. Allah'ım, bunu benden kabul et.",
            "reference": "Muslim [1966](3/1557) ve Baihaqî (9/287). Köşeli parantez içindekiler Baihaqî ve diğer kaynaklardan alınmıştır."
          }
        ]
      }
    ]
  },
  {
    "category_id": 5,
    "title": "Seyahat",
    "group": [
      {
        "group_id": 95,
        "title": "Bir Hayvana Binildiğinde Veya Herhangi Bir Ulaşım Aracına Binildiğinde",
        "duas": [
          {
            "id": 206,
            "group_id": 95,
            "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
            "translation": "Allah'ın adıyla ve bütün övgüler Allah'a mahsustur. O ne yücedir, bu (ulaşımı) hizmetimize sunan O’dur. Biz bunu başaramazdık ve dönüşümüz Rabbimize olacaktır. Bütün övgüler Allah'adır, bütün övgüler Allah'adır, bütün övgüler Allah'adır. Allah en büyüktür, Allah en büyüktür, Allah en büyüktür. Sen ne yücesin, ey Allah'ım, gerçekten nefsime zulmettim, beni bağışla, çünkü günahları bağışlayacak olan sadece Sensin.",
            "reference": "Abû Dâwud [2602](3/34) ve At-Tirmidhî [3446](5/510). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/156)."
          }
        ]
      },
      {
        "group_id": 96,
        "title": "Seyahat İçin",
        "duas": [
          {
            "id": 207,
            "group_id": 96,
            "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
            "translation": "(1) Allah en büyüktür, Allah en büyüktür, Allah en büyüktür. O ne yücedir ki bu (ulaşımı) hizmetimize sunmuştur, biz bunu başaramazdık ve dönüşümüz Rabbimize olacaktır. Allah'ım, bu yolculuğumuzda Senden iyilik ve takva istiyoruz, Senin hoşnut olacağın ameller istiyoruz. Allah'ım, yolculuğumuzu kolaylaştır ve mesafesini çabuk kat etmemizi sağla. Allah'ım, Sen bu yolculukta bize arkadaşsın ve ailemizin vekilisin. Allah'ım, yolculuğun zorluklarından, kalplerin değişmesinden ve kötü bir duruma düşmekten, mal ve aile ile ilgili kötü bir sondan Sana sığınırım.Dönerken aynı dua şu ekle yapılır:(2) 'Dönüyoruz, tövbe ediyoruz, ibadet ediyoruz ve Rabbimize hamd ediyoruz.'",
            "reference": "Muslim [1342](2/998)."
          }
        ]
      },
      {
        "group_id": 97,
        "title": "Bir Kasaba Veya Köye Girerken",
        "duas": [
          {
            "id": 208,
            "group_id": 97,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
            "translation": "Allah'ım, yedi göğün ve onların gölgesindekilerin Rabbi, yedi yerin ve onların taşıdıklarının Rabbi, şeytanların ve onların saptırdıklarının Rabbi, rüzgarların ve savurduklarının Rabbi, bu köyün iyiliğini, onun sakinlerinin iyiliğini ve içindeki her şeyin iyiliğini Senden istiyorum. Bu köyün kötülüğünden, onun sakinlerinin kötülüğünden ve içindeki her şeyin kötülüğünden Sana sığınıyorum.",
            "reference": "Al-Hâkim (2/100) ve Al-Hâkim bunu sahih olarak sınıflandırmış ve Adh-Dhahabî de ona katılmıştır. Ayrıca bkz. Ibn As-Sunnî [524], Al-Hâfiž Takrîj Al-Athkâr'da (5/154) bunu hasen olarak kabul etmiştir. Şeyh Ibn Bâz, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548]'de zincirin hasen olduğunu söylemiştir. Ayrıca bkz. Tuĥfat Al-Akhyâr (s. 37)."
          }
        ]
      },
      {
        "group_id": 98,
        "title": "Pazara Girerken",
        "duas": [
          {
            "id": 209,
            "group_id": 98,
            "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
            "translation": "Allah'tan başka ibadet edilecek kimse yoktur, O'nun ortağı yoktur, mülk ve hamd O'na aittir. O hayat verir ve öldürür, O diridir ve asla ölmez. Tüm iyilik O'nun elindedir ve O her şeye gücü yetendir.",
            "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) ve Ibn Mâjah [2235]. Al-Albânî, Ŝaĥîĥ Ibn Mâjah (2/21) ve Ŝaĥîĥ At-Tirmidhî (3/152)'de bunu hasen olarak sınıflandırmıştır."
          }
        ]
      },
      {
        "group_id": 99,
        "title": "Binek Hayvanı (veya Ulaşım Aracı) Terslendiğinde",
        "duas": [
          {
            "id": 210,
            "group_id": 99,
            "dua": "بِسْمِ اللهِ",
            "translation": "Allah'ın adıyla.",
            "reference": "Abû Dâwud [4982](4/296). Al-Albânî bunu Ŝaĥîĥ Abû Dâwud (3/941)'de sahih olarak sınıflandırmıştır."
          }
        ]
      },
      {
        "group_id": 100,
        "title": "Seyahat Edenin Yerleşik İçin Duası",
        "duas": [
          {
            "id": 211,
            "group_id": 100,
            "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
            "translation": "Sizi Allah'ın himayesine emanet ediyorum; O'nun himayesindekiler asla ziyan olmaz.",
            "reference": "Aĥmad (2/403) ve Ibn Mâjah [2825](2/943). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (2/133)."
          }
        ]
      },
      {
        "group_id": 101,
        "title": "Yerleşiğin Seyahat Eden İçin Duası",
        "duas": [
          {
            "id": 212,
            "group_id": 101,
            "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
            "translation": "Dinini, emanetini ve amellerinin sonunu Allah'a emanet ediyorum.",
            "reference": "Aĥmad (2/7) ve At-Tirmidhî [3443](5/499). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (2/155)."
          },
          {
            "id": 213,
            "group_id": 101,
            "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
            "translation": "Allah sana takva versin, günahlarını affetsin ve nerede olursan ol, sana her türlü hayrı kolaylaştırsın.",
            "reference": "At-Tirmidhî [3444]. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/155)."
          }
        ]
      },
      {
        "group_id": 102,
        "title": "Yükselirken Veya İnerken Zikir",
        "duas": [
          {
            "id": 214,
            "group_id": 102,
            "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
            "translation": "Yükselirken (1) 'Allah en büyüktür', inerken ise (2) 'Allah ne yücedir' zikri söylenir.",
            "reference": "Al-Bukhârî [2993](6/135)."
          }
        ]
      },
      {
        "group_id": 103,
        "title": "Seyahatte Sabah Vakti Geldiğinde Dua",
        "duas": [
          {
            "id": 215,
            "group_id": 103,
            "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
            "translation": "Bir şahit, Allah’a övgülerimizi işitsin, üzerimizdeki nimetlerini görsün. Rabbimiz, bizi koru, üzerimize lütfunu dök ve bizi her türlü kötülükten kurtar. Cehennem ateşinden Allah’a sığınırım.",
            "reference": "Muslim [2718](4/2086)."
          }
        ]
      },
      {
        "group_id": 104,
        "title": "Bir Yerde Dururken Veya Geceyi Geçirirken",
        "duas": [
          {
            "id": 216,
            "group_id": 104,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
            "translation": "Allah’ın mükemmel sözlerine, yarattığı şeylerin şerrinden sığınırım.",
            "reference": "Muslim [2708](4/2080)."
          }
        ]
      },
      {
        "group_id": 105,
        "title": "Seyahatten Dönerken Dua",
        "duas": [
          {
            "id": 217,
            "group_id": 105,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
            "translation": "Allah en büyüktür, Allah en büyüktür, Allah en büyüktür. Allah’tan başka ibadet edilecek kimse yoktur, O'nun ortağı yoktur. Mülk ve hamd O’na aittir, O her şeye gücü yetendir. Dönüyoruz, tövbe ediyoruz, ibadet ediyoruz ve Rabbimize hamd ediyoruz. Allah vaadini yerine getirdi, kuluna yardım etti ve düşmanları tek başına mağlup etti.",
            "reference": "Al-Bukhârî [1797](7/163) ve Muslim [1344](2/980)."
          }
        ]
      }
    ]
  },
  {
      "category_id": 6,
      "title": "Sevinç ve Keder",
      "group": [
        {
          "group_id": 34,
          "title": "Kaygı ve Üzüntü İçin",
          "duas": [
            {
              "id": 120,
              "group_id": 34,
              "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
              "translation": "Allah'ım, ben Senin kulunum, Senin kulunun oğluyum, Senin cariyenin oğluyum. Alnım Senin elinde, hükmün üzerimde geçerlidir ve takdirin üzerimde adildir. Kendini adlandırdığın, kitabında indirdiğin, yarattıklarından birine öğrettiğin ya da gizli ilimde yanında sakladığın her isimle Senden, Kur'an'ı kalbimin baharı, göğsümün nuru, üzüntümün gidericisi ve kederimin yok edicisi kılmanı istiyorum.",
              "reference": "Aĥmad (1/391). Al-Albânî Al-Kalam Ať-Ťayyib [124]’de sahih olduğunu belirtmiştir."
            },
            {
              "id": 121,
              "group_id": 34,
              "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
              "translation": "Allah'ım, kaygı ve üzüntüden, zayıflık ve tembellikten, cimrilik ve korkaklıktan, borcun yükünden ve insanların baskısından Sana sığınırım.",
              "reference": "Al-Bukhârî [6363](7/158), bkz. Fatĥ al-Bârî (11/173)."
            }
          ]
        },
        {
          "group_id": 35,
          "title": "Keder İçindeki Biri İçin",
          "duas": [
            {
              "id": 122,
              "group_id": 35,
              "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
              "translation": "Yüce ve Halim olan Allah'tan başka ilah yoktur. Muhteşem arşın Rabbi olan Allah'tan başka ilah yoktur. Göklerin, yerin ve yüce arşın Rabbi olan Allah'tan başka ilah yoktur.",
              "reference": "Al-Bukhârî [6346](7/154) ve Muslim [2730](4/2092)."
            },
            {
              "id": 123,
              "group_id": 35,
              "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
              "translation": "Allah'ım, rahmetini umuyorum, beni bir göz kırpması kadar bile nefsime bırakma ve işlerimin tamamını düzelt. Senden başka ilah yoktur.",
              "reference": "Abû Dâwud [5090](4/324) ve Aĥmad (5/42). Al-Albânî Ŝaĥîĥ Abî Dâwud (3/959)’da sahih olduğunu belirtmiştir."
            },
            {
              "id": 124,
              "group_id": 35,
              "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
              "translation": "Senden başka ibadet edilecek yoktur. Sen ne yücesin, gerçekten zalimlerden oldum.",
              "reference": "At-Tirmidhî [3505](5/529) ve Al-Hâkim (1/505) ve bunu sahih saymıştır ve Adh-Dhahabî ona katılmıştır. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/168)."
            },
            {
              "id": 125,
              "group_id": 35,
              "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
              "translation": "Allah, Allah Rabbimdir, O'na hiçbir şeyi ortak koşmam.",
              "reference": "Abû Dâwud [1525](2/87). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (2/335)."
            }
          ]
        },
        {
          "group_id": 36,
          "title": "Düşmanla Veya Yetkililerle Karşılaştığında",
          "duas": [
            {
              "id": 126,
              "group_id": 36,
              "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
              "translation": "Allah'ım, onları sana havale ediyoruz ve onların şerrinden Sana sığınıyoruz.",
              "reference": "Abû Dâwud [1537](2/89) ve Al-Hâkim (2/142) ve bunu sahih saymıştır ve Adh-Dhahabî ona katılmıştır."
            },
            {
              "id": 127,
              "group_id": 36,
              "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
              "translation": "Allah'ım, Sen benim destekçimsin, Sen yardımcım, Seninle hareket ederim, Seninle savaşırım, Seninle mücadele ederim.",
              "reference": "Abû Dâwud [2632](3/42) ve At-Tirmidhî [3584](5/572). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/183)."
            },
            {
              "id": 128,
              "group_id": 36,
              "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
              "translation": "Allah bize yeter, O ne güzel vekildir.",
              "reference": "Al-Bukhârî [4563](5/172)."
            }
          ]
        },
        {
          "group_id": 37,
          "title": "Bir Valinin Zulmünden Korkan Kişi İçin",
          "duas": [
            {
              "id": 129,
              "group_id": 37,
              "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
              "translation": "Allah'ım, yedi göğün ve büyük arşın Rabbi! Sen beni falanca oğlu falancadan ve onun yandaşlarından, yaratıklarının şerrinden koru; onların zulmüne veya haksızlığına uğramayayım. Senin himayene giren yüceltilir, Senin övgün şereflidir. Senden başka ilah yoktur.",
              "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] ve Al-Albânî Ŝaĥîĥ Al-Adab Al-Mufrad [545]’de sahih olduğunu belirtmiştir."
            },
            {
              "id": 130,
              "group_id": 37,
              "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
              "translation": "Allah en büyüktür, O yarattıklarının hepsinden daha üstündür. Allah, korktuğum ve endişe ettiğim her şeyden daha yücedir. Yedi göğü Allah'ın izni olmadan yer üzerine düşmekten alıkoyan Allah'a sığınıyorum. Allah'ım, falanca kulunun ve onun askerlerinin, takipçilerinin ve yandaşlarının; cinlerden ve insanlardan bana karşı yapacakları şerlerden beni koru. Senin yüceliğin ve adaletin çok yücedir. Senin koruman çok değerli, ismin mübarektir. Senden başka ibadet edilecek ilah yoktur.",
              "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] ve Al-Albânî Ŝaĥîĥ Al-Adab Al-Mufrad (546)'de sahih olduğunu belirtmiştir."
            }
          ]
        },
        {
          "group_id": 38,
          "title": "Düşmanlara Karşı",
          "duas": [
            {
              "id": 131,
              "group_id": 38,
              "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
              "translation": "Allah'ım, kitabı indiren Sensin, hesapları çabuk gören Sensin. Ahzabı mağlup et. Allah'ım, onları mağlup et ve onları sars.",
              "reference": "Muslim [1742](3/1362)."
            }
          ]
        },
        {
          "group_id": 39,
          "title": "Bir Grup İnsandan Korktuğunda",
          "duas": [
            {
              "id": 132,
              "group_id": 39,
              "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
              "translation": "Allah'ım, onlardan beni dilediğin şekilde koru.",
              "reference": "Muslim [3005](4/2300)."
            }
          ]
        },
        {
          "group_id": 40,
          "title": "İmanında Şüpheye Düşen Kişi İçin",
          "duas": [
            {
              "id": 133,
              "group_id": 40,
              "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
              "translation": "(1) Şeytandan Allah'a sığın.(2) Seni şüpheye düşüren şeyden vazgeç.",
              "reference": "Al-Bukhârî [6/336](6/336) ve Muslim [134,214](1/120)."
            },
            {
              "id": 134,
              "group_id": 40,
              "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
              "translation": "Allah'a ve O'nun elçilerine inandım.",
              "reference": "Muslim [134,212](1/119-120)."
            },
            {
              "id": 135,
              "group_id": 40,
              "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
              "translation": "O, İlk ve Son, Zahir ve Batın'dır ve O her şeyi bilendir.",
              "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) ve Al-Albânî bunu Ŝaĥîĥ Abî  Dâwud (3/962)'de sahih olarak sınıflandırmıştır."
            }
          ]
        },
        {
          "group_id": 41,
          "title": "Borcu Ödemek İçin",
          "duas": [
            {
              "id": 136,
              "group_id": 41,
              "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
              "translation": "Allah'ım, helalini haramına karşı bana yeterli kıl ve lütfunla başkalarına ihtiyaç duymamı engelle.",
              "reference": "At-Tirmidhî [3563](5/650). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/180)."
            },
            {
              "id": 137,
              "group_id": 41,
              "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
              "translation": "Allah'ım, kaygı ve üzüntüden, zayıflık ve tembellikten, cimrilik ve korkaklıktan, borcun yükünden ve insanların baskısından Sana sığınırım.",
              "reference": "Al-Bukhârî [6363](7/158)."
            }
          ]
        },
        {
          "group_id": 53,
          "title": "Bir Musibete Uğrayan Kişi İçin",
          "duas": [
            {
              "id": 154,
              "group_id": 53,
              "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
              "translation": "Şüphesiz Allah'tan geldik ve O'na döneceğiz. Allah'ım, bu musibetten dolayı beni mükâfatlandır ve bana bunun yerine daha hayırlısını ver.",
              "reference": "Muslim [918](2/632)."
            }
          ]
        },
        {
          "group_id": 92,
          "title": "Şirk Korkusu İçin",
          "duas": [
            {
              "id": 203,
              "group_id": 92,
              "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
              "translation": "Allah'ım, bildiğim halde Sana şirk koşmaktan Sana sığınırım ve bilmediğim şeylerden dolayı Senden bağışlanma dilerim.",
              "reference": "Aĥmad (4/403). Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [3731](3/233) ve Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) Al-Albânî tarafından."
            }
          ]
        },
        {
          "group_id": 94,
          "title": "Uğursuzluk İsnat Etmeme Uyarısı İçin",
          "duas": [
            {
              "id": 205,
              "group_id": 94,
              "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
              "translation": "Allah'ım, Senden başka hiçbir uğursuzluk yoktur, sadece Sana güven var. Senden başka hiçbir iyilik yoktur ve Senden başka ibadet edilecek ilah yoktur.",
              "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] ve Al-Albânî bunu [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54)'de sahih olarak sınıflandırmıştır."
            }
          ]
        },
        {
          "group_id": 106,
          "title": "Sevindirici veya Üzücü Bir Haber Alındığında",
          "duas": [
            {
              "id": 218,
              "group_id": 106,
              "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
              "translation": "Sevindirici bir haber alındığında şunu söyle: (1) 'Bütün iyilikler Allah'ın nimetiyle tamamlanır, Allah'a hamd olsun.'Üzücü bir haber alındığında şunu söyle: (2) 'Her durumda Allah'a hamd olsun.'",
              "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] ve Al-Hâkim (1/499) ve sahih olduğunu onaylamıştır. Al-Albânî bunu Ŝaĥîĥ Al-Jâmi' [4640](4/201)'de onaylamıştır."
            }
          ]
        },
        {
          "group_id": 122,
          "title": "Hayranlık ve Sevinç Anlarında",
          "duas": [
            {
              "id": 240,
              "group_id": 122,
              "dua": "سُبْحَانَ اللهِ!",
              "translation": "Allah ne mükemmeldir!",
              "reference": "Al-Bukhârî [155](1/210), [283](1/390) ve Muslim [371], [314](414), [332](4/1857)."
            },
            {
              "id": 241,
              "group_id": 122,
              "dua": "اللهُ أَكْبَرُ",
              "translation": "Allah en büyüktür.",
              "reference": "Al-Bukhârî [4741](8/441). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) ve Aĥmad (5/218)."
            }
          ]
        },
        {
          "group_id": 123,
          "title": "Sevindirici Haber Alındığında",
          "duas": [
            {
              "id": 242,
              "group_id": 123,
              "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
              "translation": "Peygamber (salla Allahu aleyhi ve sellem) sevindirici bir haber aldığında ya da bir olaydan mutlu olduğunda Allah’a şükür secdesine kapanırdı.",
              "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] ve Ibn Mâjah [1394]. Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/233) ve Irwâ'-ul-Ghalîl (2/226)."
            }
          ]
        },
        {
          "group_id": 126,
          "title": "Korkuya Kapıldığında",
          "duas": [
            {
              "id": 245,
              "group_id": 126,
              "dua": "لَا إلَهَ إلَّا اللهُ",
              "translation": "Allah’tan başka ilah yoktur.",
              "reference": "Al-Bukhârî [3346](6/381) ve Muslim [2880](4/2208)."
            }
          ]
        }
      ]
    },
  {
      "category_id": 7,
      "title": "Doğa",
      "group": [
          {
              "group_id": 61,
              "title": "Bir Fırtına Esnasında",
              "duas": [
                  {
                      "id": 166,
                      "group_id": 61,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
                      "translation": "Allah'ım, ondan hayır dilerim ve onun şerrinden Sana sığınırım.",
                      "reference": "Abû Dâwud [5097](4/326) ve Ibn Mâjah [3727](2/1228). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (2/305)."
                  },
                  {
                      "id": 167,
                      "group_id": 61,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
                      "translation": "Allah'ım, ondan hayır, içindeki hayır ve onunla gönderilen hayır dilerim, şerrinden, içindeki şerden ve onunla gönderilen şerden Sana sığınırım.",
                      "reference": "Muslim [899](2/616) ve Al-Bukhârî [3206](4/76)."
                  }
              ]
          },
          {
              "group_id": 62,
              "title": "Gök Gürültüsü Duyulduğunda",
              "duas": [
                  {
                      "id": 168,
                      "group_id": 62,
                      "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
                      "translation": "O (Zat) ne yücedir ki gök gürültüsü O'nu över ve melekler O'ndan korkarak O'nu tesbih eder.",
                      "reference": "Al-Muwaťťa' (2/992) ve Al-Albânî onun zincirinin Ŝaĥîĥ ve Mawqûf olduğunu belirtmiştir."
                  }
              ]
          },
          {
              "group_id": 63,
              "title": "Yağmur İçin",
              "duas": [
                  {
                      "id": 169,
                      "group_id": 63,
                      "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
                      "translation": "Allah'ım, bize yararlı, bol ve bereketli, zararsız, hemen gelen yağmur ver.",
                      "reference": "Abû Dâwud [1169](1/303). Al-Albânî, bunu Ŝaĥîĥ Abû Dâwud (1/216)'de sahih olarak sınıflandırmıştır."
                  },
                  {
                      "id": 170,
                      "group_id": 63,
                      "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
                      "translation": "Allah'ım, bize yardım et, Allah'ım, bize yardım et, Allah'ım, bize yardım et.",
                      "reference": "Al-Bukhârî [1013](1/224) ve Muslim [897](2/613)."
                  },
                  {
                      "id": 171,
                      "group_id": 63,
                      "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
                      "translation": "Allah'ım, kullarına ve hayvanlarına su ver, rahmetini yay ve ölü toprağını dirilt.",
                      "reference": "Abû Dâwud [1176](1/305) ve Al-Albânî, bunu Ŝaĥîĥ Abû Dâwud (1/218)'de Hasan olarak belirtmiştir."
                  }
              ]
          },
          {
              "group_id": 64,
              "title": "Yağmur Yağdığında",
              "duas": [
                  {
                      "id": 172,
                      "group_id": 64,
                      "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
                      "translation": "Allah'ım, faydalı bir yağmur olsun.",
                      "reference": "Al-Bukhârî [1032](2/518)."
                  }
              ]
          },
          {
              "group_id": 65,
              "title": "Yağmurdan Sonra",
              "duas": [
                  {
                      "id": 173,
                      "group_id": 65,
                      "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
                      "translation": "Allah'ın lütfu ve rahmeti ile bize yağmur verildi.",
                      "reference": "Al-Bukhârî [846](1/205) ve Muslim [71](1/83)."
                  }
              ]
          },
          {
              "group_id": 66,
              "title": "Havanın Açılması İçin Dua",
              "duas": [
                  {
                      "id": 174,
                      "group_id": 66,
                      "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
                      "translation": "Allah'ım, yağmuru etrafımıza yağdır, üzerimize değil; Allah'ım, (yağmuru) otlaklara, tepelere, vadilere ve ağaçların köklerine yağdır.",
                      "reference": "Al-Bukhârî [1013](1/224) ve Muslim [897](2/614)."
                  }
              ]
          },
          {
              "group_id": 67,
              "title": "Hilal Görüldüğünde",
              "duas": [
                  {
                      "id": 175,
                      "group_id": 67,
                      "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
                      "translation": "Allah en büyüktür. Allah'ım, hilali üzerimize güven, iman, selamet ve İslam ile doğur; Rabbimizin hoşnut olacağı şeylerde bize muvaffakiyet ver. Rabbimiz ve senin Rabbin Allah'tır.",
                      "reference": "At-Tirmidhî [3451](5/405) ve Ad-Dârimî (1/336) ve ifadenin şekli ona aittir. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/157)."
                  }
              ]
          },
          {
              "group_id": 76,
              "title": "Erken veya Olgunlaşmamış Meyve Görüldüğünde",
              "duas": [
                  {
                      "id": 187,
                      "group_id": 76,
                      "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
                      "translation": "Allah'ım, meyvemizi bereketlendir, şehrimizi bereketlendir, ölçeğimizi bereketlendir ve ölçüm birimimizi bereketlendir.",
                      "reference": "Muslim [1373](2/1000)."
                  }
              ]
          },
          {
              "group_id": 110,
              "title": "Bir Horozun Ötüşünü Veya Bir Eşeğin Anırmasını Duyduğunda",
              "duas": [
                  {
                      "id": 228,
                      "group_id": 110,
                      "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
                      "translation": "Eğer horozun ötüşünü duyarsanız, Allah'ın lütfunu isteyin, çünkü o bir melek görmüştür; eğer eşeğin anırmasını duyarsanız, Allah’a sığının, çünkü o bir şeytan görmüştür.",
                      "reference": "Al-Bukhârî [3303](6/350) ve Muslim [2729](4/2092)."
                  }
              ]
          },
          {
              "group_id": 111,
              "title": "Geceleri Köpeklerin Havlamasını Duyduğunuzda",
              "duas": [
                  {
                      "id": 229,
                      "group_id": 111,
                      "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
                      "translation": "Geceleri köpeklerin havlamasını ya da eşeklerin anırmasını duyduğunuzda, Allah’a sığının; çünkü onlar sizin görmediğinizi görür.",
                      "reference": "Abû Dâwud [5103](4/327) ve Aĥmad (3/306). Al-Albânî, bunu Ŝaĥîĥ Abû Dâwud (3/961)'de sahih olarak sınıflandırmıştır."
                  }
              ]
          }
      ]
  },
  {
      "category_id": 8,
      "title": "İyi Ahlak",
      "group": [
          {
              "group_id": 47,
              "title": "Doğum Münasebetiyle Tebrik",
              "duas": [
                  {
                      "id": 145,
                      "group_id": 47,
                      "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
                      "translation": "'Allah sana bahşettiği bu çocukta sana bereket versin ve onu sana bağışlayan kişiye şükret. O, olgunlaşsın ve Allah ona sana iyi davranmayı nasip etsin.'Cevap olarak: 'Allah sana bahşettiği her şeye bereket versin! Allah seni bağışlamasıyla mükâfatlandırsın, sana benimkine benzer bir evlat bahşetsin ve sana bol mükâfat versin.'",
                      "reference": "An-Nawawî [Al-Athkâr](pg. 349). Ayrıca bkz. Ŝaĥîĥ Al-Athkâr of Imam An-Nawawî (2/713) by Shaykh Salîm Al-Hilâlî."
                  }
              ]
          },
          {
              "group_id": 75,
              "title": "Oruçluyken Hakarete Uğrayan Kimse",
              "duas": [
                  {
                      "id": 186,
                      "group_id": 75,
                      "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
                      "translation": "Ben oruçluyum, ben oruçluyum.",
                      "reference": "Al-Bukhârî [1894](4/103) ve Muslim [1151](2/806)."
                  }
              ]
          },
          {
              "group_id": 77,
              "title": "Hapşırdığında",
              "duas": [
                  {
                      "id": 188,
                      "group_id": 77,
                      "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
                      "translation": "Biriniz hapşırdığında, şöyle desin: (1) 'Allah'a hamd olsun.' Sonra kardeşi veya arkadaşı şöyle cevap versin: (2) 'Allah sana rahmet etsin.' Hapşıran kişi ise şöyle cevap versin: (3) 'Allah seni doğruya yöneltsin ve işlerini düzeltsin.'",
                      "reference": "Al-Bukhârî [6224](7/125)."
                  }
              ]
          },
          {
              "group_id": 78,
              "title": "Bir Gayrimüslim Allah’ı Övdüğünde",
              "duas": [
                  {
                      "id": 189,
                      "group_id": 78,
                      "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
                      "translation": "Allah sizi doğru yola yöneltsin ve işlerinizi düzeltsin.",
                      "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) ve Abû Dâwud [5038](4/308). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (2/354)."
                  }
              ]
          },
          {
              "group_id": 80,
              "title": "Düğün Gecesi Veya Hayvan Satın Alırken",
              "duas": [
                  {
                      "id": 191,
                      "group_id": 80,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
                      "translation": "Allah'ım, onun içindeki iyilik ve ona yatkın kıldığın iyilik için Sana yalvarırım ve onun içindeki kötülük ve ona yatkın kıldığın kötülükten Sana sığınırım.",
                      "reference": "Abû Dâwud [2160](2/248) ve Ibn Mâjah [1918](1/617). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/324)."
                  }
              ]
          },
          {
              "group_id": 82,
              "title": "Öfkelendiğinde",
              "duas": [
                  {
                      "id": 193,
                      "group_id": 82,
                      "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
                      "translation": "Lanetlenmiş şeytandan Allah'a sığınırım.",
                      "reference": "Al-Bukhârî [6048](7/99) ve Muslim [2610](5/2015)."
                  }
              ]
          },
          {
              "group_id": 83,
              "title": "Birini Musibette Görünce",
              "duas": [
                  {
                      "id": 194,
                      "group_id": 83,
                      "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
                      "translation": "Beni senin sınandığın şeyden kurtaran ve beni yarattıklarının çoğu üzerinde faziletli kılan Allah’a hamdolsun.",
                      "reference": "At-Tirmidhî [3432](5/493,494). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/153)."
                  }
              ]
          },
          {
              "group_id": 84,
              "title": "Bir Toplantıda Veya Mecliste",
              "duas": [
                  {
                      "id": 195,
                      "group_id": 84,
                      "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
                      "translation": "Rabbim, beni bağışla ve tövbemi kabul et. Şüphesiz Sen, tövbeleri çokça kabul edensin ve çok bağışlayansın.",
                      "reference": "At-Tirmidhî [3432]. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/153) ve Ŝaĥîĥ Ibn Mâjah (2/321)."
                  }
              ]
          },
          {
              "group_id": 85,
              "title": "Bir Toplantı Veya Meclisin Sonunda Günahların Kefareti İçin Yapılan Dua",
              "duas": [
                  {
                      "id": 196,
                      "group_id": 85,
                      "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
                      "translation": "Allah’ım, ne yücesin ve Sana hamd ederim. Şahitlik ederim ki Senden başka ibadete layık hiçbir ilah yoktur. Senden mağfiret diler ve Sana tövbe ederim.",
                      "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/153)."
                  }
              ]
          },
          {
              "group_id": 86,
              "title": "Bir Bağışlama Duası Geri Döndürülürken",
              "duas": [
                  {
                      "id": 197,
                      "group_id": 86,
                      "dua": "وَلَكَ",
                      "translation": "Ve (Allah seni) bağışlasın.",
                      "reference": "Aĥmad (5/82) ve An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
                  }
              ]
          },
          {
              "group_id": 87,
              "title": "Size İyilik Yapan Birine",
              "duas": [
                  {
                      "id": 198,
                      "group_id": 87,
                      "dua": "جَزَاكَ اللهُ خَيْراً",
                      "translation": "Allah seni hayırla mükâfatlandırsın.",
                      "reference": "At-Tirmidhî [2035]. Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [6244] ve Ŝaĥîĥ At-Tirmidhî (2/200)."
                  }
              ]
          },
          {
              "group_id": 89,
              "title": "Sizi Allah Rızası İçin Seven Birine",
              "duas": [
                  {
                      "id": 200,
                      "group_id": 89,
                      "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
                      "translation": "Beni sevdiğin Allah seni de sevsin.",
                      "reference": "Abû Dâwud [5125](4/333) ve Al-Albânî bunu Ŝaĥîĥ Abû Dâwud (3/965)'de sahih olarak sınıflandırmıştır."
                  }
              ]
          },
          {
              "group_id": 90,
              "title": "Size Malından Teklif Eden Birine",
              "duas": [
                  {
                      "id": 201,
                      "group_id": 90,
                      "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
                      "translation": "Allah sana, ailene ve malına bereket versin.",
                      "reference": "Abû Dâwud [5125](4/333) ve Al-Albânî bunu Ŝaĥîĥ Abû Dâwud (3/965)'de sahih olarak sınıflandırmıştır."
                  }
              ]
          },
          {
              "group_id": 91,
              "title": "Borçlu Borcunu Ödeyince Yapılan Dua",
              "duas": [
                  {
                      "id": 202,
                      "group_id": 91,
                      "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
                      "translation": "Allah sana, ailene ve malına bereket versin. Borcun karşılığı ancak teşekkür ve ödemedir.",
                      "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) ve Ibn Mâjah [2424](2/809). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (2/55)."
                  }
              ]
          },
          {
              "group_id": 93,
              "title": "Birine Hediye Veya Sadaka Verildikten Sonra Yapılan Dua",
              "duas": [
                  {
                      "id": 204,
                      "group_id": 93,
                      "dua": "وَفِيْكَ بَارَكَ اللهُ",
                      "translation": "Allah sana bereket versin.",
                      "reference": "Ibn As-Sunnî [278](pg. 138). Ayrıca bkz. Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) araştırması Bashîr Muĥammad 'Uyun tarafından yapılmıştır."
                  }
              ]
          },
          {
              "group_id": 108,
              "title": "İslami Selamı Yaymanın Fazileti",
              "duas": [
                  {
                      "id": 224,
                      "group_id": 108,
                      "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
                      "translation": "Peygamber (salla Allaahu ʻalayhi wa salaam) dedi ki: 'Birbirinizi sevmedikçe cennete giremezsiniz, ve iman etmedikçe birbirinizi sevemezsiniz. Size bir şey söyleyeyim mi, eğer yaparsanız birbirinizi seversiniz? Aranızda selamı yayın.'",
                      "reference": "Muslim [54](1/74)."
                  },
                  {
                      "id": 225,
                      "group_id": 108,
                      "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
                      "translation": "'Ammâr bin Yâsir (RadiAllah ʻanhu) dedi ki: 'Üç özellik, kim onları bir araya getirirse, imanını tamamlamış olur: Kendine karşı adil olmak, herkese selam vermek ve elindeki azı infak etmek (yardım etmek).'",
                      "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
                  },
                  {
                      "id": 226,
                      "group_id": 108,
                      "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
                      "translation": "'Abdullah Ibn 'Amr (RadiAllah ʻanhu) bildirdiğine göre bir adam Peygambere (salla Allaahu ʻalayhi wa salaam) sordu: 'Hangi İslam en iyisidir?' O (salla Allaahu ʻalayhi wa salaam) dedi ki: 'Yemek yedirmek ve tanıdığın tanımadığın herkese selam vermek.'",
                      "reference": "Al-Bukhârî [12](1/55) ve Muslim [39](1/65)."
                  }
              ]
          },
          {
              "group_id": 109,
              "title": "Bir Gayrimüslime Selam Verirken",
              "duas": [
                  {
                      "id": 227,
                      "group_id": 109,
                      "dua": "وَ عَلَيْكُمْ",
                      "translation": "Ve size de.",
                      "reference": "Al-Bukhârî [6258](11/42) ve Muslim [2163](4/1705)."
                  }
              ]
          },
          {
              "group_id": 112,
              "title": "Birine Hakaret Ettiğinizde Yapılacak Dua",
              "duas": [
                  {
                      "id": 230,
                      "group_id": 112,
                      "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
                      "translation": "Allah’ım, herhangi bir mümine hakaret ettiysem, onu Kıyamet Günü Sana yakınlaştırıcı bir sebep yap.",
                      "reference": "Al-Bukhârî [6361](11/171) ve Muslim [2601](4/2007)."
                  }
              ]
          },
          {
              "group_id": 113,
              "title": "Bir Müslümanı Överken Edepli Olmak",
              "duas": [
                  {
                      "id": 231,
                      "group_id": 113,
                      "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
                      "translation": "Peygamber (salla Allaahu ʻalayhi wa salaam) dedi ki: 'Biriniz arkadaşını övecekse, kaçınılmaz olarak şöyle desin: 'Falan kişiyi iyi olarak kabul ediyorum ve Allah onun hesabını görecektir. Allah’tan başka hiç kimseyi övmem; onu iyi olarak kabul ediyorum—eğer bunu biliyorsa—şu ve şu şekilde.'",
                      "reference": "Muslim [3000](4/2296) ve Al-Bukhârî [2662]."
                  }
              ]
          },
          {
              "group_id": 114,
              "title": "Övülen Kişi İçin",
              "duas": [
                  {
                      "id": 232,
                      "group_id": 114,
                      "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
                      "translation": "Allah’ım, söyledikleri şeylerden dolayı beni cezalandırma, bilmedikleri şeylerden dolayı beni bağışla (ve beni sandıklarından daha iyi yap).",
                      "reference": "Al-Bukhârî [Adab Al-Mufrad][761] ve Al-Albânî bunun zincirini Ŝaĥîĥ Adab Al-Mufrad [585]'de hasen olarak sınıflandırmıştır. Köşeli parantez içindekiler, Al-Baihaqî [Shu'ab Al-Imân](4/228) yoluyla başka bir kaynaktan alınmıştır."
                  }
              ]
          }
      ]
  },
  {
  "category_id": 9,
  "title": "Ev ve Aile",
  "group": [
    {
      "group_id": 2,
      "title": "Elbise Giyerken",
      "duas": [
        {
          "id": 5,
          "group_id": 2,
          "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
          "translation": "Beni bu elbise ile giydiren ve bana güçsüz ve aciz olduğum halde onu sağlayan Allah'a hamdolsun.",
          "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] ve Ibn Mâjah [3285]. Ayrıca bkz. Irwâ'-ul-Ghalîl (7/47)."
        }
      ]
    },
    {
      "group_id": 3,
      "title": "Yeni Bir Elbise Giyerken",
      "duas": [
        {
          "id": 6,
          "group_id": 3,
          "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
          "translation": "Allah’ım! Sana hamdolsun, beni bu elbise ile giydirdin. Onun hayrını ve yapılma amacı doğrultusunda hayır getirmesini dilerim ve onun şerrinden ve yapılma amacı doğrultusundaki şerden Sana sığınırım.",
          "reference": "Abû Dâwud [4020] ve At-Tirmidhî [1767] ve Al-Baghawî. Söz, Abû Dâwud'a aittir. Ayrıca bkz. Mukhtaŝar Shama'il At-Tirmidhî by Al-Albânî (s. 47)."
        }
      ]
    },
    {
      "group_id": 4,
      "title": "Birine Yeni Bir Elbise Giydiğinde",
      "duas": [
        {
          "id": 7,
          "group_id": 4,
          "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
          "translation": "Onu eskiten ve Allah senin için yenisini nasip etsin.",
          "reference": "Abû Dâwud [4020](4/41). Ayrıca bkz. Ŝaĥiĥ Abû Dâwud (2/760)."
        },
        {
          "id": 8,
          "group_id": 4,
          "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
          "translation": "Yeni elbise giy, övgüyle yaşa ve şehit olarak öl.",
          "reference": "Ibn Mâjah [3558](2/1178) ve Al-Baghawî (12/41). Ayrıca bkz. Ŝaĥiĥ Ibn Mâjah (2/275)."
        }
      ]
    },
    {
      "group_id": 5,
      "title": "Elbise Çıkarmadan Önce",
      "duas": [
        {
          "id": 9,
          "group_id": 5,
          "dua": "بِسْمِ اللهِ",
          "translation": "Allah’ın adıyla.",
          "reference": "At-Tirmidhî [606](2/505) ve Sahîh Al-Jâmi' [3210](3/203). Ayrıca bkz. Irwâ'-ul-Ghalîl [50]."
        }
      ]
    },
    {
      "group_id": 6,
      "title": "Tuvalete Girmeden Önce",
      "duas": [
        {
          "id": 10,
          "group_id": 6,
          "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
          "translation": "(Allah’ın adıyla). Allah’ım, kötü şeylerden ve kötülük yapanlardan Sana sığınırım.",
          "reference": "Al-Bukhârî [142](1/45) ve Muslim [375](1/283). 'Allah’ın adıyla' ilavesi Sa'eed bin Manŝoor tarafından rivayet edilmiştir, bkz. Fatĥ al-Bârî (1/244)."
        }
      ]
    },
    {
      "group_id": 7,
      "title": "Tuvaletten Çıktıktan Sonra",
      "duas": [
        {
          "id": 11,
          "group_id": 7,
          "dua": "غُفْرَانَكَ",
          "translation": "Allah'ım, Senden af diliyorum.",
          "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] ve An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
        }
      ]
    },
    {
      "group_id": 10,
      "title": "Eve Girerken",
      "duas": [
        {
          "id": 16,
          "group_id": 10,
          "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
          "translation": "Allah’ın adıyla, Allah’a tevekkül ettim, güç ve kuvvet ancak Allah’ın izniyledir.",
          "reference": "Abû Dâwud [5094](4/325) ve At-Tirmidhî [3427](5/490). Ayrıca bkz. Ŝaĥiĥ At-Tirmidhî (3/151)."
        },
        {
          "id": 17,
          "group_id": 10,
          "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
          "translation": "Allah’ım! Yanılmam veya yanıltılmam, kaymam veya kaydırılmam, zulmetmem veya zulme uğramam, cahillik yapmam veya bana karşı cahillik yapılmasından Sana sığınırım.",
          "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) ve Ibn Mâjah [3884]. Ayrıca bkz. Ŝaĥiĥ At-Tirmidhî (3/152) ve Ŝaĥiĥ Ibn Mâjah (2/336)."
        }
      ]
    },
    {
      "group_id": 11,
      "title": "Evden Çıkarken",
      "duas": [
        {
          "id": 18,
          "group_id": 11,
          "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
          "translation": "Allah’ın adıyla girdik, Allah’ın adıyla çıktık ve Rabbimiz Allah’a tevekkül ettik.",
          "reference": "Abû Dâwud [5096](4/325) ve Şeyh Abdul 'Azîz bin Bâz, Tuĥfat al-Akhyâr'da senedini hasen olarak değerlendirmiştir (28)."
        }
      ]
    },
    {
      "group_id": 45,
      "title": "Şeytan ve Vesveselerini Uzaklaştırmak İçin",
      "duas": [
        {
          "id": 141,
          "group_id": 45,
          "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
          "translation": "Allah’a sığın.",
          "reference": "Abû Dâwud (1/206) ve At-Tirmidhî. Ayrıca bkz. Ŝaĥiĥ At-Tirmidhî (1/77)."
        },
        {
          "id": 142,
          "group_id": 45,
          "dua": "الأذَانُ",
          "translation": "Ezan (Namaz için çağrı).",
          "reference": "Al-Bukhârî [608](1/151) ve Muslim [389](1/291)."
        },
        {
          "id": 143,
          "group_id": 45,
          "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
          "translation": "Zikirler ve Kur’an okuma.",
          "reference": "Muslim [780](1/539)."
        }
      ]
    },
    {
      "group_id": 79,
      "title": "Yeni Evlenenlere",
      "duas": [
        {
          "id": 190,
          "group_id": 79,
          "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
          "translation": "Allah sana (eşinle) bereket versin, seni bereketlendirsin ve sizi iyilikte birleştirsin.",
          "reference": "Abû Dâwud [2130], At-Tirmidhî [1091] ve Ibn Mâjah [1905]. Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/324)."
        }
      ]
    },
    {
      "group_id": 81,
      "title": "Cinsel İlişki Öncesinde",
      "duas": [
        {
          "id": 192,
          "group_id": 81,
          "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
          "translation": "Allah’ın adıyla. Allah’ım, bizi şeytandan uzak tut ve bize verdiğin şeyde de şeytanı uzak tut.",
          "reference": "Al-Bukhârî [3271](6/141) ve Muslim [1434](2/1028)."
        }
      ]
    },
    {
      "group_id": 125,
      "title": "Nazar Değmesinden Korkulduğunda",
      "duas": [
        {
          "id": 244,
          "group_id": 125,
          "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
          "translation": "Kardeşinde, kendinde ya da malında seni etkileyen bir şey görürsen, onun için bereket dile, çünkü nazar gerçektir.",
          "reference": "Aĥmad (4/447), Ibn Mâjah [3509] ve Mâlik [1697-1698]. Al-Albânî, Ŝaĥîĥ Al-Jâmi'de (1/212) senedini sahih olarak değerlendirmiştir. Ayrıca bkz. Zâd al-Ma'âd by Al-Arnâ'ûť."
        }
      ]
    },
    {
      "group_id": 128,
      "title": "Azılı Şeytanların Aldatmasından Korunmak İçin",
      "duas": [
        {
          "id": 247,
          "group_id": 128,
          "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
          "translation": "Hiçbir doğru ya da günahkârın aşamayacağı Allah’ın mükemmel kelimelerine, yarattığı, var ettiği ve meydana getirdiği şeylerin şerrinden, gökten inen şeylerin ve ona yükselen şeylerin şerrinden, yeryüzünde yayılan şeylerin ve ondan çıkanların şerrinden, gecenin ve gündüzün fitnelerinin şerrinden ve hayır getirenler hariç gece gelenlerin şerrinden Allah’a sığınırım, ey Rahman!",
          "reference": "Aĥmad (3/419) sahih bir senetle, Ibn As-Sunnî [637]. Al-Arnâ'ûť, senedini Ať-Ťaĥawiyyah araştırmasında sahih olarak değerlendirmiştir (s. 133). Ayrıca bkz. Majma' Az-Zawâ'id (10/127)."
        }
      ]
    },
    {
      "group_id": 132,
      "title": "Genel ve Faydalı Kurallar",
      "duas": [
        {
          "id": 267,
          "group_id": 132,
          "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
          "translation": "Gece çöktüğünde çocuklarınızı içeri alın, çünkü şeytanlar o zaman etrafa yayılır. Bir süre geçtikten sonra onları serbest bırakın. Kapılarınızı kapatın ve Allah’ın adını zikredin; çünkü şeytan kapalı bir kapıyı açamaz. Su kaplarınızı bağlayın ve Allah’ın adını zikredin, kaplarınızı örtün ve Allah’ın adını zikredin, hatta üzerine bir şey koysanız bile, lambalarınızı söndürün.",
          "reference": "Al-Bukhârî [5623](10/88) ve Muslim [2012](3/1595)."
        }
      ]
    }
  ]
},
  {
    "category_id": 10,
    "title": "Yiyecek ve İçecek",
    "group": [
        {
            "group_id": 68,
            "title": "Oruç Açarken",
            "duas": [
                {
                    "id": 176,
                    "group_id": 68,
                    "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
                    "translation": "Susuzluk gitti, damarlar sulandı ve sevap kesinleşti, inşallah.",
                    "reference": "Abû Dâwud [2357](2/306). Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
                },
                {
                    "id": 177,
                    "group_id": 68,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
                    "translation": "Allah’ım, rahmetinle ki her şeyi kuşatmıştır, beni bağışlamanı diliyorum.",
                    "reference": "Ibn Mâjah [1753](1/557) ve Al-Hâfiž bunu Al-Athkâr'da Ĥasan olarak nitelendirmiştir. Ayrıca bkz. Sharĥ Al-Athkâr (4/342)."
                }
            ]
        },
        {
            "group_id": 69,
            "title": "Yemekten Önce",
            "duas": [
                {
                    "id": 178,
                    "group_id": 69,
                    "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
                    "translation": "Allah'ın adıyla (başında ve sonunda)*.",
                    "reference": "* Eğer yemek başlamadan önce dua edilmezse ve yemek sırasında hatırlanırsa parantez içindeki kelimeler söylenir.Abû Dâwud [3767](3/347) ve At-Tirmidhî [1858](4/288). Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (2/167)."
                },
                {
                    "id": 179,
                    "group_id": 69,
                    "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَزِدْنَا مِنْهُ",
                    "translation": "(1) 'Allah’ım, bize bunu mübarek kıl ve daha iyisini bize nasip et.'Eğer süt verilirse, şu dua okunur:(2) 'Allah’ım, bize bunu mübarek kıl ve daha fazlasını ver.'",
                    "reference": "Abû Dâwud [3767] ve An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî bunu zayıf olarak nitelendirmiştir, bkz. Al-Kalam Ať-Ťayyib [184]."
                }
            ]
        },
        {
            "group_id": 70,
            "title": "Yemekten Sonra",
            "duas": [
                {
                    "id": 180,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
                    "translation": "Bana bunu yediren ve hiçbir güç ve kuvvetim olmadan bana bunu veren Allah’a hamdolsun.",
                    "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] ve Ibn Mâjah [3285]. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/159)."
                },
                {
                    "id": 181,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
                    "translation": "Allah’a bol, güzel ve mübarek bir hamd, sonu olmayan bir hamd, onu asla terk etmeyeceğimiz ve onsuz yapamayacağımız bir hamd olsun. O bizim Rabbimizdir.",
                    "reference": "Al-Bukhârî [5458](6/214) ve At-Tirmidhî [3456](5/507) ve lafız onundur."
                }
            ]
        },
        {
            "group_id": 71,
            "title": "Misafirin Ev Sahibi İçin Duası",
            "duas": [
                {
                    "id": 182,
                    "group_id": 71,
                    "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
                    "translation": "Allah’ım, onlara verdiğin şeyleri mübarek kıl, onları bağışla ve onlara merhamet et.",
                    "reference": "Muslim [2042](3/1615)."
                }
            ]
        },
        {
            "group_id": 72,
            "title": "Birine İçki Sunarken veya İkram Etmek İsteyen Kişiye",
            "duas": [
                {
                    "id": 183,
                    "group_id": 72,
                    "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                    "translation": "Allah’ım, bana yemek veren kişiye sen de yemek ver ve bana içki sunan kişiye sen de içki ver.",
                    "reference": "Muslim [2055](3/1626)."
                }
            ]
        },
        {
            "group_id": 73,
            "title": "Birinin Evinde Oruç Bozarken",
            "duas": [
                {
                    "id": 184,
                    "group_id": 73,
                    "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
                    "translation": "Oruç tutanlar evinizde iftar yapsın, dürüst ve takva sahibi kişiler yemeğinizi yesin ve melekler size dua etsin.",
                    "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) ve An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî bunu Ŝaĥîĥ Abû Dâwud (2/730)'da sahih olarak sınıflandırmıştır."
                }
            ]
        },
        {
            "group_id": 74,
            "title": "Oruçlu İkram Edilen Yemekten Yemezse",
            "duas": [
                {
                    "id": 185,
                    "group_id": 74,
                    "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
                    "translation": "Biriniz davet edilirse, kabul etsin. Eğer oruçlu ise, dua etsin (katılanlar için dua etsin), eğer oruçlu değilse, yesin. ('Dua etsin' burada 'dua etsin' anlamındadır.)",
                    "reference": "Muslim [1431](2/1054)."
                }
            ]
        }
    ]
},
  {
    "category_id": 11,
    "title": "Hastalık ve Ölüm",
    "group": [
      {
        "group_id": 48,
        "title": "Çocukları Allah’ın Koruması Altına Koymak",
        "duas": [
          {
            "id": 146,
            "group_id": 48,
            "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
            "translation": "Sizi her türlü şeytandan, haşereden ve kötü gözden Allah’ın mükemmel kelimeleriyle koruma altına alıyorum.",
            "reference": "Al-Bukhârî [3371](4/119)."
          }
        ]
      },
      {
        "group_id": 49,
        "title": "Hasta Ziyareti Sırasında",
        "duas": [
          {
            "id": 147,
            "group_id": 49,
            "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
            "translation": "Endişelenme, inşallah (bu hastalık) bir arınma olur.",
            "reference": "Al-Bukhârî [3616](10/118)."
          },
          {
            "id": 148,
            "group_id": 49,
            "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
            "translation": "Yüce Allah’tan, büyük arşın Rabbinden, sana şifa vermesini diliyorum. (Yedi kez)",
            "reference": "At-Tirmidhî [2083] ve Abû Dâwud [3106]. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (2/210) ve Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
          }
        ]
      },
      {
        "group_id": 50,
        "title": "Hasta Ziyaretinin Fazileti",
        "duas": [
          {
            "id": 149,
            "group_id": 50,
            "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
            "translation": "Bir Müslüman kardeşini hasta ziyaretine giden kişi, cennetin meyvelerini toplar gibi yürür ve oturduğunda rahmetle kuşatılır. Eğer bu sabah vakti ise, yetmiş bin melek ona akşama kadar dua eder ve eğer akşam vakti ise, yetmiş bin melek ona sabaha kadar dua eder.",
            "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] ve Aĥmad (1/97). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/244) ve Ŝaĥîĥ At-Tirmidhî (1/286). Şeyh Aĥmad Shâkir de bunu sahih olarak değerlendirmiştir."
          }
        ]
      },
      {
        "group_id": 51,
        "title": "Hastanın Yaşama Umudu Kalmadığında",
        "duas": [
          {
            "id": 150,
            "group_id": 51,
            "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
            "translation": "Allah’ım, beni bağışla, bana merhamet et ve beni yüksek dostlarla buluştur.",
            "reference": "Al-Bukhârî [4440](7/10) ve Muslim [2444](4/1893)."
          },
          {
            "id": 151,
            "group_id": 51,
            "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
            "translation": "Allah’tan başka ilah yoktur, ölüm gerçekten sancılar içerir.",
            "reference": "Al-Bukhârî [4449](8/144)."
          },
          {
            "id": 152,
            "group_id": 51,
            "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "Allah’tan başka ilah yoktur ve Allah en büyüktür. Allah’tan başka ilah yoktur, O tektir. Allah’tan başka ilah yoktur, O tektir, ortağı yoktur. Allah’tan başka ilah yoktur, mülk ve hamd O’na aittir. Allah’tan başka ilah yoktur, güç ve kuvvet ancak Allah ile mümkündür.",
            "reference": "At-Tirmidhî [3430] ve Ibn Mâjah [3794]. Al-Albânî bunu sahih olarak değerlendirmiştir. Ayrıca bkz. Ŝaĥîĥ At-Tirmidhî (3/152) ve Ŝaĥîĥ Ibn Mâjah (2/317)."
          }
        ]
      },
      {
        "group_id": 52,
        "title": "Ölüm Döşeğindekilere Öğüt",
        "duas": [
          {
            "id": 153,
            "group_id": 52,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "Son sözü 'Allah’tan başka ilah yoktur' olan kişi cennete girecektir.",
            "reference": "Abû Dâwud [3116](3/190). Ayrıca bkz. Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
          }
        ]
      },
      {
        "group_id": 54,
        "title": "Ölen Kişinin Gözlerini Kapatırken",
        "duas": [
          {
            "id": 155,
            "group_id": 54,
            "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
            "translation": "Allah’ım, (merhumun ismi) bağışla, onu hidayete ermişlerin arasında yükselt, geride bıraktıkları için ona hayırlı bir halef ol, bizleri ve onu bağışla ey alemlerin Rabbi, kabrini genişlet ve orayı onun için aydınlat.",
            "reference": "Muslim [920](2/634)."
          }
        ]
      },
      {
        "group_id": 55,
        "title": "Cenaze Namazında Ölen Kişi İçin",
        "duas": [
          {
            "id": 156,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
            "translation": "Allah’ım, onu bağışla ve ona merhamet et, onu esenlikte kıl ve onu affet, ona cömert bir karşılama nasip et, girişini genişlet, onu su, kar ve dolu ile temizle, hatalarını beyaz bir elbisenin kirden temizlendiği gibi temizle, ona evinden daha hayırlı bir ev, ailesinden daha hayırlı bir aile ve eşinden daha hayırlı bir eş ver. Onu cennete al, onu kabir azabından (ve ateş azabından) koru.",
            "reference": "Muslim [963](2/663)."
          },
          {
            "id": 157,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
            "translation": "Allah’ım, yaşayanlarımızı ve ölenlerimizi, aramızda bulunanlarımızı ve bulunmayanlarımızı, küçüklerimizi ve büyüklerimizi, erkeklerimizi ve kadınlarımızı bağışla. Allah’ım, aramızdan kimi hayatta bıraktıysan onu İslam üzere yaşat ve kimi aramızdan aldıysan, onu iman üzere vefat ettir. Allah’ım, onun ecrinden bizleri mahrum etme ve ondan sonra bizleri saptırma.",
            "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] ve Aĥmad (2/368). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 158,
            "group_id": 55,
            "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
            "translation": "Allah’ım, falanca oğlu falanca senin himayende ve koruman altındadır. Onu kabir fitnesinden ve ateş azabından koru. Şüphesiz ki Sen vefa ve hakkın sahibisin. Onu bağışla ve ona merhamet et, şüphesiz ki Sen, çok bağışlayan ve çok merhamet edensin.",
            "reference": "Ibn Mâjah [1499] ve Abû Dâwud (3/211). Ayrıca bkz. Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 159,
            "group_id": 55,
            "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
            "translation": "Allah’ım, Senin kulun ve cariyenin oğlu rahmetine muhtaçtır ve Sen onun azabına muhtaç değilsin. Eğer o salih biri idiyse, iyiliklerini artır ve eğer günahkâr biri idiyse, hatalarını affet.",
            "reference": "Al-Hâkim (1/359) ve bunu sahih olarak değerlendirmiş, Adh-Dhahabî de ona katılmıştır. Ayrıca bkz. Aĥkâm Al-Janâ'iz by Al-Albânî (s. 125)."
          }
        ]
      },
      {
        "group_id": 56,
        "title": "Ölen Çocuk İçin, Cenaze Namazı Sırasında",
        "duas": [
          {
            "id": 160,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
            "translation": "Allah’ım, onu anne ve babası için bir öncü ve bir hazine yap, onun aracılığıyla bir şefaatçi yap, Allah’ım, onunla onların terazilerini ağırlaştır ve onların ecrini artır. Onu salih müminlerle birleştir, onu İbrahim’in himayesi altına al ve rahmetinle cehennem azabından koru. Ona evinden daha hayırlı bir ev ve ailesinden daha hayırlı bir aile ver. Allah’ım, atalarımızı, çocuklarımızı ve bizden önce imanla vefat edenleri bağışla.",
            "reference": "Bkz. Al-Mughnî by Ibn Qudâmah (3/416) ve Ad-Durûs  Al-Muhimmah Li'âmah Al-Ummah by Shaykh Ibn Bâz (s. 15)."
          },
          {
            "id": 161,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
            "translation": "Allah’ım, onu bizim için bir öncü, bir selef ve bir mükafat yap.",
            "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
          }
        ]
      },
      {
        "group_id": 57,
        "title": "Taziye",
        "duas": [
          {
            "id": 162,
            "group_id": 57,
            "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
            "translation": "Şüphesiz ki Allah’ın aldığı da O’na aittir, verdiği de O’na aittir ve her şeyin O’nun katında belirli bir süresi vardır. Sabret ve Allah’tan karşılık bekle.",
            "reference": "Al-Bukhârî [1284](2/80) ve Muslim [923](2/636)."
          }
        ]
      },
      {
        "group_id": 58,
        "title": "Mevtayı Mezara Koyarken",
        "duas": [
          {
            "id": 163,
            "group_id": 58,
            "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
            "translation": "Allah’ın adıyla ve Allah’ın Resulü’nün sünneti üzere.",
            "reference": "Abû Dâwud [3213](3/314) ve sahih bir senetle Aĥmad (2/40) (بسم الله و على ملة رسول الله) ifadesiyle ve senedi sahih olan rivayet."
          }
        ]
      },
      {
        "group_id": 59,
        "title": "Mevta Defnedildikten Sonra",
        "duas": [
          {
            "id": 164,
            "group_id": 59,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
            "translation": "Allah’ım, onu bağışla, Allah’ım, onu sabit kıl.",
            "reference": "Abû Dâwud [3221](3/315) ve Al-Hâkim (1/370) ve bunu sahih olarak değerlendirmiş, Adh-Dhahabî de ona katılmıştır."
          }
        ]
      },
      {
        "group_id": 60,
        "title": "Kabir Ziyaretleri",
        "duas": [
          {
            "id": 165,
            "group_id": 60,
            "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
            "translation": "Selam olsun size ey kabir halkı, müminler ve Müslümanlar arasında. Şüphesiz ki biz de inşallah sizlere katılacağız, Allah’tan bizler ve sizler için afiyet diliyorum.",
            "reference": "Muslim [975](2/671) ve Ibn Mâjah [1547](1/494) ve ifadeler onundur. Köşeli parantez içindekiler, 'Â'işe’nin rivayet ettiği hadisten olup Muslim [974](2/671) tarafından toplanmıştır."
          }
        ]
      },
      {
        "group_id": 124,
        "title": "Vücutta Bir Ağrı Hissedildiğinde",
        "duas": [
          {
            "id": 243,
            "group_id": 124,
            "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
            "translation": "'Allah’ın adıyla' (üç kez) denir, ardından 'Hissettiğim ve korktuğum şeyin şerrinden Allah’a ve O’nun kudretine sığınırım.' (yedi kez) denir.",
            "reference": "Muslim [2202](4/1728)."
          }
        ]
      }
    ]
  }
]