[
  {
    "category_id": 1,
    "title": "காலை & மாலை",
    "group": [
        {
            "group_id": 1,
            "title": "எழுந்ததும் செய்ய வேண்டியது",
            "duas": [
                {
                    "id": 1,
                    "group_id": 1,
                    "dua": "اَلحَمدُ لِلهِ الَّذِي أحيَانَا بَعْدَ مَا أمَاتَنَا وَ إِلَيهِ النُّشُورُ",
                    "translation": "எங்களை உயிர்ப்பித்த அல்லாஹ்வுக்கு புகழ், இறப்பித்தபின் நம்மை மீண்டும் எழுப்புகிறார்.",
                    "reference": "Al-Bukhârî [6312], see Fatĥ al-Bârî (11/113) and Muslim [2711](4/2083)."
                },
                {
                    "id": 2,
                    "group_id": 1,
                    "dua": "لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الحَمدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحاَنَ اللهِ، وَالحَمدُ للهِ، وَلَا إِلَهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفِرْ لِي",
                    "translation": "அல்லாஹ்வைத் தவிர வேறெவரும் வணக்கத்துக்குரியவரல்லர், அவர் தனித்து ஆளுபவர், அவருக்கே புகழும் மகத்துவமும் உரியது, அவர் எல்லாவற்றையும் செய்வதில் வல்லவர். அல்லாஹ்விற்கு புகழும் மகத்துவமும் உரியது. அல்லாஹ்வைத் தவிர வேறெவரும் வணக்கத்துக்குரியவரல்லர். அல்லாஹ் மிகப் பெரியவர். உயர்ந்தவரின் அனுமதியால் மட்டுமே ஆற்றலும் சக்தியும் இருக்கின்றன. என் இறைவா, எனக்கு மன்னிப்பு தருவாயாக.",
                    "reference": "Al-Bukhârî [1154], see Fatĥ al-Bârî (3/39) and the wording is of Ibn Mâjah (2/335), also see Ŝaĥiĥ Ibn Mâjah (2/335)."
                },
                {
                    "id": 3,
                    "group_id": 1,
                    "dua": "الحَمدُ لِلهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لِي بِذِكْرِهِ",
                    "translation": "என் உடலை நலமாகக் காக்கும் அல்லாஹ்விற்கு புகழ், அவர் என்னுடைய ஆத்மாவை எனக்குத் திருப்பி, அவரை நினைக்கும் அனுமதியை அளித்தார்.",
                    "reference": "At-Tirmidhî [3401](5/473), also see Ŝaĥiĥ At-Tirmidhî (3/144)."
                },
                {
                    "id": 4,
                    "group_id": 1,
                    "dua": "يقرأ سورة آل عمران ٣: ١٩٠-٢٠٠",
                    "translation": "சூரா ஆல் இம்ரான் [3:190-200] ஐ ஓதுங்கள்.",
                    "reference": "Al-Bukhârî [4572], see Fatĥ al-Bârî (8/237) and Muslim [763](1/530)."
                }
            ]
        },
        {
            "group_id": 27,
            "title": "காலை மற்றும் மாலை",
            "duas": [
                {
                    "id": 75,
                    "group_id": 27,
                    "dua": "﴾اللهُ لَا إله إلَّا هُوَ الحَيُّ القَيُّومُ لَا...﴿",
                    "translation": "ஒருவன் காலையில் ஆயத்துல் குர்சியைக் கூறினால் ஜின்னுகளிடமிருந்து மாலை வரை பாதுகாப்புப் பெறுவான்; மாலை அதைப் கூறினால் காலையில் பாதுகாப்புப் பெறுவான்.",
                    "reference": "Al-Hâkim (1/562) and Al-Albânî authenticated it in Ŝaĥîĥ At-Targhîb wa At-Tarhîb [655](1/273) and he attributed it to An-Nisâ'i ['Amal al-Yawm wa al-Laylah][960] and Ťabarânî [Al-Kabîr][541] and said that the latter's chain is good."
                },
                {
                    "id": 76,
                    "group_id": 27,
                    "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
                    "translation": "ஓதுங்கள்:1. சூரா இக்லாஸ் (குர்ஆன்: 112)2. சூரா அல்-பலக் (குர்ஆன்: 113)3. சூரா அன்-நாஸ் (குர்ஆன்: 114)[3 முறை]",
                    "reference": "Abû Dâwud [5082](4/322), At-Tirmidhî [5/567](3575). Also see Ŝaĥîĥ At-Tirmidhî (3/182)."
                },
                {
                    "id": 77,
                    "group_id": 27,
                    "dua": "أصْبَحْنَا وَ أصْبَحَ المُلْكُ لِلَّهِ، وَ الحَمْدُ لِلَّهِ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أسْألُكَ خَيْرَ مَا في هَذَا اليَوْمِ وَ خَيْرَ مَا بَعْدَهُ، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذَا اليَوْمِ وَ شَرِّ مَا بَعْدَهُ، رَبِّ أعُوذُ بِكَ مِنَ الكَسَلِ، وَ سُوءِ الكِبَرِ، رَبِّ أعُوذُ بِكَ مِنْ عَذَابٍ في النَّارِ وَ عَذَابٍ في القَبْرِ.(١)وَ إذَا أمْسَى قَالَ: أمْسَيْنَا وَ أمْسَى المُلْكُ لِلَّهِ.وَ إذَا أمْسَى قَالَ: رَبِّ أسْألُكَ خَيْرَ مَا في هَذِهِ اللَّيْلَةِ وَ خَيْرَ مَا بَعْدَهَا، وَ أعُوذُ بِكَ مِنْ شَرِّ مَا في هَذِهِ اللَّيْلَةِ وَ شَرِّ مَا بَعْدَهَا.",
                    "translation": "'நாங்கள் காலையைக் கடந்து அடைந்தோம், எல்லாம் அல்லாஹ்வின் கட்டுப்பாட்டில் உள்ளது. அல்லாஹ்விற்கு புகழ். அல்லாஹ்வைத்தவிர வேறெவரும் வணக்கத்திற்குரியவர் அல்லர். அவருக்கு இணையானவர் இல்லை. அவருக்கே ராஜ்யமும் மகத்துவமும் உரியது. எல்லாவற்றையும் செய்வதற்குத் தகுதி வாய்ந்தவர். இறைவா, இன்று உள்ள நல்லவை மற்றும் அதன் பின் வரும் நல்லவற்றை நான் கேட்கிறேன்; இன்று உள்ள தீமையிலிருந்து மற்றும் அதன் பின் வரும் தீமையிலிருந்து பாதுகாப்பு கேட்கிறேன்.'இரவு ஓத வேண்டியது:'நாங்கள் மாலை அடைந்தோம், எல்லாம் அல்லாஹ்வின் கட்டுப்பாட்டில் உள்ளது...''இரவு உள்ள நல்லவை மற்றும் அதன் பின் வரும் நல்லவற்றை நான் கேட்கிறேன்...' ",
                    "reference": "Muslim [2723](4/2088)."
                },
                {
                    "id": 78,
                    "group_id": 27,
                    "dua": "اللهم بِكَ أصْبَحْنَا، وَ بِكَ أمْسَيْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ النُّشُورُ.(١)وَإذَا أمْسَى قَالَ: اللهم بِكَ أمْسَيْنَا، وَ بِكَ أصْبَحْنَا، وَ بِكَ نَحْيَا، وَ بِكَ نَمُوتُ، وَ إلَيْكَ المَصِيْرُ.",
                    "translation": "'அல்லாஹ்வே, உன்னால் தான் நாங்கள் காலை அடைந்தோம்; உன்னால் தான் மாலை அடைந்தோம், உன்னால் தான் நாங்கள் வாழ்கிறோம், உன்னால் தான் இறக்கிறோம், உன்னிடமே தான் நாங்கள் திரும்பிச் செல்லப் போகிறோம்.'இரவில் ஓத வேண்டியது:'அல்லாஹ்வே, உன்னால் தான் மாலை அடைந்தோம்; உன்னால் தான் காலை அடைந்தோம், உன்னால் தான் நாங்கள் வாழ்கிறோம், உன்னால் தான் இறக்கிறோம், உன்னிடமே தான் திரும்பிச் செல்லப் போகிறோம்.'",
                    "reference": "At-Tirmidhî [3391](5/466). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
                },
                {
                    "id": 79,
                    "group_id": 27,
                    "dua": "اللهم أنْتَ رَبِّي لَا إلَهَ إلَّا أنْتَ، خَلَقْتَنِي وَ أنَا عَبْدُكَ، وَ أنَا عَلَى عَهْدِكَ وَ وَعْدِكَ مَا اسْتَطَعْتُ، أعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أبُوءُلَكَ بِنِعْمَتِكَ عَلَيَّ، وَ أبُوءُ بِذَنْبِي فَاغْفِرْ لي فَإنَّهُ لَا يَغْفِرُ الذُّنُوبَ إلَّا أنْتَ.",
                    "translation": "அல்லாஹ்வே, நீர் என்னுடைய இறைவன், உம்மைவிட வேறு வணக்கத்திற்குரியவர் இல்லை. நீர் என்னைப் படைத்தவர், நான் உமது அடியேன். நான் உம்முடைய உறுதிமொழியையும் வாக்குறுதியையும் நான் ஆற்றும் அளவுக்குச் செய்கிறேன். நான் செய்த தீமைகளிலிருந்து என்னைக் காக்க உமக்குப் புகலுகிறேன். உமக்கு அளித்த அருளையும் என் பாவங்களையும் ஒப்புக்கொள்கிறேன், எனக்கு மன்னித்து விடுவாயாக, ஏனெனில் உம்மைவிட வேறு பாவங்களை மன்னிக்க இயலுமாறு யாருமில்லை.",
                    "reference": "Al-Bukhârî [6306](7/150)."
                },
                {
                    "id": 80,
                    "group_id": 27,
                    "dua": "اللهم إنِّي أصْبَحْتُ أُشْهِدُكَ، وَ أُشْهِدُ حَمَلَةَ عَرْشِكَ، وَ مَلَائِكَتِكَ، وَ جَمِيْعَ خَلْقِكَ، أنَّكَ أنْتَ اللهُ لَا إلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، وَ أنَّ مُحَمَّداً عَبْدُكَ وَ رَسُولُكَ. [أرْبَعَ مَرَّاتٍ]",
                    "translation": "அல்லாஹ்வே, நான் காலை அடைந்துள்ளேன், உமக்கு சாட்சியாக அழைக்கிறேன், உமது சிங்காசனத்தைத் தாங்கும் தரவுகளையும், உமது தூதர்களையும், உமது படைப்புகளைத் தாங்கிய எல்லாவற்றையும் சாட்சியாக அழைக்கிறேன், நீர் அல்லாஹ், உம்மைவிட வேறு வணக்கத்திற்குரியவர் இல்லை, நீர் தனிப்பட்டவர், உமக்கு இணையானவர் இல்லை, முஹம்மது உமது அடியவரும் தூதருமாவார். [நான்கு முறை]",
                    "reference": "Abû Dâwud [5069](4/317), Al-Bukhârî [Al-Adab Al-Mufrad][1201], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][9] and Ibn As-Sunnî [70]. Shaykh Ibn Bâz declared the chain of An-Nisâ'i and Abû Dâwud, Hasan in [Tuĥfat Al-Akhyâr][pg. 23]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [25]."
                },
                {
                    "id": 81,
                    "group_id": 27,
                    "dua": "أللهم مَا أصْبَحَ بِي مِنْ نِعْمَةٍ، أوْ بِأحَدٍ مِنْ خَلْقِكَ، فَمِنْكَ وَحْدَكَ لَا شَرِيْكَ لَكَ، فَلَكَ الحَمْدُ وَ لَكَ الشُّكْرُ.(١)و إذَا أمْسَى قَالَ: اللهم مَا أمْسَى بِي...",
                    "translation": "அல்லாஹ்வே, என்னில் உள்ள ஆசீர்வாதம் அல்லது உமது படைப்புகளில் உள்ள எவரிடமும் உள்ளது என்றால், அது உம்மிடமிருந்து மட்டுமே, உமக்கு இணையானவர் இல்லை. புகழும் நன்றியும் உமக்கே உரியது.",
                    "reference": "Abû Dâwud [5073](4/318), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][7], Ibn As-Sunnî [41], Ibn Ĥibân [Muwârid][2361]. Shaykh Ibn Bâz declared its chain Ĥasan in [Tuĥfat Al-Akhyâr][pg. 24]. However Al-Albânî declared it weak. See Al-Kalim Ať-Ťayyib [26]."
                },
                {
                    "id": 82,
                    "group_id": 27,
                    "dua": "اللَّهُمَّ عَافِنِي فِي بَدَنِي، اللَّهُمَّ عَافِنِي فِي سَمْعِي، اللَّهُمَّ عَافِنِي فِي بَصْرِي، لَا إِلَهَ إِلَّا أَنْتَ، اللَّهُمَّ إِنِّي أَعُوْذُ بِكَ مِنَ الْكُفْرِ، وَالْفَقْرِ، وأَعُوْذُ بِكَ مِنْ عَذَابِ القَبْرِ، لَا إِلَهَ إِلَّا أَنْتَ.[ثَلاثَ مَرَّاتٍ]",
                    "translation": "அல்லாஹ்வே, என் உடலின் நலத்தைக் காக்கவும், என் செவியின் நலத்தைக் காக்கவும், என் கண்களின் நலத்தைக் காக்கவும். உமையே வணக்கத்திற்குரியவர். அல்லாஹ்வே, நான் குற்றத்தை மறுத்து வறுமையிலிருந்து உம்மிடம் புகல்கிறேன், உமையே வணக்கத்திற்குரியவர். [மூன்று முறை]",
                    "reference": "Abû Dâwud [5090](4/324), Aĥmad (5/42), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][22], Ibn As-Sunnî [69], Al-Bukhârî [Al-Adab Al-Mufrad]. Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 26]. Al-Albânî declared it weak. See Ďa'îf Al-J Al-Jâmi' [1210]."
                },
                {
                    "id": 83,
                    "group_id": 27,
                    "dua": "حَسْبِيَ اللهُ لَا إلَهَ إلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ [سَبْعَ مَرَّاتٍ]",
                    "translation": "எனக்குத் திருப்தி அல்லாஹ்வே. அவருக்கே நம்பிக்கையோடு நான் விட்டுவிட்டேன், அவர் மிகப் பெரிய தக்ஷினத்தோடு உள்ளவர். [ஏழு முறை]",
                    "reference": "Ibn As-Sunnî [71][Marfû'] and Abû Dâwud [5081](4/321)[Mawqûf]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic. Also see Zâd al-Ma'âd (2/376). Al-Albânî declared it weak. See Ďa'îf Abî Dâwud."
                },
                {
                    "id": 84,
                    "group_id": 27,
                    "dua": "اللَّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في الدُّنْيَا وَالآخِرَةِ، اللّهُمَّ إِنِّي أسْأَلُكَ العَفْوَ وَ العَافِيَةَ في دِيْنِي وَدُنْيَايَ وَأهْلي وَمالي، اللَّهُمَّ اسْتُرْ عَوْرَاتي، وَآمِنْ رَوْعَاتي، اللَّهُمَّ احْفَظْني مِنْ بَيْنِ يَدَيَّ، وَمِنْ خَلْفِي، وَعَنْ يَمِيْنِي وَعَنْ شِمَالي، وَمِنْ فَوْقي ، وَ أعُوذُ بِعَظَمَتِكَ أنْ أُغْتَالَ مِنْ تَحْتِي.",
                    "translation": "அல்லாஹ்வே, நான் உம்மிடம் உலகிலும் மறுமையில் மன்னிப்பும் நலனும் கேட்கிறேன். அல்லாஹ்வே, நான் உம்மிடம் என் மதத்தின் மீதான, உலகத்தின் மீதான, என் குடும்பத்தின் மீதான, என் செல்வத்தின் மீதான மன்னிப்பையும் நலனையும் கேட்கிறேன். அல்லாஹ்வே, எனது குறைகளை மூடிவிடுவாயாக, என் அச்சத்தை விலக்குவாயாக. அல்லாஹ்வே, எனக்கு முன்னால், பின்னால், வலது, இடது, மேலிருந்து என்னைக் காக்குவாயாக. உமது மகிமையின் மூலம் எனக்கு அடியில் இருந்து நாசம் நேராதபடி புகலுகிறேன்.",
                    "reference": "Abû Dâwud [5074], Ibn Mâjah [3871]. Also see Ŝaĥîĥ Ibn Mâjah (2/332)."
                },
                {
                    "id": 85,
                    "group_id": 27,
                    "dua": "اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ، فَاطِرَ السَّمَاوَاتِ وَ الأرْضِ، رَبَّ كلِّ شَيءٍ وَمَلِيْكَه، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ.",
                    "translation": "அல்லாஹ்வே, மறையும் வெளிப்படும் அனைத்தையும் அறிந்தவரே, வானங்களையும் பூமியையும் படைத்தவரே, எல்லா பொருள்களுக்கும் இறைவனும் அரசனும் நீரே, உம்மைத் தவிர வேறேவும் வணக்கத்திற்குரியவர் இல்லை என நான் சாட்சியாக உறுதிசெய்கிறேன். என்னுடைய பிராணனில் உள்ள தீமையிலிருந்து, சைத்தானின் கூட்டு தீமைகளிலிருந்து உமக்கு புகலுகிறேன்.",
                    "reference": "At-Tirmidhî [3392] and Abû Dâwud [5067]. Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
                },
                {
                    "id": 86,
                    "group_id": 27,
                    "dua": "بِسمِ اللهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيءٌ في الأرْضِ وَلَا في السَّمَاءِ وَهـوَ السَّمِيعُ العَلِيمُ [ثَلاثَ مَرَّاتٍ]",
                    "translation": "அல்லாஹ்வின் பெயரில், அவருடைய பெயரில் தகுதிபெற்றது மட்டும், பூமியிலும் வானத்திலும் எந்த தீமையிலும் உறுதியாக இருக்கமாட்டாது. அவர் எல்லாவற்றையும் அறிந்தவரும் கேட்டுவரும் ஆவார். [மூன்று முறை]",
                    "reference": "Abû Dâwud [5088, 5089](4/323), At-Tirmidhî [3388](5/465), Ibn Mâjah [3869], Aĥmad (1/72). Also see Ŝaĥîĥ Ibn Mâjah (2/332). Shaykh Ibn Bâz authenticated its chain in [Tuĥfat Al-Akhyâr][pg. 39]."
                },
                {
                    "id": 87,
                    "group_id": 27,
                    "dua": " رَضِيْتُ بِاللهِ رَبًّا، وَبِالإسْلامِ دِيْناً، وَبِمُحَمَّدٍ نَبِيًّا [ثَلاثَ مَرَّاتٍ]",
                    "translation": "அல்லாஹ்வை ரப்பு என்று மகிழ்கிறேன், இஸ்லாத்தை மதமாகவும் முஹம்மதை நபியாகவும் மகிழ்கிறேன். [மூன்று முறை]",
                    "reference": "Aĥmad (4/337), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][4], Ibn As-Sunnî [68], Abû Dâwud [5072](4/318) and At-Tirmidhî [3389](5/465). Shaykh Ibn Bâz declared it Ĥasan in [Tuĥfat Al-Akhyâr][39]."
                },
                {
                    "id": 88,
                    "group_id": 27,
                    "dua": "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيْثُ، أَصْلِحْ لي شَأْني كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
                    "translation": "ஓ நீர் எப்போதும் உயிருள்ளவர், நீர் ஆதாரத்தையும் தாங்குவோர், உமது இரக்கத்தின் மூலம் நான் உதவியைத் தேடுகிறேன். என்னுடைய அனைத்துக் காரியங்களையும் சரிசெய்து விடுவாயாக, என்னை என் பிராணனின் மீது அவசரத்தில் வைக்காதே.",
                    "reference": "Al-Hâkim (1/545); he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Targhîb wa At-Tarhîb [654](1/273)."
                },
                {
                    "id": 89,
                    "group_id": 27,
                    "dua": "أَصْبَحْنَا وَ أَصْبَحَ المُلْكُ لِلَّهِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هـَذَا اليَوْمِ: فَتْحَهُ، وَنَصْرَهُ وَ نُورَهُ، وَ بَرَكَتَهُ،وَ هُدَاهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهِ وَ شَرِّ مَا بَعْدَهُ.و إذا أمسى قال: أَمْسَيْنَا وَأَمْسَى المُلْكُ لِلّهَِ رَبِّ العَالَمِيْنَ، اللَّهُمَّ إِنِّي أسْأَلُكَ خَيْرَ هـَذِهِ اللَّيْلَةِ، فَتْحَهَا، وَنَصْرَهـَا، وَنورَهـَا وَبَرَكَتَهَا، وَ هُدَاهـَا، وَ أَعُوذُ بِكَ مِنْ شَرِّ مَا فِيْهَا وَشَرِّ مَا بَعْدَهـَا.",
                    "translation": "'நாங்கள் காலை அடைந்தோம், எல்லாம் அல்லாஹ்வின் கட்டுப்பாட்டில் உள்ளது, அவர் உலகங்களின் இறைவன். அல்லாஹ்வே, இன்று உள்ள நல்லது, அதன் திறப்பு, வெற்றி, ஒளி, ஆசீர்வாதம், வழிகாட்டி அனைத்தையும் கேட்கிறேன்; இதில் உள்ள தீமையிலிருந்தும் அதன் பின் வரும் தீமையிலிருந்தும் உமக்கு புகல்கிறேன்.'இரவில் ஓத வேண்டியது:'நாங்கள் மாலை அடைந்தோம், எல்லாம் அல்லாஹ்வின் கட்டுப்பாட்டில் உள்ளது...'",
                    "reference": "Abû Dâwud [5084](4/322), Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared its chain Ĥasan in their research of Zâd al-Ma'âd (2/273)."
                },
                {
                    "id": 90,
                    "group_id": 27,
                    "dua": "أَصْبَحْنَا عَلَى فِطْرَةِ الإسْلامِ، وَعَلَى كَلِمَةِ الإخْلاصِ، وَعَلَى دِيْنِ نَبِيِّنَا مُحَمَّدٍ ﷺ، وَعَلَى مِلَّةِ أبِيْنَا إِبْرَاهِيمَ، حَنِيْفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِيْنَ.وَ إذَا أمسَى قَالَ: أمْسَيْنَا عَلَى فِطْرَةِ الإسْلامِ.",
                    "translation": "நாங்கள் இஸ்லாமின் இயல்புத் தன்மையின் அடிப்படையில், தூய உண்மையின் வார்த்தையின் அடிப்படையில், நபி முஹம்மதின் மதத்தின் அடிப்படையில், எங்கள் பிதா இப்ராஹீமின் வழியில் பயணிக்கிறோம், அவர் முஸ்லிம் மற்றும் உண்மையான விசுவாசத்தோடு இருந்தவர், அவர் ஒப்பில்லாதவர்களில் ஒருவராக இருக்கவில்லை.",
                    "reference": "Aĥmad (3/406,407) and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][34]. Also see Ŝaĥîĥ Al-Jâmi' [4674](4/209)."
                },
                {
                    "id": 91,
                    "group_id": 27,
                    "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ [مِئَةَ مَرَّةٍ]",
                    "translation": "அல்லாஹ்வின் மகிமையைக் கொண்டு நான் அவரைப் புகழ்கிறேன். [நூறு முறை]",
                    "reference": "Muslim [2723](4/2071)."
                },
                {
                    "id": 92,
                    "group_id": 27,
                    "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَرِيكَ لهُ، لهُ المُلْكُ ولهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ. [عشر مرات](١)أو [مرة واحدة](٢)",
                    "translation": "அல்லாஹ்வைத்தவிர வேறெவரும் வணக்கத்திற்குரியவர் அல்லர், அவர் தனிமையில் உள்ளவர், அவருக்குக் கூட்டாளி இல்லை, அவருக்கே ராஜ்யமும் புகழும் உரியது, அவர் எல்லாவற்றையும் செய்வதற்குத் தகுதி வாய்ந்தவர்.   அல்லது  .",
                    "reference": "(1) An-Nisâ'i ['Amal al-Yawm wa al-Laylah][24] from the ĥadîth of Abu Ayûb Al-Anŝârî  (May Allah be pleased with him). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb [650](1/272) and Tuĥfat Al-Akhyâr (pg. 55).(2) Abû Dâwud [5077](4/319), Ibn Mâjah [3867] and Aĥmad (4/60). Also see Ŝaĥîĥ At-Targhîb  wa At-Tarhîb (1/270), Ŝaĥîĥ Abî  Dâwud  (3/957), Ŝaĥîĥ Ibn Mâjah (2/331) and Zâd Al-Ma'âd (2/377)."
                },
                {
                    "id": 93,
                    "group_id": 27,
                    "dua": "لَا إلَهَ إلَّا اللهُ وحْدَهُ لَا شَريْكَ لهُ، لهُ المُلْكُ ولَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيءٍ قَدِيْرٌ [مئةَ مَرَّةٍ إذا أصْبَحَ]",
                    "translation": "அல்லாஹ்வைத்தவிர வேறெவரும் வணக்கத்திற்குரியவர் அல்லர், அவர் தனிமையில் உள்ளவர், அவருக்கு கூட்டாளி இல்லை, அவருக்கே ராஜ்யமும் புகழும் உரியது, அவர் எல்லாவற்றையும் செய்வதற்குத் தகுதி வாய்ந்தவர். [ஒரு நூறு முறை காலை]",
                    "reference": "Al-Bukhârî [3293](4/95) and Muslim [2691](4/2071)."
                },
                {
                    "id": 94,
                    "group_id": 27,
                    "dua": "سُبْحَانَ اللهِ وَبِحَمْدِهِ، عَدَدَ خَلْقِهِ، وَرِضَا نَفْسِهِ، وَزِنَةَ عَرْشِهِ ، وَمِدَادَ كَلِمَاتِهِ. [ثَلاثَ مَرَّاتٍ إذا أصْبَحَ]",
                    "translation": "அல்லாஹ்வின் மகிமையைக் கொண்டு, அவர் படைப்பின் எண்ணிக்கையால், அவரின் திருப்தியால், அவரின் சிங்காசனத்தின் அளவால், அவரது வார்த்தைகளின் மை கொண்டு புகழ்கிறேன். [காலை மூன்று முறை]",
                    "reference": "Muslim [2726](4/2090)."
                },
                {
                    "id": 95,
                    "group_id": 27,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً، وَ رِزْقاً طَيِّباً، وَ عَمَلاً مُتَقَبَّلاً [إذا أصْبَحَ]",
                    "translation": "அல்லாஹ்வே, நான் உம்மிடமிருந்து பயனுள்ள அறிவைப், நல்ல வாழ்வாதாரத்தை, ஏற்றுக்கொள்ளப்பட்ட செயல்களை கேட்கிறேன். [காலை]",
                    "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][54] and Ibn Mâjah [925]. Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť declared it authentic in their research of Zâd al-Ma'âd (2/375)."
                },
                {
                    "id": 96,
                    "group_id": 27,
                    "dua": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ [مِئَةَ مَرَّةٍ اليَوْمِ]",
                    "translation": "அல்லாஹ்விடம் மன்னிப்பைக் கேட்கிறேன், அவரிடம் மறு முயற்சியும் செய்கிறேன். [ஒரு நாளில் நூறு முறை]",
                    "reference": "Al-Bukhârî [6307](11/101) and Muslim [2702](4/2075)."
                },
                {
                    "id": 97,
                    "group_id": 27,
                    "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ [ثَلاثَ مَرَّاتٍ إذا أمْسَى]",
                    "translation": "அல்லாஹ்வின் முழுமையான வார்த்தைகளில் நான் அவரால் படைக்கப்பட்ட தீமையிலிருந்து பாதுகாப்பு கேட்கிறேன். [மாலை மூன்று முறை]",
                    "reference": "Aĥmad (2/290), An-Nisâ'i ['Amal al-Yawm wa al-Laylah][590], Ibn As-Sunnî (68). Also see Ŝaĥîĥ At-Tirmidhî (3/187), Ŝaĥîĥ Ibn Mâjah (2/266) and Tuĥfat Al-Akhyâr (p. 45)"
                },
                {
                    "id": 98,
                    "group_id": 27,
                    "dua": "اللَّهُمَّ صَلِّ وَ سَلِّمْ عَلَى نَبِيِّنَا مُحَمَّدٍ [عَشْرَ مَرَّاتٍ]",
                    "translation": "அல்லாஹ்வே, நம் நபி முஹம்மதுக்கு சாலவாத்தும், சமாதானமும் அனுப்புவாயாக. [பத்து முறை]",
                    "reference": "Ať-Ťabarânî through two chains, one of which is good. See Majm'u Az-Zawâ 'id (10/120) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [656](1/273)."
                }
            ]
        },
        {
            "group_id": 28,
            "title": "தூங்குவதற்கு முன்",
            "duas": [
                {
                    "id": 99,
                    "group_id": 28,
                    "dua": "﴾قُل هُوَ اللهُ أحَدٌ...﴿﴾قُلْ أعُوذُ بِرَبِّ اْلفَلَقِ...﴿﴾قُلْ أعُوذُ بِرَبِّ النَّاسِ...﴿[ثلاث مرات]",
                    "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) உறங்குவதற்கு முன், இரவு எவ்வாறாகத் தமது கைகளைக் கூப்பி வைத்து, (வாய் மூடி துப்பி), குர்ஆனின் இறுதிக் கடவுள் 3 அத்தியாயங்களை ஓதி, தமது மொத்த உடலையும் அவரது கைகளால் தொடுவார், தலையிலிருந்து தொடங்கி முகத்தைத் தொடுவார், பின்னர் உடலின் அனைத்து பகுதிகளையும் தொடுவார்; இதை மூன்று முறை செய்ய வேண்டும்.",
                    "reference": "Al-Bukhârî [5017](9/62) and Muslim [2192](4/1723)."
                },
                {
                    "id": 100,
                    "group_id": 28,
                    "dua": "﴾اللهُ لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ... ﴿",
                    "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'நீங்கள் தூங்குவதற்கு முன் ஆயத்துல் குர்சியைக் கூறுங்கள், அதனால் நீங்கள் மறுநாளுக்குத் துலக்கமுறுவீர்கள், சைத்தான் உங்கள் அருகே வரமாட்டான்.'",
                    "reference": "Al-Bukhârî [2311](4/487)."
                },
                {
                    "id": 101,
                    "group_id": 28,
                    "dua": "﴾ءامَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ...﴿",
                    "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'எவன் இரவில் சூரா அல்-பகாராவின் கடைசி இரு வசனங்களை ஓதுகிறானோ; அவை அவனுக்கு போதுமானது.'",
                    "reference": "Al-Bukhârî [4008](9/94) and Muslim [808](1/554)."
                },
                {
                    "id": 102,
                    "group_id": 28,
                    "dua": "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فإِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ",
                    "translation": "நீங்கள் உங்கள் படுக்கையில் இருந்து எழுந்து மீண்டும் படுக்கையில் வந்து சேரும்போது, துவாரத்தின் மூலமாக உங்கள் உடலை மூன்று முறை சுத்திகரித்துவிடுங்கள்; அவர் உம்மை காக்கவேண்டும் என்று வேண்டுங்கள்.",
                    "reference": "Al-Bukhârî [6320](11/126) and Muslim [2714](4/2084)."
                },
                {
                    "id": 103,
                    "group_id": 28,
                    "dua": "اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسي وَأَنْتَ تَوَفَّاهـَا، لَكَ مَمَاتُهَا وَمَحْيَاهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا، اللَّهُمَّ إِنَّي أَسْألُكَ العَافِيَةَ",
                    "translation": "அல்லாஹ்வே, நீர் என்னை உயிருடன் படைத்தவர், உம்முடைய காப்பு என்னுடைய உயிர்வாழ்தல், நீர் என் உயிரை காக்கும்பொழுது, அதற்குக் காக்கவும், இறக்கும் போது மன்னிக்கவும் வேண்டுகிறேன். அல்லாஹ்வே, நான் உம்மிடம் நலத்தை கேட்கிறேன்.",
                    "reference": "Muslim [2712](4/2083) and Aĥmad (2/79)."
                },
                {
                    "id": 104,
                    "group_id": 28,
                    "dua": "اللَّهُمَّ قِنِي عَذابَكَ، يَوْمَ تَبْعَثُ عِبَادَكَ",
                    "translation": "அல்லாஹ்வே, உமது கோபத்தில் இருந்து என்னைக் காக்கவும் வேண்டுகிறேன், நீர் உமது அடியவர்களை அழைக்கும்போது என்னை காக்கவும்.",
                    "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
                },
                {
                    "id": 105,
                    "group_id": 28,
                    "dua": "بِاسْمِكَ اللَّهُمَّ أَموتُ وَأحْيَا",
                    "translation": "உமக்கு புகலுகிறேன், இறைவா, நான் இறக்கும் போது, நான் உயிரோடு இருப்பதற்காகவும் உமக்கு புகலுகிறேன்.",
                    "reference": "Abû Dâwud [5045](4/311). Also see Ŝaĥîĥ At-Tirmidhî (3/143)."
                },
                {
                    "id": 106,
                    "group_id": 28,
                    "dua": "سُبْحَانَ اللهِ (ثَلاثاً وثَلاثِينَ)وَالحَمْدُ لِلَّهِ (ثَلاثاً وثَلاثِينَ)وَاللهُ أكْبرُ (أربَعاً وثَلاثِينَ)",
                    "translation": "அல்லாஹ்வின் மகிமையைக் கொண்டு நான் அவரைப் புகழ்கிறேன் [முப்பத்தி மூன்று முறை]அல்லாஹ்வை மகிமையைக் கொண்டு புகழ்கிறேன் [முப்பத்தி மூன்று முறை]அல்லாஹ் மிகப் பெரியவர் [நாற்பத்து நான்கு முறை]",
                    "reference": "Al-Bukhârî [3705](7/71) and Muslim [2727](4/2091)."
                },
                {
                    "id": 107,
                    "group_id": 28,
                    "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَرَبَّ الأرْضِ، وربَّ العَرْشِ العَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيءٍ، فَالِقَ الحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالإنْجِيْلِ و الفُرْقَانِ، أَعوذُ بِكَ مِن شَرِّ كُلِّ شَيءٍ أَنْتَ آخِذٌ بِنَاصِيتِهِ، اللَّهُمَّ أَنْتَ الأوَّلُ فَلَيْسَ قَبْلَكَ شَيءٌ، وَأَنْتَ الآخِرُ فَلَيْسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ، وَأَغْنِنَا مِنَ الفَقْرِ",
                    "translation": "அல்லாஹ்வே, ஏழு வானங்களின் இறைவனே, உலகங்களின் இறைவனே, மிகப் பெரிய சிங்காசனத்தின் இறைவனே, எங்கள் இறைவனும் எல்லா பொருட்களுக்கும் இறைவனும் நீர் தான், நீர் விதையைப் பிளந்தவரும் கடவுளின் விதிகளை வழங்கியவருமாவீர், நான் உம்மிடம் புகலுகிறேன் அனைத்து தீமைகளிலிருந்தும். நீர் முதலில் இருப்பவர், உம்மிற்கு முன்பாக யாரும் இல்லை. நீர் கடைசியில் இருப்பவர், உம்மிற்கு பின்னர் யாரும் இல்லை. உம் வாழ்வு மேலிருந்து கீழ்வரியூது அல்ல. உதவி செய்.",
                    "reference": "Muslim [2713](4/2084)."
                },
                {
                    "id": 108,
                    "group_id": 28,
                    "dua": "الحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنَا وَسَقَانَا، وَكَفَانَا، وَآوَانَا، فَكَمْ مِمَّنْ لَا كَافِيَ لَهُ وَلَا مُؤْوِيَ",
                    "translation": "எங்களுக்கு உணவளித்த அல்லாஹ்விற்கு புகழ், எங்களுக்கு குடிக்கும் தண்ணீர் அளித்தவரே, எங்களை காத்தவரும் உணவளித்தவரும் புகழ்.",
                    "reference": "Muslim [2715](4/2085)."
                },
                {
                    "id": 109,
                    "group_id": 28,
                    "dua": "اللَّهُمَّ عالِمَ الغَيْبِ وَالشّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالأرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلَيْكَهُ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَعُوذُ بِكَ مِن شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطَانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُـرَّهُ إِلَى مُسْلِمٍ",
                    "translation": "அல்லாஹ்வே, மறையும் வெளிப்படும் அனைத்தையும் அறிந்தவரே, வானங்களையும் பூமியையும் படைத்தவரே, எல்லா பொருள்களுக்கும் இறைவனும் அரசனும் நீரே, உம்மைத் தவிர வேறேவும் வணக்கத்திற்குரியவர் இல்லை என நான் சாட்சியாக உறுதிசெய்கிறேன். என்னுடைய பிராணனில் உள்ள தீமையிலிருந்து, சைத்தானின் கூட்டு தீமைகளிலிருந்து உமக்கு புகல்கிறேன்.",
                    "reference": "Abû Dâwud [5083](4/317). Also see Ŝaĥîĥ At-Tirmidhî (3/142)."
                },
                {
                    "id": 110,
                    "group_id": 28,
                    "dua": "يَقْرَاُ ﴾الٓمٓ . تَنْزِيْلُ الْكِتَابِ...﴿ وَ ﴾تَبَارَكَ الَّذِي بِيَدِهِ المُلْكَ...﴿",
                    "translation": "சூரா அஸ்சஜ்தா மற்றும் சூரா அல்-முல்கை ஓதுங்கள்.",
                    "reference": "At-Tirmidhî [3404] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][707]. Also see Ŝaĥîĥ Al-Jâmi' [4873](4/255)."
                },
                {
                    "id": 111,
                    "group_id": 28,
                    "dua": "اللَّهُمَّ أَسْلَمْتُ نَفْسِي إِلَيْكَ، وَفَوَّضْتُ أَمْرِي إِلَيْكَ، وَوَجَّهْتُ وَجْهِي إِلَيْكَ، وَأَلْجَأتُ ظَهْرِي إِلَيْكَ، رَغْبَةً وَرَهْبَةً إِلَيْكَ، لَا مَلْجَأَ وَلا مَنْجَا مِنْكَ إِلَّا إِلَيْكَ، آمَنْتُ بِكِتَابِكَ الَّذِي أَنْزَلْتَ، وَبِنَبِيِّكَ الَّذِي أَرْسَلْتَ",
                    "translation": "அல்லாஹ்வே, நான் என் பிராணனை உமக்கு ஒப்புக்கொள்கிறேன், நான் என் காரியங்களை உமக்காகவே வழங்குகிறேன், என்னுடைய முகத்தை உம்முடைய பாதையிலேயே திருப்புகிறேன், உம்முடைய கரங்களில் மட்டுமே முழு நம்பிக்கையோடு இருக்கிறேன், உம்மையே புகலக் காத்துக்கொள்ளக் கேட்டுக்கொள்கிறேன். நான் உமது பிராணனாக இருக்கிறேன், உமது தூதர் முஹம்மதின் வழியில் இருக்கிறேன்.",
                    "reference": "Al-Bukhârî [6313,6315,7488](11/113) and Muslim [2710](4/2081)."
                }
            ]
        },
        {
            "group_id": 29,
            "title": "நாளை மாறும் பொழுது",
            "duas": [
                {
                    "id": 112,
                    "group_id": 29,
                    "dua": "لَا إِلَهَ إِلَّا اللهُ الوَاحِدُ القَهَّارُ، رَبُّ السَّمَوَاتِ وَالأرْضِ وَمَا بَيْنَهُمَا العَزِيْزُ الغَـفَّارُ",
                    "translation": "அல்லாஹ்வைத்தவிர வேறெவரும் வணக்கத்திற்குரியவர் அல்லர், எல்லாம் வல்லவர். வானங்களின் இறைவனும், உலகங்களின் இறைவனும், எல்லாவற்றிற்கும் மேலானவர், மன்னிப்பு தருபவரும்.",
                    "reference": "Al-Hâkim (1/540) and he authenticated it and Adh-Dhahabî agreed with him, An-Nisâ'i ['Amal al-Yawm wa al-Laylah][864] and Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah](757). Also see Ŝaĥîĥ Al-Jâmi' [4693](4/213)."
                }
            ]
        },
        {
            "group_id": 30,
            "title": "குறுவனத்தில், அச்சத்தில், பயத்தில் அல்லது ஏனைய தூக்கம் சமயங்களில் நிகழும் இக்கட்டான நிகழ்வுகளில்",
            "duas": [
                {
                    "id": 113,
                    "group_id": 30,
                    "dua": "أَعُوذُبِكَلِمَاتِ اللهِ التَّامَّاتِ، مِنْ غَضَبِهِ وَعِقَابِهِ، وَشَرِّ عِبَادِهِ، وَمِنْ هَمَزَاتِ الشَّيَاطِينِ، وَأنْ يَحْضُرُونِ",
                    "translation": "அல்லாஹ்வின் முழுமையான வார்த்தைகளில் நான் அவரால் உருவாக்கப்பட்ட அனைத்து சேதங்களை விலக்கவும் வேண்டுகிறேன்.",
                    "reference": "Abû Dâwud [3893](4/12). Also see Ŝaĥîĥ At-Tirmidhî (3/171)."
                }
            ]
        },
        {
            "group_id": 31,
            "title": "நல்ல அல்லது கெட்ட கனவைப் பார்த்தவுடன்",
            "duas": [
                {
                    "id": 114,
                    "group_id": 31,
                    "dua": "يَنْفُثُ عَن يَسَارِهِ (ثَلاثاً).يَسْتَعِيْذُ بِااللهِ مِنَ الشَّيْطَانِ، وَ مِنْ شَرِّ مَا رَأَى (ثَلاثَ مَرَّاتٍ).لَا يُحَدِّثُ بِهَا أحَداً.يتحَوَّلُ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ",
                    "translation": "கெட்ட கனவு வந்தால் செய்ய வேண்டியது:(1) உங்கள் இடது பக்கத்தில் மூன்று முறை துப்புங்கள்.(2) சைத்தானிலிருந்து மற்றும் நீங்கள் கண்ட கனவின் தீமையிலிருந்து அல்லாஹ்வை நாடுங்கள், மூன்று முறை.(3) கனவை யாரிடமும் கூறாதீர்கள்.(4) நீங்கள் முதலில் படுத்திருந்த பக்கத்தை மாற்றிப் படுத்துக்கொள்ளுங்கள்.",
                    "reference": "Al-Bukhârî [7044] and Muslim [2261](4/1772)."
                },
                {
                    "id": 115,
                    "group_id": 31,
                    "dua": "يَقُومُ يُصَلِّي إنْ أرَادَ ذَلِكَ",
                    "translation": "நீங்கள் விழித்து விட்டு தொழுகை செய்ய விரும்பினால் செய்யுங்கள்.",
                    "reference": "Muslim [2263](4/1773)."
                }
            ]
        }
    ]
},
  {
      "category_id": 2,
      "title": "பிரார்த்தனை",
      "group": [
          {
              "group_id": 8,
              "title": "அப்துலுக்கான போது",
              "duas": [
                  {
                      "id": 12,
                      "group_id": 8,
                      "dua": "بِسْمِ اللهِ",
                      "translation": "அல்லாஹ்வின் பெயரில்.",
                      "reference": "Abû Dâwud [101], Ibn Mâjah [399] and Aĥmad (2/418). Also see Irwâ'-ul-Ghalîl (1/122)."
                  }
              ]
          },
          {
              "group_id": 9,
              "title": "அப்துலுக்கினை நிறைவுசெய்த பிறகு",
              "duas": [
                  {
                      "id": 13,
                      "group_id": 9,
                      "dua": "أَشْهَدُ أَنْ لَّا إِلَهَ إِلَّا اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
                      "translation": "அல்லாஹ் தவிர worship செய்ய உரிமை உள்ளவரே இல்லை, அவர் தனி, பங்குபற்றாமல், மற்றும் முகமது, அவரது அடியார் மற்றும் தூதன் என்பதை நான் உட்கொள்ளுகிறேன்.",
                      "reference": "Muslim [234](1/209)."
                  },
                  {
                      "id": 14,
                      "group_id": 9,
                      "dua": "اللَّهُمَّ اجْعَلْنِي مِنَ التَّوَّابِينَ، وَاجْعَلْنِي مِنَ الْمُتَطَهِّرِينَ",
                      "translation": "அல்லாஹ், என்னை மிகவும் திரும்ப வரும் மக்களில் செய்து, என்னை தூய்மையாகவும் வைத்திருக்கவும்.",
                      "reference": "At-Tirmidhî [55](1/78). Also see Ŝaĥiĥ At-Tirmidhî (1/18)."
                  },
                  {
                      "id": 15,
                      "group_id": 9,
                      "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَّا إِلٰهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيكَ",
                      "translation": "அல்லாஹ், நீங்கள் எவ்வளவு பரிபூர்ணமானவர்கள், நான் உங்களை புகழுகிறேன். நான் ஒரு தனி அல்லாஹ்விற்கு worship செய்ய உரிமை உள்ளவரே இல்லை என்பதை நான் உறுதியாக்குகிறேன். நான் உன்னை மன்னிக்கவும், திரும்பவும் வருவேன்.",
                      "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][81](173)."
                  }
              ]
          },
          {
              "group_id": 12,
              "title": "மஸ்ஜிதிற்கு செல்லும் போது",
              "duas": [
                  {
                      "id": 19,
                      "group_id": 12,
                      "dua": "اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُوْراً، وَفِي لِسَانِي نُوْراً، وَ فِي سَمْعِي نُوْراً، وَ فِي بَصَري نُوْراً، وَ مِنْ فَوقِي نُوْراً، وَمِنْ تحْتِي نُوْراً، وَعَنْ يَمِيْنِي نُوْراً، وَ عَنْ شِمَالِي  نُوْراً، وَ مِنْ أَمَامِي نُوْراً، وَ مِنْ خَلْفِي نُوراً، واجْعَلْ فِي نَفْسِي نُوراً، وَ أعْظِمْ لي نُوراً، وَ عَظِّمْ لي نُوراً، وَاجْعَلْ لي نُوراً، وَاجْعَلْنِي نُوراً، اللهم أَعْطِنِي نُوراً، وَاجْعَلْ في عَصَبِي نُوراً، وَ في لَحْمِي نُوراً، وَ في دَمِي نُوراً، وَ في شَعْرِي نُوراً، وَ في بَشَرِي نُوراً(١)[اللهم اجْعَلْ لي نُوراً في قَبْرِي...وَ نُوراً في عِظَامِي](٢)[وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً، وَ زِدْنِي نُوراً](١)[وَهَبْ لِي نُوراً عَلَى نُورٍ](٢)",
                      "translation": "அல்லாஹா, எனது இதயத்தில் ஒளியை நிரப்பவும், எனது லேசனில் ஒளியை நிரப்பவும், எனது காதுகளில் ஒளியை நிரப்பவும், எனது பார்வையில் ஒளியை நிரப்பவும், எனது மேலோடு ஒளியை நிரப்பவும், எனது கீழே ஒளியை நிரப்பவும், எனது வலது பக்கம் ஒளியை நிரப்பவும், எனது இடது பக்கம் ஒளியை நிரப்பவும், எனது முன்னால் ஒளியை நிரப்பவும் மற்றும் எனது பின்னால் ஒளியை நிரப்பவும். என் ஆத்மையில் ஒளியை நிரப்பவும். எனக்கு ஒளியை பெரிதாகக் காக்கவும், எனக்கு ஒளியை அளிக்கவும், எனக்கு ஒளியாகவும், எனக்கு ஒரு ஒளியாகவும் இருக்கச் சொல். அல்லாஹா, எனக்கு ஒளியை அளிக்கவும், என் நரம்புகளில் ஒளியை நிரப்பவும், என் உடலில் ஒளியை நிரப்பவும், என் இரத்தத்தில் ஒளியை நிரப்பவும், என் முடியில் ஒளியை நிரப்பவும், என் தோல்களில் ஒளியை நிரப்பவும்.[அல்லாஹா, எனது கல்லில் ஒளி அளிக்கவும்... மற்றும் என் எலும்புகளில் ஒளி நிரப்பவும்].[ஒளியை அதிகரிக்கவும், ஒளியை அதிகரிக்கவும், ஒளியை அதிகரிக்கவும்].",
                      "reference": "(1) Al-Bukhârî [6316](11/116) and Muslim [763](1/526,529,530).(2) At-Tirmidhî [3419](5/483)."
                  }
              ]
          },
          {
              "group_id": 13,
              "title": "மஸ்ஜிதில் நுழையும்போது",
              "duas": [
                  {
                      "id": 20,
                      "group_id": 13,
                      "dua": "(يَبْدَأُ بِرِجْلِهِ اليُمْنَى)(١)، ويقول: (أَعُوْدُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢)، (بِسْمِ اللَّهِ, وَالصَّلاةُ)(٣) [وَالسَّلامُ عَلَى رَسُوْلِ اللَّهِ](٤)، (اللَّهُمَّ افْتَحْ لِي أَبْوَابَ رَحْمَتِكَ)(٥)",
                      "translation": "(உன் வலது காலால் நுழையுங்கள்)(๑), மற்றும் பிறகு கூறுங்கள்: (நான் அல்லாஹ்வின் மீது ஆட்பாட்டின் மேன்மையை, அவரது கௌரவ முகம் மற்றும் அவரது நிரந்தர அதிகாரத்துடன், பழிவாங்கிய மவுனத்திடம் நான் எதிர்த்துப் பார்க்கிறேன்.)(๒) , (அல்லாஹ்வின் பெயரில், மற்றும் பிரார்த்தனை)(³)[அல்லாஹ்வின் தூதர் மீது سلام](४), (அல்லாஹா, எனக்கான கிருபையின் கதவுகளை திறக்கவும்)(٥)",
                      "reference": "(1) Al-Hakim (1/218) and he authenticated it with the conditions of Muslim and Adh-Dhahabî agreed with him, Al-Baihaqî (2/442), and Al-Albânî  declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĥah [2478](5/624).(2) Abû Dâwud [466]. Also see Ŝaĥiĭh Al-Jâmi' [4591].(3) An-Nisâ'i [88] and Al-Albânî declared it ĥasan.(4) Abû Dâwud [465](1/126). Also see Ŝaĥiĭh Al-Jâmi' [514](1/528).(5) Muslim [713](1/494), Ibn Mâjah [771] and Al-Albânî declared it ŝaĥiĭh due to its shawâhid; see Ŝaĥiĭh Ibn Mâjah (1/128-129)."
                  }
              ]
          },
          {
              "group_id": 14,
              "title": "மஸ்ஜிதை விட்டுவிடும் போது",
              "duas": [
                  {
                      "id": 21,
                      "group_id": 14,
                      "dua": "(يَبْدَأُ بِرِجْلِهِ الْيُسْرَى)(١)، وَ يَقُولُ: (بِسْمِ اللهِ وَ الصَّلاةُ وَالسَّلامُ عَلَى رَسُولِ اللهِ، اللهم إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ، اللهم اعْصِمْنِي مِنَ الشَّيْطَانِ الرَّجِيْمِ)(٢) ",
                      "translation": "(உன் இடது காலால் விலகுங்கள்)(๑), மற்றும் பிறகு கூறுங்கள்: (அல்லாஹ்வின் பெயரில், மற்றும் பிரார்த்தனை மற்றும் அல்லாஹ்வின் தூதர் மீது سلام. அல்லாஹா, நான் உன் கௌரவத்திலிருந்து கேட்கிறேன். அல்லாஹா, நான் பழிவாங்கிய மவுனத்திடமிருந்து பாதுகாத்து கொள்ளுங்கள்)(๒)",
                      "reference": "(1) Al-Hâkim (1/218), Al-Baihaqî (2/442) and Al-Albânî declared it ĥasan in Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĭhah [2478](5/624)(2) See takhrîj of the previous hadith (du'a #20) and the extension( اللهم اعصمني من الشيطان الرجيم) is from Ibn Mâjah [773], see Ŝaĥîĭh Ibn Mâjah (1/129)."
                  }
              ]
          },
          {
              "group_id": 15,
              "title": "அதான் (அழைப்பு) குறித்தவை",
              "duas": [
                  {
                      "id": 22,
                      "group_id": 15,
                      "dua": "يَقُولُ مِثْلَ مَا يَقُولُ المُؤَذِّنُ إلَّا فِي «حَيَّ عَلَى الصَّلاةِ» وَ «حَيَّ عَلَى الفَلاحِ» فَيَقُولُ: «لَا حَولَ وَ لَا قُوَّةَ إلَّا بِاللهِ».",
                      "translation": "ஒரு அழைப்பாளர் (நேர்மையானவர்) கூறியதை ஒருவரும் மீண்டும் கூற வேண்டும், “தோழர்! பிரார்த்தனைக்கு வர!” அல்லது “வாழ்க்கைக்கு வர!” என்று சொல்லும் போது, ஒருவர் கூற வேண்டும்: “இறைவனை வலுவாகவும் அதிகாரமுடன் அழைக்கிறேன்” என்றால், அவனை சிக்கிய உணர்வில் விட்டுவிடுங்கள்.",
                      "reference": "Al-Bukhârî [611](1/152) and Muslim [383](1/288)."
                  },
                  {
                      "id": 23,
                      "group_id": 15,
                      "dua": "يَقُولُ: «وَ أَنَا أَشْهَدُ أَنْ لَا إله إلَّا اللهُ وَ حْدَهُ لَا شَرِيْكَ لَهُ، وَ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ، رَضِيْتُ بِاللهِ رَبًّا، وَ بِمُحَمَّدٍ رَسُولًا، وَ بِالإِسْلامِ دِيْنًا»(١) «يَقُولَ ذَلِكَ عَقِبَ تَشَهُّدِ المُؤَذِّنِ»(٢)",
                      "translation": "அழைப்பாளர் கூறும் போது, “இறைவன் தவிர worship செய்ய உரிமை உள்ளவரே இல்லை, தனியாக, பங்குபற்றாமல், முகமது, அவரது அடியார் மற்றும் தூதன் என்பதை நான் உறுதியாக்குகிறேன். நான் இறைவன் ஆகிய அவனை தேவைப்படுத்துகிறேன்.” என்றால், “என்னை நன்றாக, அறிவியல் முனைவோரை எடுத்துக்கொள்ளுங்கள்” என்று கூறுங்கள்.",
                      "reference": "(1) Muslim [386](1/290).(2) Ibn Khuzaîymah [422](1/220)."
                  },
                  {
                      "id": 24,
                      "group_id": 15,
                      "dua": "يُصَلِّي عَلَى النَّبِي صلى الله عليه وسلم بَعْدَ فَرَاغِهِ مِنْ إِجَابَةِ المُؤَذِّنِ.",
                      "translation": "அழைப்பாளரின் அழைப்புக்கு பதிலளிக்கிறவருக்குப் பிறகு, நபியிடம் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) பிரார்த்தனை செய்ய வேண்டும்.",
                      "reference": "Muslim [384](1/288)."
                  },
                  {
                      "id": 25,
                      "group_id": 15,
                      "dua": "يَقُولُ: «اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ ، وَالصَّلاةِ القَائِمَةِ ، آتِ مُحَمَّداً الوَسِيْلَةَ وَالفَضِيْلَةَ ، وَابْعَثْهُ مَقَاماً مَحْمُوْداً الَّذِي وَعَدْتَهُ ، [إِنَّكَ لاَ تُخْلِفُ الْمِيعَادِ] »",
                      "translation": "நான் கெளரவமானவர் ஆகவும் என்னிடம் பேசுபவராய் இருக்கவும், ‘அல்லாஹா, இவனின் அழைப்பு மற்றும் அவனை தொழுதுக்கொண்டு உன்னிடம் உன்னை அழைக்கிறேன். நான் உனக்கு அழைக்கிறேன்’ என்று சொல்.",
                      "reference": "Al-Bukhârî [614](1/152) and what is between the brackets is from Al-Baihaqî (1/410). Shaykh Abdul 'Azîz bin Bâz authenticated the chain of the latter in Tuĥfah Al-Akhbâr (p. 38)."
                  },
                  {
                      "id": 26,
                      "group_id": 15,
                      "dua": "يَدْعُو لِنَفْسِهِ بَيْنَ الأَذَانِ وَالإِقَامَةِ؛ فَإنَّ الدُّعَاءَ حِيْنَئذٍ لَا يُرَدُّ.",
                      "translation": "மூண்காலத்திலும், அழைப்புக்கு அடுத்ததாக, ஒரு வேலையாளர் சம்மந்தமாக உள்ளது. இதற்கு முன்பாக ஒருவர் அழைப்புக் கொண்டு பதிலளித்தால், “அனைவரும் ஒரே நோக்கில் இருத்தல்” என்று கூறலாம்.",
                      "reference": "At-Tirmidhî [212], Abû Dâwud [521] and Ahmad [3/119]. Also see Irwâ'-ul-Ghalîl (1/262)."
                  }
              ]
          },
          {
              "group_id": 16,
              "title": "பிரார்த்தனையின் தொடக்கம் (தக்கீர் பிறகு)",
              "duas": [
                  {
                      "id": 27,
                      "group_id": 16,
                      "dua": "اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَايَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، اللَّهُمَّ نَقِّنِي مِنْ خَطَايَايَ، كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ، اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَايَ، بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ.",
                      "translation": "அல்லாஹா, என் பாவங்களை கிழமையால் நீக்கவும், பருத்தி போல தூய்மையாக்கவும், அவைகளை நீத்துவிடவும். அல்லாஹா, எனக்கு என் பாவங்களை நீரால், குளிரின் மழையால், மற்றும் உறையும் மூலம் மன்னிக்கவும்.",
                      "reference": "Al-Bukhârî [744](1/181) and Muslim [598](1/419)."
                  },
                  {
                      "id": 28,
                      "group_id": 16,
                      "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ، وَلاَ إِلَهَ غَيْرُكَ.",
                      "translation": "அல்லாஹ், நீங்கள் எவ்வளவு பரிபூர்ணமாக இருக்கிறீர்கள், நான் உங்களை புகழ்கிறேன். உங்கள் பெயர் போற்றப்பட்டிருக்கிறது, உயர்ந்தது, மற்றும் வேறு worship செய்ய உரிமை உள்ளவரே இல்லை.",
                      "reference": "Abû Dâwud [775,776], At-Tirmidhî [242, 432], An-Nisâ'i (2/133), and Ibn Mâjah [804, 806]. Also see Ŝaĥîĭh At-Tirmidhî (1/77) and Ŝaĥîĭh Ibn Mâjah (1/135)."
                  },
                  {
                      "id": 29,
                      "group_id": 16,
                      "dua": "وَجَّهْتُ وَجْهِيَ لِلَّذِي فَطَرَ السَّمَوَاتِ وَالأَرْضَ حَنِيفاً وَمَا أَنَا مِنَ الْمُشْرِكِينَ، إِنَّ صَلاتِي، وَنُسُكِي، وَمَحْيَايَ, وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ، لاَ شَرِيكَ لَهُ، وَبِذَلِكَ أُمِرْتُ وَأَنَا مِنَ الْمُسْلِمِينَ. اللَّهُمَّ أَنْتَ الْمَلِكُ لاَ إِلَهَ إِلاَّ أَنْتَ، أَنْتَ رَبِّي، وَأَنَا عَبْدُكَ، ظَلَمْتُ نَفْسِي، وَاعْتَرَفْتُ بِذَنْبِي فَاغْفِرْ لِي ذُنُوبِي جَمِيعاً إِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، وَاهْدِنِي لأَحْسَنِ الأَخْلاقِ لا يَهْدِي لأَحْسَنِهَا إلاَّ أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا لاَ يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ، وَالشَّرُّ لَيْسَ إِلَيْكَ، أَنَا بِكَ وَإِلَيْكَ، تَبَارَكْتَ وَتَعَالَيْتَ، أَسْتَغْفِرُكَ وَأَتُوْبُ إِلَيْكَ.",
                      "translation": "நான் விண்ணும் பூமியையும் உருவாக்கியவருக்கு என் முகத்தை நேர்மையாக திருப்புகிறேன், நான் கூட worship செய்ய உரிமை உள்ளவரே இல்லை. எனது தொழுகை, எனது வலிமை, எனது வாழ்க்கை மற்றும் எனது மரணம் எல்லாம் உலகளாவிய இறைவனுக்கே. இதற்காக நான் கட்டளை பெற்றேன், நான் இஸ்லாமுக்குள் இருக்கிறேன். அல்லாஹா, நீங்கள் மன்னிப்பவராக, மற்றவர் அல்லவா? எனது எல்லா பாவங்களுக்கும் மன்னிக்கவும். என் பண்புகளுக்கு மேன்மை வழங்கவும். நீர் மட்டுமே என்னை விலகவைக்கலாம்.",
                      "reference": "Muslim [771](1/534)."
                  },
                  {
                      "id": 30,
                      "group_id": 16,
                      "dua": "اللهم رَبَّ جِبرَائِيْلَ، وَ مِيكَائيْلَ، وَإسْرَافيْلَ، فَاطِرَ السَّمَوَاتِ وَ الأرْضِ، عَالِمَ الغَيْبِ وَ الشَّهَادَةِ، أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ، اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الحَقِّ بِإذْنِكَ، إنَّكَ تَهْدِي مَنْ تَشَاءُ إلَى صِرَاطٍ مُسْتَقِيمٍ.",
                      "translation": "அல்லாஹா, ஜிப்ரீல், மிக்காயில் மற்றும் இஸ்ராஃஃபீல் (மிகைத் தேவன்கள்) ஆகியவர்களின் ஆண்டவர், விண்ணும் பூமியையும் உருவாக்கியவர், காணப்படும் மற்றும் காணாதவரின் அறிவாளர். நீங்கள் உங்களது அடியார்களிடையிலான அடியார்களுக்கு தீர்ப்பு வழங்குகிறீர்கள், நீங்கள் தீர்ப்பளிக்க வேண்டும், நீங்கள் நினைத்துக் கொண்டு உள்ளவர்களுக்கு வழிகாட்டுங்கள்.",
                      "reference": "Muslim [770](1/534)."
                  },
                  {
                      "id": 31,
                      "group_id": 16,
                      "dua": "اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، اللهُ أكْبَرُ كَبِيراً، وَ الحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَالحَمْدُلِلَّهِ كَثِيراً، وَ سُبْحَانَ اللهِ بُكْرَةً وَأصِيلاً (ثَلاثًا) أعُوذ بِا اللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْحِهِ وَ نَفْثِهِ، وَ هَمْزِهِ.",
                      "translation": "அல்லாஹ் மிக பெரியவர், அல்லாஹ் மிக பெரியவர், அல்லாஹ் மிக பெரியவர், பெருமகிழ்ச்சி அல்லாஹ்வுக்கு, பெருமகிழ்ச்சி அல்லாஹ்வுக்கு, பெருமகிழ்ச்சி அல்லாஹ்வுக்கு, மற்றும் மாலை மற்றும் பகலில் அல்லாஹ்வை சுத்தமாக்குகிறேன் (மூன்று முறையிலும்) நான் கெட்ட மனம் மற்றும் அதிலிருந்து நிறைவு பெறுவதிலிருந்து பாதுகாத்தேன்.",
                      "reference": "Abû Dâwud [764](1/203), Ibn Mâjah [807](1/265), Ahmad (4/85), and Muslim [601](1/420) with extension from: (مِنْ نَفْحِهِ )."
                  },
                  {
                      "id": 32,
                      "group_id": 16,
                      "dua": "اللهم لَكَ الحَمْدُ أنْتَ نُورُ السَّمَوَاتِ و الأرْضِ وَ مَنْ فِيهِنَّ، وَ لَكَ الحَمْدُ أنْتَ قَيِّمُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ، [وَ لَكَ الحَمْدُ أنْتَ رَبُّ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ] ، [وَ لَكَ الحَمْدُ لَكَ مُلْكُ السَّمَوَاتِ وَ الأرْضِ وَ مَنْ فِيهِنَّ][وَ لَكَ الحَمْدُ أنْتَ مَلِكُ السَّمَوَاتِ وَ الأرْضِ][وَ لَكَ الحَمْدُ][أنْتَ الحَقُّ، وَ وَعْدُكَ الحَقُّ، وَ قَولُكَ الحَقُّ، وَ لِقَاؤُكَ الحَقُّ، وَ الجَنَّةُ حَقٌّ، وَ النَّارُ حَقٌّ، وَ النَّبِيُّونَ حَقٌّ، وَ مُحَمَّدٌﷺ حَقٌّ، وَالسَّاعَةُ حَقٌّ][اللهم لَكَ أسْلَمْتُ، وَ عَلَيْكَ تَوَكَّلْتُ، وَ بِكَ آمَنْتُ، وَ إلَيْكَ أنَبْتُ، وَ بِكَ خَاصَمْتُ، وَ إلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، و أخَّرْتُ، وَ مَا أسْرَرْتُ، وَ مَا أعْلَنْتُ][أنْتَ المُقَدِّمُ، وَ أنْتَ المُؤَخِّرُ لَا إله إلَّا أنْتَ][أنْتَ إلَهِي لَا إله إلَّا أنْتَ].",
                      "translation": "நான் தூங்குவதற்குப் பிறகு (மாலை) முற்றிலும் அற்புதமானதாகவும் பரிசு மிக்கதாகவும் இருந்தேன். நான் உண்மையாகவே சொல்வேன். நான் அவருக்கு அத்தியாயங்களை வாங்கியதன் மூலம், நான் உண்மையாக இருக்கிறேன். நான் அவருக்கு மன்னிப்பு கோரும்.",
                      "reference": "Al-Bukhârî (3/3), (11/116), and [1120](13/371, 423, 465) and Muslim [769](1/532) in a summarised form."
                  }
              ]
          },
          {
              "group_id": 17,
              "title": "பிரார்த்தனையின் போது வணங்கும்போது",
              "duas": [
                  {
                      "id": 33,
                      "group_id": 17,
                      "dua": "سُبْحَانَ رَبِّيَ الْعَظِيمِ (ثلاثا) ",
                      "translation": "என் ஆண்டவர், உயர்ந்தவர், எவ்வளவு புனிதமானவர் (மூன்று முறைகள்)",
                      "reference": "Abû Dâwud [871],  At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah (888) and Aĥmad (5/382, 394). Also see Ŝaĥîĭh At-Tirmidhî (1/83)."
                  },
                  {
                      "id": 34,
                      "group_id": 17,
                      "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْلِي",
                      "translation": "அல்லாஹா, எங்களுடைய ஆண்டவர், நான் உங்களை புகழ்கிறேன். அல்லாஹா, எனக்கு மன்னிக்கவும்.",
                      "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
                  },
                  {
                      "id": 35,
                      "group_id": 17,
                      "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
                      "translation": "அவர் எவ்வளவு பரிபூர்ணமானவர், தூதர்கள் மற்றும் ரூஹின் ஆண்டவர் (ஜிப்ரீல்).",
                      "reference": "Muslim [487](1/353) and Abû Dâwud [872](1/230)."
                  },
                  {
                      "id": 36,
                      "group_id": 17,
                      "dua": "اللَّهُمَّ لَكَ رَكَعْتُ ، وَبِكَ آمَنْتُ ، وَلَكَ أَسْلَمْتُ ، خَشَعَ لَكَ سَمْعِي ، وَبَصَرِي ، وَمُخِّي ، وَعَظْمِي ، وَعَصَبِي ، [وَمَا اسْتَقَلَّت بِهِ قَدَمِي]",
                      "translation": "அல்லாஹா, உன்னுடைய நிமிர்ந்து நின்றேன், நான் உன்னில் நம்புகிறேன், உன்னுக்கு நான் அடிமையாகிறேன். என்னுடைய காதுகள், பார்வை, ஆழ்மதி, எலும்புகள், நரம்புகள் மற்றும் எனது கால்கள் அனைத்தும் உங்களிடம் அடிமையாகின்றன.",
                      "reference": "Muslim [771](1/534), Abû Dâwud [760], At-Tirmidhî [266] and An-Nisâ'i [2/130]. The extension is found in Ibn ĥibân, see Ŝaĥîĭh Ibn ĥibân [1901] and Ŝaĥîĭh Ibn Khuzaîmah [607]."
                  },
                  {
                      "id": 37,
                      "group_id": 17,
                      "dua": "سُبْحَانَ ذِي الْجَبَروتِ ، وَالْمَلَكُوتِ ، وَالكِبْرِيَاءِ ، وَالْعَظَمَةِ.",
                      "translation": "எவ்வளவு புனிதமானவர், அவர் முழு சக்தி, அதிகாரம், சிறப்பு மற்றும் மகத்துவத்தினரை உடையவர்.",
                      "reference": "Abû Dâwud [873](1/230), An-Nisâ'i (2/191) and Aĥmad (6/24)."
                  }
              ]
          },
          {
              "group_id": 18,
              "title": "வணங்கும் நிலையில் எழுந்த பிறகு",
              "duas": [
                  {
                      "id": 38,
                      "group_id": 18,
                      "dua": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ.",
                      "translation": "அல்லாஹ், அவனை புகழ்ந்தவரின் பிரார்த்தனையை ஆவணமாக்குங்கள்.",
                      "reference": "Al-Bukhârî [795](2/282)."
                  },
                  {
                      "id": 39,
                      "group_id": 18,
                      "dua": "رَبَّنَا وَلَكَ الْحَمْدُ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.",
                      "translation": "எங்கள் ஆண்டவரே, உனக்கு புகழேற்பட வேண்டும், அதிகமான மற்றும் அழகான புகழேற்பட வேண்டும்.",
                      "reference": "Al-Bukhârî [799](2/284)."
                  },
                  {
                      "id": 40,
                      "group_id": 18,
                      "dua": "مِلْءَ السَّمَوَاتِ وَمِلْءَ الأَرْضِ وَمَا بَيْنَهُمَا ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ ، أَهْلَ الثَّنَاءِ وَالْمَجْدِ ، أَحَقُّ مَا قَالَ الْعَبْدُ ، وَكُلُّنَا لَكَ عَبْدٌ ، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ ، وَلَامُعْطِي لِمَا مَنَعْتَ ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ.",
                      "translation": "விண்ணும் பூமியிலும் உன் புகழ் நிறைந்துள்ளது, நீயும் போகும் எல்லாமும் உன் புகழைக் கொண்டிருக்கிறது. உன்னுடைய கௌரவத்தின் உள் உரிமை மட்டுமே இருக்கிறது. அல்லாஹா, நீங்கள் கொடுத்ததைத் தடுக்கவா இல்லை, நீங்கள் தவிர்க்கிறீர்களா?",
                      "reference": "Muslim [477](1/346)."
                  }
              ]
          },
          {
              "group_id": 19,
              "title": "வணங்கும் போது",
              "duas": [
                  {
                      "id": 41,
                      "group_id": 19,
                      "dua": "سُبْحَانَ رَبَّيَ الأَعْلَى (ثلاثا)",
                      "translation": "என் ஆண்டவர், உயர்ந்தவர், எவ்வளவு புனிதமானவர் (மூன்று முறைகள்)",
                      "reference": "Abû Dâwud [871], At-Tirmidhî [262], An-Nisâ'i (1/190), Ibn Mâjah [888] and Aĥmad (5/382, 394). Also see Ŝaĥîĭh At-Tirmidhî (1/83)."
                  },
                  {
                      "id": 42,
                      "group_id": 19,
                      "dua": "سُبْحَانَكَ اللَّهُمَّ رَبَّنَا وَبِحَمْدِكَ اللَّهُمَّ اغْفِرْ لِي",
                      "translation": "அல்லாஹா, எங்களுடைய ஆண்டவர், நான் உங்களை புகழ்கிறேன். அல்லாஹா, எனக்கு மன்னிக்கவும்.",
                      "reference": "Al-Bukhârî [794](1/99) and Muslim [484](1/350)."
                  },
                  {
                      "id": 43,
                      "group_id": 19,
                      "dua": "سُبُّوحٌ، قُدُّوسٌ، رَبُّ المَلائِكَةِ وَالرُّوحِ.",
                      "translation": "அவர் எவ்வளவு பரிபூர்ணமானவர், தூதர்கள் மற்றும் ரூஹின் ஆண்டவர் (ஜிப்ரீல்).",
                      "reference": "Muslim (1/533)."
                  },
                  {
                      "id": 44,
                      "group_id": 19,
                      "dua": "اللَّهُمَّ لَكَ سَجَدْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَصَوَّرَهَ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللَّهُ أَحْسَنُ الخَالِقِينَ",
                      "translation": "அல்லாஹா, உன்னிடம் நான் வணங்கி இருக்கிறேன், நான் உன்னில் நம்புகிறேன், உன்னுக்கு அடிமையாக இருக்கிறேன். என் முகம், அதை உருவாக்கியவன் மற்றும் உருவாக்கியவன், அதை உருவாக்கியவன், அதை உருவாக்கியவன். அல்லாஹா, உன்னுடைய சிறந்த தரிசனங்களில் ஓர் ஆளாக இருக்கிறேன்.",
                      "reference": "Muslim [771](1/534)."
                  },
                  {
                      "id": 45,
                      "group_id": 19,
                      "dua": "سُبْحَانَ ذِي الْجَبَروتِ، وَالْمَلَكُوتِ، وَالكِبْرِيَاءِ، وَالْعَظَمَةِ",
                      "translation": "எவ்வளவு புனிதமானவர், அவர் முழு சக்தி, அதிகாரம், சிறப்பு மற்றும் மகத்துவத்தினரை உடையவர்.",
                      "reference": "Abû Dâwud [873](1/230), Ahmad (6/24), and An-Nisâ'i (2/191)."
                  },
                  {
                      "id": 46,
                      "group_id": 19,
                      "dua": "اللًّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ، دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلانِيَتَهُ وَسِرَّهُ",
                      "translation": "அல்லாஹா, என் பாவங்களை அனைத்தும், சிறியதும் பெரியதும், முதலாம் மற்றும் கடைசி மற்றும் காட்டிலும் காட்டிலும் மன்னிக்கவும்.",
                      "reference": "Muslim [483](1/350)."
                  },
                  {
                      "id": 47,
                      "group_id": 19,
                      "dua": "اللَّهُمَّ إِنِّي أَعُوْدُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوْدُ بِكَ مِنْكَ، لاَ أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                      "translation": "அல்லாஹா, நான் உன்னை மகிழ்ச்சியுடன் பாராட்டுகிறேன். உன்னுடைய ஊழியத்தை பாதிக்காதவராகவும் உன்னை தனியாக வைத்துக்கொண்டு இருப்பேன். நான் உன்னை மாற்ற வேண்டும்.",
                      "reference": "Muslim [486](1/352)."
                  }
              ]
          },
          {
              "group_id": 20,
              "title": "இரு வணங்கல்களின் இடையில்",
              "duas": [
                  {
                      "id": 48,
                      "group_id": 20,
                      "dua": "رَبِّ اغْفِرْ لِي، رَبِّ اغْفِرْ لِي",
                      "translation": "என் ஆண்டவரே, எனக்கு மன்னிக்கவும், என் ஆண்டவரே, எனக்கு மன்னிக்கவும்.",
                      "reference": "Abû Dâwud [874](1/231). Also see Ŝaĥîĭh Ibn Mâjah (1/148)."
                  },
                  {
                      "id": 49,
                      "group_id": 20,
                      "dua": "اللَّهُمَّ اغْفِرْ لِي، وَارْحَمْنِي، وَاهْدِنِي، وَاجْبُرْنِي، وَعَافِنِي، وَارْزُقْنِي، وَارْفَعْنِي",
                      "translation": "அல்லாஹா, எனக்கு மன்னிக்கவும், என்னை பரிகாரிக்கவும், என்னை வழிநடத்தவும், எனக்கு வளம் தரவும், எனக்கு ஆரோக்கியம் தரவும், எனக்கு உழைப்பு வழங்கவும்.",
                      "reference": "Abû Dâwud [850], At-Tirmidhî [284], Ibn Mâjah [898]. Also see Ŝaĥîĭh At-Tirmidhî (1/90) and Ŝaĥîĭh Ibn Mâjah (1/148)."
                  }
              ]
          },
          {
              "group_id": 21,
              "title": "குரானில் உரை காரணமாக வணங்கும் போது",
              "duas": [
                  {
                      "id": 50,
                      "group_id": 21,
                      "dua": "سَجَدَ وَجْهِي لِلَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ (فَتَبَارَكَ اللَّهُ أَحْسَنُ الْخَالِقِينَ)",
                      "translation": "என் முகம் அதை உருவாக்கியவருக்கு, இதை உருவாக்கியவர் மற்றும் இதை உருவாக்கியவருக்கு, அவருடைய முழு அதிகாரத்தால் என்னை வணங்கியது (அல்லாஹா, அவர் உங்களுக்கே உரிமை என்பதால் நீங்கள் மறந்துபோவேன்).",
                      "reference": "At-Tirmidhî [580](2/474), Aĥmad (6/30) and Al-Hâkim declated it authentic and Ad-Dhahabî agreed with him (1/220). The extension is from Ŝûrah Al-Mu'minûn."
                  },
                  {
                      "id": 51,
                      "group_id": 21,
                      "dua": "اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أَجْراً، وَضَعْ عَنْي بِهَا وِزْراً، وَاجْعَلْهَا لِي عِنْدَكَ ذُخْراً، وَتَقَبَّلْهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ",
                      "translation": "அல்லாஹா, எனக்கு இந்த (வணங்கல்) மூலம் ஒரு வெற்றி உறுதி செய்து, என்னை காப்பாற்றவும். அதை என் முன்னே வெளியிடவும், எனக்கு அதை அளிக்கவும், நான் உங்கள் அடியாரான தவூதிலிருந்து அதை தேவைப்படும் என்றால்.",
                      "reference": "At-Tirmidhî [579](2/473) and Al-Al-Hâkim declared it Ŝaĥîĭh and Ad-Dhahabî agreed with him (1/219)."
                  }
              ]
          },
          {
              "group_id": 22,
              "title": "தஷாஹூத்",
              "duas": [
                  {
                      "id": 52,
                      "group_id": 22,
                      "dua": "التَّحِيَّاتُ لِلَّهِ، وَالصَّلَوَاتُ، وَالطَّيِّبَاتُ، السَّلامُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ، السَّلامُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ،. أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، وَأَشْهَدُ أَنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ",
                      "translation": "அல்லாஹ்வின் தொடர்புகளை யாருக்கு உரிமை இல்லை, அண்டத்தில் உள்ள அனைவருக்கும், நீங்கள் சந்தோஷமாக இருக்கிறீர்கள், அவர்கள் அனைத்துக்கும் என்னை வெளியேற்றுங்கள். நான் உன்னிடம் சொல்லுகிறேன், அல்லாஹ்வின் அடியாரான முஹம்மதிற்கு உட்பட்டேன்.",
                      "reference": "Al-Bukhârî [831](2/311) and Muslim [402](1/301)."
                  }
              ]
          },
          {
              "group_id": 23,
              "title": "தஷாஹூத் பிறகு நபி (ஸ்அல்) மீதான பிரார்த்தனைகள்",
              "duas": [
                  {
                      "id": 53,
                      "group_id": 23,
                      "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ، اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                      "translation": "அல்லாஹா, முஹம்மது மற்றும் முஹம்மதின் குடும்பத்தின்மீது பிரார்த்தனை செய், எப்படி நான் அப்ராஹம் மற்றும் அவரது குடும்பத்தின்மீது பிரார்த்தனை செய்கிறேன், நீங்கள் சிறந்தது, மாகுமை கொண்டவர், அல்லாஹா, முஹம்மது மற்றும் முஹம்மதின் குடும்பத்தின்மீது பெருமை செய், எப்படி நான் அப்ராஹம் மற்றும் அவரது குடும்பத்தின்மீது பெருமை செய்கிறேன், நீங்கள் சிறந்தது, மாகுமை கொண்டவர்.",
                      "reference": "Al-Bukhârî [337](6/408)."
                  },
                  {
                      "id": 54,
                      "group_id": 23,
                      "dua": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ، وَبَارِكْ عَلَى مُحَمَّدٍ، وَ عَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ",
                      "translation": "அல்லாஹா, முஹம்மது மற்றும் அவரது மனைவிகள் மற்றும் குடும்பத்தின்மீது பிரார்த்தனை செய், எப்படி நான் அப்ராஹம் மற்றும் அவரது குடும்பத்தின்மீது பிரார்த்தனை செய்கிறேன், நீங்கள் சிறந்தது, மாகுமை கொண்டவர்.",
                      "reference": "Al-Bukhârî [3369](2/407) and Muslim [407](1/306)."
                  }
              ]
          },
          {
              "group_id": 24,
              "title": "கண்களை மூடுவதற்கும் மேலாக",
              "duas": [
                  {
                      "id": 55,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَعُوْدُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وَمِنْ عَذَابِ جَهَنَّمَ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
                      "translation": "அல்லாஹா, நான் உன்னிடம் கேட்கிறேன், உடலின் அனுபவத்தின் ஒளியில் இருந்து, நரகத்தின் மர்மமான இழப்புகளிலிருந்து, வாழ்க்கையின் மற்றும் மரணத்தின் கேள்விகளிலிருந்து, எனக்கு தேவையான ஐயர்கள் நோய்களை நிறுத்துங்கள்.",
                      "reference": "Al-Bukhârî 2/102 and Muslim 1/412."
                  },
                  {
                      "id": 56,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَعُوْدُ بِكَ مِنْ عَذَابِ الْقَبْرِ، وأَعُوْدُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ، وَأَعُوْدُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، اللَّهُمَّ إِنِّي أَعُوْدُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ",
                      "translation": "அல்லாஹா, நான் உன்னிடம் கேட்கிறேன், மரணத்தின் மர்மங்களை மற்றும், மார்பு வலிமைகளை நிறுத்துங்கள். அல்லாஹா, நான் உன்னிடம் கேட்கிறேன், குற்றங்கள் மற்றும் கடன்களை நிறுத்துங்கள்.",
                      "reference": "Al-Bukhârî [832](2/102) and Muslim [589](1/412) and the wording is the latter's."
                  },
                  {
                      "id": 57,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً، وَلَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ، فَاغْفِرْ لِي مَغْفِرةً مِنْ عِنْدِكَ، وَارْحَمْني، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                      "translation": "அல்லாஹா, நான் என் இதயத்தை மிகவும் நம்புகிறேன், நீங்கள் மட்டும் மன்னிக்கிறீர்கள். எனக்கு உங்கள் அன்பிலிருந்து மன்னிக்கவும், என்னை மறக்குங்கள், நீங்கள் மிக மிக மன்னிக்கக்கூடியவர்.",
                      "reference": "Al-Bukhârî [7387](8/168) and Muslim [2705](4/2078)."
                  },
                  {
                      "id": 58,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أَعْلَنْتُ، وَمَا أَسْرَفْتُ، وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي، أَنْتَ الْمُقَدِّمُ، وَأَنْتَ الْمُؤَخِّرُ لَا إِلَهَ إِلَّا أَنْتَ",
                      "translation": "அல்லாஹா, நான் செய்யப்போகிற விஷயங்களை மறக்கவும், நான் சொல்லக்கூடிய செயல்களை நிறுத்தவும், நான் தவறாகச் சொன்னது மற்றும் நான் ஏற்கெனவே இருந்தபோது, நான் தொலைக்கின்றேன்; உங்கள் முன்னால் இருப்பேன்.",
                      "reference": "Muslim [771](1/534)."
                  },
                  {
                      "id": 59,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ، وَشُكْرِكَ، وَحُسْنِ عِبَادَتِكَ",
                      "translation": "அல்லாஹா, என்னை உங்களை நினைவுகருத்தி, உங்களைப் புகழ்வதற்கு, மற்றும் உங்கள் மீது நல்ல விளக்கத்தை காணுமாறு உதவி செய்.",
                      "reference": "Abû Dâwud [1522](2/86) and An-Nisâ'i (3/53). Al-Albânî authenticated it in Ŝaĥîĭh Abî Dâwud (1/284)."
                  },
                  {
                      "id": 60,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَعُوْدُ بِكَ مِنَ البُخْلِ، وَأَعُوذُبِكَ مِنَ الْجُبْنِ، وَأَعُوْدُ بِكَ مِنْ أَنْ أُرَدَّ إِلَى أَرْذَلِ الْعُمُرِ، وَأَعُوْدُ بِكَ مِنْ فِتْنَةِ الدُّنْيَا، وَأعُوذُبِكَ مِنْ عَذَابِ الْقَبْرِ",
                      "translation": "அல்லாஹா, நான் நீங்கள் அறியாதவராக உங்கள் மீது காத்திருக்கிறேன், நான் பிண்சேற்க முயல்கிறேன். நான் அதை மறக்கவேண்டும். மரணத்தின் மர்மங்களை நிறுத்துங்கள்.",
                      "reference": "Al-Bukhârî [2822](6/35)."
                  },
                  {
                      "id": 61,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْدُ بِكَ مِنْ النَّارِ",
                      "translation": "அல்லாஹா, நான் உன்னிடம் கேட்கிறேன், என்னை நரகத்திலிருந்து அனுமதிக்கவும்.",
                      "reference": "Abû Dâwud [792] and Ibn Mâjah, see Ŝaĥîĭh Ibn Mâjah (2/328)."
                  },
                  {
                      "id": 62,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ؛ أَحْيِنِي مَا عَلِمْتَ الْحَيَاةَ خَيْراً لِي، وَتَوَفَّنِي إِذَا عَلِمْتَ الْوَفَاةَ خَيْراً لِي، اللَّهُمَّ إِنِّي أَسْأَلُكَ خَشْيَتَكَ فِي الْغَيْبِ وَالشَّهَادَةِ، وَأَسْأَلُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأَسْأَلُكَ الْقَصْدَ فِي الْغِنَى وَالْفَقْرِ، وَأَسْأَلُكَ نَعِيماً لاَ يَنْفَدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لاَ تَنْقَطِعُ، وَأَسْأَلُكَ الرَّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقَائِكَ فِي غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ زَيَّنَّا بِزِينَةِ الإِيمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِينَ",
                      "translation": "அல்லாஹா, நீங்கள் காப்பாற்றுகிறவரை அதிகமாக சிக்கலுக்கு உட்படுத்துவதை நிறுத்துங்கள், நீங்கள் உண்மையை அறிவுறுத்துபவராக, நீங்கள் எதைக் காக்கிறீர்கள்.",
                      "reference": "An-Nisâ'i (4/54, 55) and Aĥmad (4/364). Al-Albânî authenticated it in Ŝaĥîĭh An-Nisâ'i (1/281)."
                  },
                  {
                      "id": 63,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ يَا اللَّهُ بِأَنَّكَ الْوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ، أَنْ تَغْفِرَ لِي ذُنُوبِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ",
                      "translation": "அல்லாஹா, நான் உன்னை கேட்கிறேன், என் பாவங்களை மன்னிக்கவும், நீங்கள் மிகவும் மன்னிக்கக்கூடியவர்.",
                      "reference": "An-Nisâ'i (3/52) and Aĥmad (4/238). Al-Albânî authenticated it in Ŝaĥîĭh An-Nisâ'i (1/280)."
                  },
                  {
                      "id": 64,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنَّ لَكَ الْحَمْدُ، لَا إِلَهَ إِلَّا أَنْتَ، وَحْدَكَ لَا شَرِيكَ لَكَ، الْمَنَّانُ، يَا بَدِيْعَ السَّمَوَاتِ وَالأَرْضِ، يَاذَا الْجَلالِ وَالإكْرَامِ، يَاحَيُّ يَاقَيُّومُ، إِنِّي أَسْأَلُكَ الْجَنَّةَ، وَأَعُوْدُ بِكَ مِنَ النَّارِ",
                      "translation": "அல்லாஹா, நான் உன்னிடம் கேட்கிறேன், உங்கள் மீது அனைத்து புகழும், ஒருவரே, மற்றும் பங்கீடு செய்யாதவன் மட்டுமே, எங்களது கௌரவத்தை உன்னிடம் கேட்கிறேன்.",
                      "reference": "Abû Dâwud [1495], An-Nisâ'i (3/52), Ibn Mâjah [3858] and At-Tirmidhî [3544]. Also see Ŝaĥîĭh Ibn Mâjah (2/329)."
                  },
                  {
                      "id": 65,
                      "group_id": 24,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
                      "translation": "அல்லாஹா, நான் உன்னை கேட்கிறேன், இறைவன், தவிர worship செய்ய உரிமை உள்ளவரே இல்லை, ஒருவரே, ஒரே, யார் ஒருபோதும் பிறப்பதில்லை.",
                      "reference": "Abû Dâwud [1493](2/62), At-Tirmidhî [3475](5/515), Ibn Mâjah [3857](2/1267) and Aĥmad (5/360). Also see Ŝaĥîĭh Ibn Mâjah (2/329) and Ŝaĥîĭh At-Tirmidhî (3/163)."
                  }
              ]
          },
          {
              "group_id": 25,
              "title": "சலாம் பிறகு",
              "duas": [
                  {
                      "id": 66,
                      "group_id": 25,
                      "dua": "(١) أَسْتَغْفِرُ اللَّهَ (ثلاثا)(٢) اللَّهُمَّ أَنْتَ السَّلامُ وَمِنْكَ السَّلامُ تَبَارَكْتَ يَاذَا الجَلالِ وَالإكْرَامِ",
                      "translation": "(1) நான் அல்லாஹ்வை மன்னிக்கிறேன் (மூன்று முறைகள்)(2) அல்லாஹா, நீங்கள் ஸலாம், உங்களால் மட்டுமே, நீங்கள் உயர்ந்தவர்.",
                      "reference": "Muslim [591](1/414)."
                  },
                  {
                      "id": 67,
                      "group_id": 25,
                      "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ(ثلاثاً)، اللَّهُمَّ لَا مَانِعَ لِمَا أَعْطَيْتَ، وَلَا مُعْطِي لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ",
                      "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. O Allah, none can prevent what You have willed to bestow and none can bestow what You have willed to prevent, and no wealth or majesty can benefit anyone, as from You is all wealth and majesty.",
                      "reference": "Al-Bukhârî [844](1/255) and Muslim [593](1/414)."
                  },
                  {
                      "id": 68,
                      "group_id": 25,
                      "dua": "لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، لاَ إِلَهَ إِلَّا اللَّهُ، وَلَا نَعْبُدُ إِلَّا إِيَّاهُ، لَهُ النِّعْمَةُ وَلَهُ الْفَضْلُ وَلَهُ الثَّنَاءُ الْحَسَنُ، لَا إِلَهَ إِلَّا اللَّهُ مُخْلِصِينَ لَهُ الدِّيْنَ وَلَوْ كَرِهَ الْكَافِرُونَ",
                      "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise and He is over all things omnipotent. There is no might nor power except with Allah, none has the right to be worshipped except Allah and we worship none except Him. For Him is all favor, grace, and glorious praise. None has the right to be worshipped except Allah and we are sincere in faith and devotion to Him although the disbelievers detest it.",
                      "reference": "Muslim [594](1/415)."
                  },
                  {
                      "id": 69,
                      "group_id": 25,
                      "dua": "(١) سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ (ثلاثا و ثلاثين)(٢) لاَ إِلَهَ إلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
                      "translation": "(1) அல்லாஹ் எவ்வளவு புனிதமாக இருக்கிறார், எல்லாம் அல்லாஹ்வுக்கு மகிழ்ச்சியாக இருக்கிறது, (மூன்று முறைகள்) (2) அல்லாஹ் மன்னிக்கிறேன், நீங்கள் சிறந்தவர்.",
                      "reference": "Muslim [597](1/418)."
                  },
                  {
                      "id": 70,
                      "group_id": 25,
                      "dua": "(١) (قُلْ هُوَ اللَّهُ أَحَدٌ...)(٢) (قٌلْ أَعُوْزُ بِرَبَّ الْفَلَقِ...)(٣) (قُلْ أَعُوْزُ بِرَبَّ النَّاسِ...)",
                      "translation": "இவற்றின் மூன்று துவரைகளுக்குப் பிறகு: (1) அல்-இக்லாஸ் (2) அல்-ஃபலகு (3) அன்-நாஸ்",
                      "reference": "Abû Dâwud [1523](2/86) and An-Nisâ'i (3/68). Also see Ŝaĥîĭh At-Tirmidhî (2/8)."
                  },
                  {
                      "id": 71,
                      "group_id": 25,
                      "dua": "(اللَّهُ لا إِلَهَ إِلا هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ...)",
                      "translation": "இது தொழுகையின் பிறகு அதிகரிக்கப்படும்: அல்லாஹா, நீங்கள் நிச்சயமாக இருக்கிறீர்கள்.",
                      "reference": "An-Nisâ'i ('Amal al-Yawm wa al-Laylah)(100) and Ibn Sinnî [121]. Al-Albânî authenticated it in Ŝaĥîĭh Al-Jâmi' [6464](5/339) and Silsilah Al-Ahâdîth Aŝ-Ŝaĥîĭh [972](2/697)."
                  },
                  {
                      "id": 72,
                      "group_id": 25,
                      "dua": "لَا إِلَهَ إلَّا اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ يُحْيِي وَيُمِيتُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (عشر مرات بعد المغرب و الصبح)",
                      "translation": "None has the right to be worshipped except Allah, alone, without partner, to Him belongs all sovereignty and praise, He gives life and causes death and He is over all things omnipotent. (Ten times after Maghrib and Fajr prayer)",
                      "reference": "At-Tirmidhî [3474]5/515 and Aĥmad (4/227). Also see Zâd Al-Ma'âd (1/300)."
                  },
                  {
                      "id": 73,
                      "group_id": 25,
                      "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْماً نَافِعاً وَرِزْقاً طَيِّباً، وَعَمَلاً مُتَقَبَّلاً (بعد السلام من صلاة الفجر)",
                      "translation": "அல்லாஹா, நான் உன்னை தருகிறேன், உனது அன்பின் மூலம், நான் உங்கள் அன்பில் இருக்கிறேன்.",
                      "reference": "Ibn Mâjah [925]. Also see Ŝaĥîĭh Ibn Mâjah (1/152) and Majmu' Az-Zawâ'id [95](10/111)."
                  }
              ]
          },
          {
              "group_id": 32,
              "title": "க்வூட் அல்-வித்ர்",
              "duas": [
                  {
                      "id": 116,
                      "group_id": 32,
                      "dua": "اللَّهُمَّ اهْدِنِي فِيْمَنْ هَدَيْتَ، وَعَافِنِي فِيْمَنْ عَافَيْتَ، وَتَوَلَّنِي فِيْمَنْ تَوَلَّيْتَ، وَبَارِكْ لِي فِيْمَا أَعْطَيْتَ، وَقِنِي شَرَّ مَا قَضَيْتَ، فَإِنَّكَ تَقْدِي وَلَا يُقْدَى عَلَيْكَ، إِنَّهُ لَا يَذِلُّ مَنْ والَيْتَ، [وَ لَا يَعِزُّ مَنْ عَادَيْتَ]، تَبارَكْتَ رَبَّنَا وَتَعَالَيْتَ",
                      "translation": "அல்லாஹா, நான் உன்னை கேட்கிறேன், நீங்கள் தவறவிட்டீர்கள், நீங்கள் எனக்கு மகிழ்ச்சியாக இருக்கிறீர்கள், நீங்கள் அன்பு அற்புதமானவராக இருக்கிறீர்கள், நீங்கள் ஒரே தலையைப் பாதுகாக்கிறீர்கள்.",
                      "reference": "Abû Dâwud [1425], At-Tirmidhî [464], An-Nisâ'i (1/252), Ibn Mâjah [1178], Aĥmad (1/200), Ad-Dârimî (1/373), Al-Hâkim (3/172), Al-Baihaqî (2/209,497,498). What is between the brackets is from Al-Baihaqî. Also see Ŝaĥîĭh At-Tirmidhî (1/144), Ŝaĥîĭh Ibn Mâjah (1/194), and Irwâ'-ul-Ghalîl (2/172)."
                  },
                  {
                      "id": 117,
                      "group_id": 32,
                      "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ، وَأَعُوذُ بِكَ مِنْكَ، لَا أُحْصِي ثَنَاءً عَلَيْكَ، أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ",
                      "translation": "அல்லாஹா, நான் உன்னை மகிழ்ச்சியுடன் பாராட்டுகிறேன், உன்னை எதிர்க்குமாறு, நான் உன்னை மதிப்பிடுவேன், நான் உன்னை மன்னிப்பேன்.",
                      "reference": "Abû Dâwud [1427], At-Tirmidhî [3561], An-Nisâ'i (1/252), Ibn Mâjah [1179], and Aĥmad (1/96,118,150). Also see Ŝaĥîĭh At-Tirmidhî (3/180), Ŝaĥîĭh Ibn Mâjah (1/194) and Irwâ'-ul-Ghalîl (2/175)."
                  },
                  {
                      "id": 118,
                      "group_id": 32,
                      "dua": "اللَّهُمَّ إِيَّاكَ نَعْبُدُ، وَلَكَ نُصَلِّي وَنَسْجُدُ، وَإِلَيْكَ نَسْعَى وَنَحْفِدُ، نَرْجُو رَحْمَتَكَ، وَنَخْشَى عَذَابَكَ، إِنَّ عَذَابَكَ بِالكَافِرِيْنَ ملْحَقٌ، اللَّهُمَّ إِنَّا نَسْتَعِيْنُكَ، وَنَسْتَغْفِرُكَ، وَنُثْنِي عَلَيْكَ الخَيْرَ، وَلَا نَكْفُرُكَ، وَنُؤْمِنُ بِكَ، وَنَخْضَعُ لَكَ، وَنَخْلَعُ مَنْ يَكْفُرُكَ",
                      "translation": "அல்லாஹா, நீ தான் நாங்கள் வணங்குகிறவன், உனக்கு நாங்கள் தொழுது வணங்குகிறோம், நாங்கள் உன்னால் வருகிறோம், உன்னால் பரிசு பெறுகிறோம், உன் பாவங்களை நாங்கள் வஞ்சிக்கிறோம்.",
                      "reference": "Al-Baihaqî [As-Sunan Al-Kubrâ](2/211) and he declared its chain Ŝaĥîĭh. Al-Albânî said in [Irwâ'-ul-Ghalîl](2/170) that its chain is Ŝaĥîĭh and that the narration is mawqûf through 'Umar (RadiAllah ʻanhu)."
                  }
              ]
          },
          {
              "group_id": 33,
              "title": "வித்ர் பிரார்த்தனையின் சலாம் பிறகு",
              "duas": [
                  {
                      "id": 119,
                      "group_id": 33,
                      "dua": "سُبْحَانَ المَلِكِ القُدُّوسِ (ثَلاثَ مَرَّاتٍ، وَ الثَّالِثَةُ يَجْهَرُ بِهَا وَيَمُدُّ صَوْتَهُ يَقُولُ:[ ربِّ المَلائِكَةِ وَالرُّوحِ])",
                      "translation": "எவ்வளவு பரிபூர்ணமானது, பரிபூரணமானது, (மூன்று முறைகள்), மூன்றாவது முறைக்கு [தூதர்களின் ஆண்டவர்] மற்றும் பிரார்த்தனை செய்ய வேண்டும்.",
                      "reference": "An-Nisâ'i (3/244), Ad-Dârquťnî (2/31) and the extension in brackets is from him and its chain is Ŝaĥîĭh. Also see the research of Shu'aîb and 'Abdul Qadir Al-Arnâ'ûť on Zâd al-Ma'âd (1/337)."
                  }
              ]
          },
          {
              "group_id": 42,
              "title": "தொகுப்பை எதிர்கொள்பவருக்கு",
              "duas": [
                  {
                      "id": 138,
                      "group_id": 42,
                      "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ، واتْفُلْ عَلَى يَساَرِكَ [ثَلاثاً]",
                      "translation": "என் மீது ஐயா எதிர்ப்புகள் என்னை வஞ்சிக்கிறேன், நீங்கள் தடுக்கிறீர்கள்.",
                      "reference": "Muslim [2203](4/1729)."
                  }
              ]
          }
      ]
  },
  {
      "category_id": 3,
      "title": "அல்லாஹ்வை புகழுதல்",
      "group": [
          {
              "group_id": 26,
              "title": "ஒரு முடிவை எடுக்கும் அல்லது சரியான வழியைத் தேர்ந்தெடுப்பதில் வழிகாட்டலை நாடுவது",
              "duas": [
                  {
                      "id": 74,
                      "group_id": 26,
                      "dua": "اللَّهُمَّ إِنِّي أَسْتَخِيْرُكَ بِعِلْمِكَ، وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ، وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ، فَإِنَّكَ تَقْدِرُ وَلَا أَقْدِرُ، وَتَعْلَمُ وَلَا أَعْلَمُ، وَأَنْتَ عَلَّامُ الْغُيُوبِ، اللَّهُمَّ إنْ كُنْتَ تَعْلَمُ أَنْ هَذَاالأَمْرَ - ويُسَمِّي حَاجَتَه - خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أَمْرِي – أو قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي، ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشي وَعَاقِبَةِ أَمْرِي – أوْ قالَ: عَاجِلِهِ وَ آجِلِهِ - فَاصْرِفْهُ عَني، وَاصْرِفْنِي عَنْهُ، وَاقْدُرْ لِيَ الْخَيْرَ حَيْثُ كَانَ، ثُمَّ أَرْضِنِي بِهِ.(١)وَ مَا نَدِمَ مَنْ اسْتَخَارَ الخَالِقَ، وَ شَاوَرَ المَخْلُوقِينَ المُؤمِنِينَ، وَ تَثَبَّتَ فِي أمْرِهِ، فَقَدْ قَالَ سُبْحَانَهُ: ﴾وَ شَاوِرْ هُمْ فِي الأَمْرِ فَإذَا عَزَمْتَ فَتَوَكَّلْ عَلَى اللهِ﴿(٢)",
                      "translation": "ஜாபிர் இப்னு அப்தில்லாஹ் (ரழியல்லாஹு அன்ஹு) அவர்களின் ஆணையில்: நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) எங்களை எங்கள் அனைத்து அகவுடைகளிலும் வழிகாட்டல் வேண்டுமென சொல்லியிருப்பார், குர்ஆனில் ஒரு அத்தியாயத்தை எங்களுக்குப் போதித்தது போலவே. அவர் கூறுவார்: உங்களில் ஒருவருக்கும் ஒரு விஷயத்தில் தீர்மானம் செய்யும்போது, இரண்டு நபதீ தொழுகை செய்து, அதன் பிறகு இதை வேண்டுங்கள்: ‘அல்லாஹ்வே, உமது அறிவால் நான் உம்மிடம் ஆலோசனை கேட்டுக் கொள்கிறேன். உமது வலிமையை நான் நாடுகிறேன். உமது பெரும் فضل' என்னும் பொருள் வழங்குகிறேன்...’",
                      "reference": "(1) Al-Bukhârî [1162](7/162).(2) Qur'an Al-'Imran [3:159]."
                  }
              ]
          },
          {
              "group_id": 43,
              "title": "விஷயங்கள் சிக்கலாகி உள்ளவர்களுக்கானது",
              "duas": [
                  {
                      "id": 139,
                      "group_id": 43,
                      "dua": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلاً، وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذا شِئْتَ سَهْلاً",
                      "translation": "அல்லாஹ்வே, நீர் எதை எளிதாக்குகிறீர்களோ அதுவே எளிதாகும், நீர் கஷ்டத்தை எளிதாக்கக் விரும்பினால், அது எளிதாகும்.",
                      "reference": "Ibn Ĥibbân in his Ŝaĥîĥ [2427], Mawârid and Ibn As-Sunnî [351]. And Ibn Ĥajar said: \"This ĥadîth is Ŝaĥîĥ\". 'Abdul Qadir Al-Arnâ'ûť also declared it Ŝaĥîĥ in his takrîj of Imam Nawawî 's Athkâr (pg. 106). "
                  }
              ]
          },
          {
              "group_id": 44,
              "title": "ஒரு பாவம் புரிந்தவுடன்",
              "duas": [
                  {
                      "id": 140,
                      "group_id": 44,
                      "dua": "مَا مِنْ عَبْدٍ يُذْنِبُ ذَنْباً فَيُحْسِنُ الطُّهُورَ، ثُمَّ يَقُومُ فَيُصَلِّي رَكْعَتَيْنِ، ثُمَّ يَسْتَغْفِرُاللهَ إلَّا غَفَرَ اللهُ لَهُ",
                      "translation": "ஒரு அடியவர் பாவம் செய்தால், தூய்மையோடு இரண்டு ரகஅத்தை தொழுது, அல்லாஹ்விடம் மன்னிப்பு கேட்பாரானால், அல்லாஹ் அவரை மன்னிப்பார்.",
                      "reference": "Abû Dâwud [1521](2/86) and At-Tirmidhî [406,3006](2/257). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (1/283)."
                  }
              ]
          },
          {
              "group_id": 46,
              "title": "ஒரு துன்பம் வரும்போது அல்லது ஒரு விஷயம் தோல்வி அடைந்தால்",
              "duas": [
                  {
                      "id": 144,
                      "group_id": 46,
                      "dua": "قَدَرُ اللهِ وَما شَاءَ فَعَلَ",
                      "translation": "அல்லாஹ் தீர்மானித்தார், அவர் விரும்பியதைச் செய்தார்.",
                      "reference": "Muslim [2664](4/2052)."
                  }
              ]
          },
          {
              "group_id": 88,
              "title": "தஜ்ஜால் விடுதலைக்கு எதிராகப் பாதுகாப்பு",
              "duas": [
                  {
                      "id": 199,
                      "group_id": 88,
                      "dua": "مَنْ حَفِظَ عَشَرَ آيَاتٍ مِنْ أوُّلِ سُورَةِ الكَهْفِ، عُصِمَ مِنَ الدَّجَّالِ",
                      "translation": "சூரா அல்-கஹ்ஃபின் முதல் பத்து வசனங்களை யாரும் மனனம் செய்தால், தஜ்ஜாலிலிருந்து பாதுகாப்பில் இருப்பார்.",
                      "reference": "Muslim [809](1/555)."
                  }
              ]
          },
          {
              "group_id": 107,
              "title": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) மீது தொழுகை செய்வதில் சிறந்தது",
              "duas": [
                  {
                      "id": 219,
                      "group_id": 107,
                      "dua": "قَالَ ﷺ: «مَنْ صَلَّ عَلَيَّ صَلاةً صَلَّ اللهُ عَلَيْهِ بِهَا عَشَراً»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'எவன் என்னிடம் தொழுகை செய்கிறானோ, அல்லாஹ் அவனுக்கு பத்து முறை தொழுகையை அனுப்புவார்.'",
                      "reference": "Muslim [408](1/288)."
                  },
                  {
                      "id": 220,
                      "group_id": 107,
                      "dua": "قَالَ ﷺ: «لا تَجْعَلُوا قَبْرِيْ عِيْداً وَ صَلُّوا عَلَيَّ فَإِنَّ صَلاتَكُمْ تَبْلُغُنِي حَيْثُ كُنْتُمْ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'என் கல்லறையை வழிபாட்டு தளமாகக் கொள்ளாதீர்கள். என்னிடம் தொழுகை செயுங்கள், உங்கள் தொழுகைகள் எங்கு இருப்பீர்களோ அங்கு எனக்கு வருகின்றன.'",
                      "reference": "Abû Dâwud [2042](2/218) and Aĥmad (2/367). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/383)."
                  },
                  {
                      "id": 221,
                      "group_id": 107,
                      "dua": "قَالَ ﷺ: «البَخِيْلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'என் பெயர் குறிப்பிடும்போது, என்மீது தொழுகை செய்யாதவன் கருப்பன்.'",
                      "reference": "At-Tirmidhî [3546](5/551). Also see Ŝaĥîĥ Al-Jâmi' [2787](3/25) and Ŝaĥîĥ At-Tirmidhî (3/177)."
                  },
                  {
                      "id": 222,
                      "group_id": 107,
                      "dua": "قَالَ ﷺ: «إنَّ لِلَّهِ مَلائِكَةً سَيَّا حِيْنَ فِي الأرْضِ، يُبَلِّغُونِي مِنْ أُمَّتِي السَّلامَ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'அல்லாஹ்வுக்கு மாலைக்கள் உள்ளனர், அவர்கள் பூமியில் சுற்றி, என் சமூகத்தினரின் சமாதானங்களை எனக்கு கொண்டு வருகின்றனர்.'",
                      "reference": "An-Nisâ'i (3/43) and Al-Hâkim (2/421). Al-Albânî authenticated it in Ŝaĥîĥ An-Nisâ'i (1/274)."
                  },
                  {
                      "id": 223,
                      "group_id": 107,
                      "dua": "قَالَ ﷺ: «مَا مِنْ أحَدٍ يُسَلِّمُ عَلَيَّ، إلَّا رَدَّ اللهُ عَلَيَّ رُوْحي، حَتَّى أرُدَّ عَلَيْهِ السَّلامَ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'என் மீது யாரும் சமாதானம் கூறினால், அல்லாஹ் எனது ஆன்மாவை திருப்பித் தருவார், நான் அந்த சமாதானத்தை அவர்கள் மீண்டும் பெறுவேன்.'",
                      "reference": "Abû Dâwud (2041). Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/283)."
                  }
              ]
          },
          {
              "group_id": 129,
              "title": "மன்னிப்பு மற்றும் தவ்பா நாடுதல்",
              "duas": [
                  {
                      "id": 248,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «وَ اللهِ إِنِّي لأسْتَغْفِرُ اللهَ وَ أ تُوبُ إلَيْهِ فِي اليَوْمِ أكثَرَ مِنْ سَبْعِيْنَ مَرَّةٍ»",
                      "translation": "அல்லாஹ்வின் தூதர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'அல்லாஹ்விடம் மன்னிப்பு நாடுகிறேன், தினமும் எழுபது முறை.'",
                      "reference": "Al-Bukhârî [6307](11/101)."
                  },
                  {
                      "id": 249,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «يَا أَيُّهَا النَّاسُ تُوبُوا إلَى اللهِ، فَإِنِّي أتُوبُ إلَيْهِ مِئَةَ مَرَّةٍ»",
                      "translation": "அல்லாஹ்வின் தூதர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: ‘மக்களே, தவ்பா செய்துகொள்வீர்கள்! அல்லாஹ்விடம் நான் தினமும் நூறு முறை தவ்பா செய்கிறேன்.'",
                      "reference": "Muslim [2702](4/2076)."
                  },
                  {
                      "id": 250,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ أسْتَغْفِرُ اللهَ العَظِيْمَ الَّذِي لَا إلَهَ إلَّا هُوَ الحَيُّ القَيُّومُ وَ أتُوبُ إلَيْهِ، غَفَرَ للهُ لَهُ، وَ إنْ كَانَ فَرَّ مِنَ الزَّحْفِ»",
                      "translation": "யார் கூறினாலும்: 'அல்லாஹ்விடம் மன்னிப்பு நாடுகிறேன், ஒருவன் அல்லாஹ்வை வணங்குவதற்கு ஒரே தேவையானவர், அதனால் அவரை ஏற்றுக் கொள்கிறேன், அவர் வாழ்க்கை அளிப்பவரும் பெரும் ஆற்றலுடையவரும்' என்பாரை, அல்லாஹ் மன்னிப்பார்.",
                      "reference": "Abû Dâwud [1517](2/85), At-Tirmidhî [3577](5/569), Al-Hâkim (1/511)  and he authenticated it and Adh-Dhahabî agreed with him. Al-Albânî authenticated it, see Ŝaĥîĥ At-Tirmidhî (3/182) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/389-390) with research by Arnâ'ûť."
                  },
                  {
                      "id": 251,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ الرَّبُّ مِنَ العَبْدِ، فِي جَوْفِ اللَّيْلِ الآخِرِ؛ فَإنْ اسْتَطَعْتَ أنْ تَكُونَ مِمَّنْ يَذْكُرُ اللهَ فِي تِلْكَ السَّاعَةِ؛ فَكُنْ»",
                      "translation": "அல்லாஹ்வின் தூதர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'அல்லாஹ் அடியவர்களிடம் மிகவும் நெருக்கமாக இருக்கும் நேரம் நள்ளிரவு, அந்த நேரத்தில் அல்லாஹ்வை நினைவுகூர விரும்பினால் அவ்வாறு செய்யுங்கள்.'",
                      "reference": "At-Tirmidhî [3579], An-Nisâ'i (1/279), and Al-Hâkim. Also see Ŝaĥîĥ At-Tirmidhî (3/183) and Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/144) with research by Arnâ'ûť."
                  },
                  {
                      "id": 252,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أقْرَبُ مَا يَكُونُ العَبْدُ مِنْ رَبِّهِ، وَ هُوَ سَاجِدٌ فَأكْثِرُوا الدُّعَاءَ»",
                      "translation": "அல்லாஹ்வின் தூதர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'அடியவர்களிடம் அல்லாஹ் மிகவும் நெருக்கமாக இருப்பது சஜ்தாவில் இருக்கும்போது, அந்த நேரத்தில் அதிகம் துஆ செயுங்கள்.'",
                      "reference": "Muslim [482](1/350)."
                  },
                  {
                      "id": 253,
                      "group_id": 129,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «إنَّهُ لَيُغَانُ عَلَى قَلْبِي، وَ إنِّي لأسْتَغْفِرُ اللهَ فِي اليَوْمِ مِئَةَ مَرَّةٍ»",
                      "translation": "அல்லாஹ்வின் தூதர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'என் இதயத்தில் சிந்தனைகள் பெருகுகின்றன, எனவே தினமும் நூறு முறை அல்லாஹ்விடம் மன்னிப்பு கேட்கிறேன்.'",
                      "reference": "Muslim [2702](4/2075). Also see Al-Jâmi' Al-'Uŝûl Li-Ahâdîth Al-Rasûl (4/386)."
                  }
              ]
          },
          {
              "group_id": 130,
              "title": "அல்லாஹ்வை நினைவு கூர்வது மற்றும் புகழ்வதில் சிறப்பியல்",
              "duas": [
                  {
                      "id": 254,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ فِي يَومٍ مِئَةَ مَرَّةٍ، حُطَّتْ خَطَايَاهُ، وَ لَو كَانَتْ مِثْلَ زَبَدِ البَحْرِ»",
                      "translation": "ஒரு நாளில் யார் 'சுப்ஹானல்லாஹ் வா பிஹம்திஹி' என்பதை நூறு முறை சொல்வாரோ, அவரின் பாவங்கள் கடலின் நுரையைப் போல இருக்கும் போது கூட மன்னிக்கப்படும்.",
                      "reference": "Al-Bukhârî [6405](7/168) and Muslim [2691](4/2071)."
                  },
                  {
                      "id": 255,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ عَشْرَ مِرَارٍ، كَانَ كَمَنْ أعْتَقَ أرْبَعَةَ أنْفُسٍ مِنْ وَلَدِ إسْمَاعِيلَ»",
                      "translation": "யார் தினமும் 'லா இலாஹா இல்லல்லாஹ்' என்பாரோ, நபி இஸ்மாயில் வம்சத்து நான்கு அடிமைகளை விடுதலை செய்ததைப் போலவே அவருக்கு நன்மை கிடைக்கும்.",
                      "reference": "Al-Bukhârî (7/67) and Muslim (4/2017)."
                  },
                  {
                      "id": 256,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ، ثَقِيلَتَانِ فِي الِميْزَانِ، حَبِيبَتَانِ إلَى الرَّحْمَنِ: سُبْحَانَ اللهِ وَ بِحَمْدِهِ، سُبْحَانَ اللهِ العَظِيْمِ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'இரண்டு சொற்கள், நாவுக்கு இலகுவாகவும், தராசில் பாரமாகவும், அல்லாஹ்வுக்கு மிகவும் பிடித்தவையாகவும் உள்ளன: 'சுப்ஹானல்லாஹ் வா பிஹம்திஹி', 'சுப்ஹானல்லாஹ் அல்-அழீம்'.",
                      "reference": "Al-Bukhârî [3462](7/168) and Muslim [2694](4/2072)."
                  },
                  {
                      "id": 257,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «لَأنْ أقُولَ: سُبْحَانَ اللهِ، وَ الحَمْدُ لِلَّهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، أحَبُّ إلَيَّ مِمَّا طَلَعَتْ عَلَيْهِ الشَّمْسُ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'சுப்ஹானல்லாஹ், அல்-ஹம்துலில்லாஹ், லா இலாஹா இல்லல்லாஹ், அல்லாஹு அக்பர்' என்பதைச் சொல்லுவதை, எனக்கு சூரியன் உதிக்கிற அனைத்து விஷயங்களிலும் மேலானதாக நினைக்கிறேன்.",
                      "reference": "Muslim [2695](4/2072)."
                  },
                  {
                      "id": 258,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «أيَعْجِزُ أحَدُكُمْ أنْ يَكْسِبَ كُلَّ يَوْمٍ ألْفَ حَسَنَةٍ» فَسَألَهُ سَائِلٌ مِنْ جُلَسَائِهِ: كَيْفَ يَكْسِبُ أحَدُنَا ألْفَ حَسَنَةٍ؟ قَالَ: «يُسَبِّحُ مِئَةَ تَسْبِيْحَةٍ، فَيُكْتَبُ لَهُ ألْفُ حَسَنَةٍ، أوْ يُحَطُّ عَنْهُ ألْفُ خَطِيْئَةٍ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'நீங்கள் அனைவரும் தினமும் ஆயிரம் நற்குணங்களைப் பெற முடியாது என்றால் என்ன செய்ய முடியும்?' என்று அவரிடம் ஒருவர் கேட்டார். நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'நூறு முறை சுப்ஹானல்லாஹ் கூறினால், அவனுக்கு ஆயிரம் நற்குணங்கள் கொடுக்கப்படும் அல்லது அவனின் ஆயிரம் பாவங்கள் நீக்கப்படும்.'",
                      "reference": "Muslim [2698](4/2073)."
                  },
                  {
                      "id": 259,
                      "group_id": 130,
                      "dua": "قَالَ رَسُولُ اللهِ ﷺ: «مَنْ قَالَ: سُبْحَانَ اللهِ العَظِيمِ وَ بِحَمْدِهِ، غُرِسَتْ لَهُ نَخْلَةٌ فِي الجَنَّةِ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'யார் 'சுப்ஹானல்லாஹ் அல்-அழீம் வா பிஹம்திஹி' என்பாரோ, அவருக்கு சொர்க்கத்தில் ஒரு பேரியாய் நடப்படும்.'",
                      "reference": "At-Tirmidhî [3464-3465](5/511), Al-Hâkim (1/501) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [6429](5/531) and Ŝaĥîĥ At-Tirmidhî (3/160)."
                  },
                  {
                      "id": 260,
                      "group_id": 130,
                      "dua": "قَالَ ﷺ: «يَا عَبْدَاللهِ بْنَ قَيْسٍ، ألَا أدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الجَنَّةِ؟» فَقُلْتُ: بَلَى يَا رَسُولَ اللهِ، قَالَ: «قُلْ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'அப்துல்லாஹ் இப்னு கய்ஸே, நான் உனக்கு சொர்க்கத்தின் நகைகளைப் பற்றி சொல்ல வேண்டுமா?' அப்துல்லாஹ் கூறினார்: 'ஆம், அல்லாஹ்வின் தூதரே!' நபி கூறினார்: 'லா ஹவ்லா வா லா குவாத்தா இல்லா பில்லாஹ்'.",
                      "reference": "Al-Bukhârî [4205](11/213) and Muslim [2704](4/2076)."
                  },
                  {
                      "id": 261,
                      "group_id": 130,
                      "dua": "قَالَ ﷺ: «أحَبُّ الكَلَامِ إلَى اللهِ أرْبَعٌ: سُبْحَانَ اللهِ، وَ الحَمْدُ للهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، لَا يَضُرُّكَ بِأيِّهِنَّ بَدَأْتَ»",
                      "translation": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'நான்கு சொற்கள் அல்லாஹ்வுக்கு மிகவும் பிடித்தவை: 'சுப்ஹானல்லாஹ்', 'அல்-ஹம்துலில்லாஹ்', 'லா இலாஹா இல்லல்லாஹ்', 'அல்லாஹு அக்பர்'.",
                      "reference": "Muslim [2137](3/1685)."
                  },
                  {
                      "id": 262,
                      "group_id": 130,
                      "dua": "جَاءَ أعْرَابِيٌّ إلَى رَسُولُ اللهِ ﷺ فَقَالَ: عَلِّمْنِي كَلَامًا أقُولُهُ؟ قَالَ: «قُلْ: لَا إلَهَ إلَّا اللهُ وَ حْدَهُ لَا شَرِيكَ لَهُ، اللهُ أكْبَرُ كَبِيْراً، وَ الحَمْدُ للهِ كَثِيْراً، سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ، لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ العَزِيزِ الحَكِيمِ»، قَالَ: فَهَؤُلَاءِ لِرَبِّي فَمَا لِي؟ قَالَ: «قُلْ: اللهم اغْفِرلِي، وَارْحَمْنِي، واهْدِنِي، وَارْزُقْنِي»",
                      "translation": "ஒரு அரபி நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) அவரிடம் வந்து கூறினார்: 'நான் சொல்லவேண்டிய வார்த்தைகளை எனக்குக் கற்பிக்க வேண்டுமா?' நபி கூறினார்: 'லா இலாஹா இல்லல்லாஹ், தனியாகவும், பங்கில்லாமல், அல்லாஹு மிகப் பெரியவர், பெரும் புகழும் அல்லாஹ்வுக்கே உண்டு, உலகங்களின் இறைவனே, அல்லாஹ்வின் மிகப்பெரிய வலிமையுள்ளவர்.'",
                      "reference": "Muslim [2696](4/2072)."
                  },
                  {
                      "id": 263,
                      "group_id": 130,
                      "dua": "كَانَ الرَّجُلُ إذَا أَسْلَمَ عَلَّمَهُ النَّبِيُّ ﷺ الصَّلَاةَ، ثُمَّ أمَرَهُ أنْ يَدْعُوَ بِهَؤُلَاءِ الكَلِمَاتِ: «اللهم اغْفِرْلِي، وَارْحَمْنِي، وَاهْدِنِي، وِ عَافِنِي، وَارْزُقْنِي»",
                      "translation": "ஒரு மனிதன் இஸ்லாத்தை ஏற்றுக்கொண்ட போது, நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) அவரிடம் தொழுகையை கற்பித்தார், அதன் பிறகு இந்த வார்த்தைகளைக் கூறுவதாகக் கூறினார்: 'அல்லாஹ்வே, எனக்கு மன்னிப்பு செய், எனக்கு அருள் புரி, எனக்கு வழிகாட்டி, எனக்கு நலமளி, எனக்கு உணவளி.'",
                      "reference": "Muslim [2697](4/2073)."
                  },
                  {
                      "id": 264,
                      "group_id": 130,
                      "dua": "إنَّ أفْضَلَ الدُّعَاءِ: الحَمْدُ لِلَّهِ، وَ أفْضَلُ الذِّكْرِ: لَا إلَهَ إلَّا اللهُ",
                      "translation": "நிச்சயமாக, சிறந்த துஆ: 'அல்-ஹம்துலில்லாஹ்' மற்றும் சிறந்த ஜிக்ர்: 'லா இலாஹா இல்லல்லாஹ்'.",
                      "reference": "At-Tirmidhî [3383](5/462), Ibn Mâjah [3800](2/1249), and Al-Hâkim (1/503) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ Al-Jâmi' [1104](1/362)."
                  },
                  {
                      "id": 265,
                      "group_id": 130,
                      "dua": "البَاقِيَاتُ الصَّالِحَاتُ: سُبْحَانَ اللهِ، وَ الحَمْدُللهِ، وَ لَا إلَهَ إلَّا اللهُ، وَ اللهُ أكْبَرُ، وَ لَا حَوْلَ وَ لَا قُوَّةَ إلَّا بِااللهِ",
                      "translation": "நேர்மையான நிலையான செயல்கள்: சுப்ஹானல்லாஹ், அல்-ஹம்துலில்லாஹ், லா இலாஹா இல்லல்லாஹ், அல்லாஹு அக்பர், லா ஹவ்லா வா லா குவாத்தா இல்லா பில்லாஹ்.",
                      "reference": "Aĥmad [513](3/75) according to the order of Aĥmad Shâkir and its chain is authentic. Also see Majma' Az-Zawâ'id (1/297)..... [COMPLETE THIS]"
                  }
              ]
          },
          {
              "group_id": 131,
              "title": "நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) தஸ்பீஹ் செய்வது எப்படி",
              "duas": [
                  {
                      "id": 266,
                      "group_id": 131,
                      "dua": "عَنْ عَبْدِ اللهِ بْنِ عَمْروٍ قَالَ: رَأيْتُ النَّبِيَّ يَعْقِدُ التَّسْبِيْحَ بِيَمِيْنِهِ",
                      "translation": "'அப்துல்லாஹ் இப்னு 'அம்ர் (ரழியல்லாஹு அன்ஹு) கூறினார்: நான் நபி (ஸல்லல்லாஹு அலைஹி வஸல்லம்) அவரின் வலது கையால் தஸ்பீஹ் செய்வதைப் பார்த்தேன்.",
                      "reference": "Abû Dâwud [1502](2/81) and At-Tirmidhî [3486](5/521). Also see Ŝaĥîĥ Al-Jâmi' [4865](4/271)."
                  }
              ]
          }
      ]
  },
  {
    "category_id": 4,
    "title": "ஹஜ் மற்றும் உம்ரா",
    "group": [
        {
            "group_id": 115,
            "title": "ஹஜ் அல்லது உம்ரா செய்யும் ஒருவருக்கான தல்பியா",
            "duas": [
                {
                    "id": 233,
                    "group_id": 115,
                    "dua": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لاَ شَرِيْكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ والنِّعْمَةَ، لَكَ وَالمُلْكَ، لَا شَرِيْكَ لَكَ",
                    "translation": "எங்கே நான் இருக்கிறேன் அல்லாஹா, (உங்கள் அழைப்புக்கு), நான் இருக்கிறேன். நீங்கள் எந்த கூட்டாளியும் இல்லை, நான் இருக்கிறேன். நிச்சயமாக, அனைத்து புகழும், நன்மையும் மற்றும் ஆட்சியும் உங்களுக்கு சொந்தமானது. நீங்கள் எந்த கூட்டாளியும் இல்லை.",
                    "reference": "Al-Bukhârî [1549](3/408) and Muslim [1184](2/841)."
                }
            ]
        },
        {
            "group_id": 116,
            "title": "கருப்பு கல்லை கடக்கும் போது தக்பீர்",
            "duas": [
                {
                    "id": 234,
                    "group_id": 116,
                    "dua": "اللهُ أَكْبَرُ",
                    "translation": "அல்லாஹ் மிகப்பெரியது.",
                    "reference": "Al-Bukhârî [1612](1/476)."
                }
            ]
        },
        {
            "group_id": 117,
            "title": "எமினி மூலை மற்றும் கருப்பு கல் இடையே",
            "duas": [
                {
                    "id": 235,
                    "group_id": 117,
                    "dua": "﴾رَبَّنَا آتِنَا في الدُّنْيَا حَسَنَةً وفي الآخِرَةِ حَسَنَةً وقِنَا عَذَابَ النَّارِ﴿",
                    "translation": "எங்கள் இறைவா, இக்கண்ணியில் எங்களுக்கு சிறந்ததை மற்றும் அடுத்த வாழ்வில் சிறந்ததை கொடுத்து, நரகத்தின் தண்டனையிலிருந்து எங்களை காத்துக்கொள்.",
                    "reference": "(1) Abû Dâwud [1892](2/179), Aĥmad (3/411) and Al-Baghawî in Sharĥ As-Sunnah (7/128). Al-Albânî declared it Ĥasan in Ŝaĥîĭh Abû Dâwud (1/354).(2) Sûrah Al-Baqarah: 201."
                }
            ]
        },
        {
            "group_id": 118,
            "title": "சாஃபா மற்றும் மர்வா மலைகளில்",
            "duas": [
                {
                    "id": 236,
                    "group_id": 118,
                    "dua": "لَمَّا دَنَا النَّبِيُّ ﷺ مِنَ الصَّفَا قَرَأ: ﴾إنَّ الصَّفَا وَ المَرْوَةَ مِنْ شَعَائِرِ اللهِ﴿«أبْدَأ بِمَا بَدَأ اللهُ بِهِ» فَبَدأ بِالصَّفَا، فَرَقِيَ عَلَيْهِ، حَتَّى رَأَى البَيْتَ، فَاسْتَقْبَلَ القِبْلَةَ، فَوَحَّدَ اللهَ، وَ كَبَّرَهُ، وَ قَالَ: «لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَ لَهُ الحَمْدُ، وَ هُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، لَا إلَهَ إلَّا اللهٌ وَ حْدَهُ، أنْجَزَ وَعْدَهُ، وَ نَصَرَ عَبْدَهُ، وَ هَزَمَ الأَحْزَابَ وَحْدَهُ، ثُمَّ دَعَا بَيْنَ ذَلِكَ، قَالَ مِثْلَ هَذَا ثَلَاثَ مَرَّاتٍ...، الحَدِيْثُ، وَ فِيْهِ: فَفَعَلَ عَلَى المَرْوَةِ كَمَا فَعَلَ عَلَى الصَّفَا»",
                    "translation": "நிச்சயமாக சாஃபா மற்றும் மர்வா அல்லாஹ்வின் வழிபாட்டின் இடங்களிலே… அல்லாஹ் தவிர வேறு எவரும் இல்லை, அல்லாஹ் மிகப்பெரியது. அல்லாஹ் தவிர வேறு எவரும் இல்லை, தனியாக, கூட்டாளியின்றி. அவருக்கே அனைத்து ஆட்சி மற்றும் புகழ் உண்டு மற்றும் அவர் அனைத்திற்கும் உயர் ஆவார். அல்லாஹ் தவிர வேறு எவரும் இல்லை, அவர் தனது வாக்குறுதியை நிறைவேற்றினார், தனது பணியாளனை உதவினார் மற்றும் தனியாக நண்பர்களை தோற்கடித்தார்.",
                    "reference": "Muslim [1218](2/888)."
                }
            ]
        },
        {
            "group_id": 119,
            "title": "அரஃபா நாளில்",
            "duas": [
                {
                    "id": 237,
                    "group_id": 119,
                    "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ، ولَهُ الحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
                    "translation": "அல்லாஹா தவிர வேறு எவரும் இல்லை, தனியாக, கூட்டாளியின்றி. அவருக்கே அனைத்து புகழும் மற்றும் ஆட்சியும் உண்டு மற்றும் அவர் அனைத்திற்கும் உயர் ஆவார்.",
                    "reference": "At-Tirmidhî [3585]. Al-Albânî authenticated it in Ŝaĥîĭh At-Tirmidhî (3/184) and Al-Aĥâdîth Aŝ-Ŝaĥîĭh (4/6)."
                }
            ]
        },
        {
            "group_id": 120,
            "title": "முஜ்தலிபாவில் நினைவுநிலை",
            "duas": [
                {
                    "id": 238,
                    "group_id": 120,
                    "dua": "رَكِبَ ﷺ القَصْوَاءَ حَتَّى أتَى المَشْعَرَ الحَرَامَ، فَاسْتَقْبَلَ القِبْلَةَ (فَدَعَاهُ، وَ كَبَّرَهُ، وَ هَلَّلَهُ، وَ وَحَّدَهُ) فَلَمْ يَزَلْ وَاقِفًا حَتَّى أسْفَرَ جِدّاً، فَدَفَعَ قَبْلَ أنْ تَطْلُعَ الشَّمْسُ",
                    "translation": "நபி (சல்) அல்காஸ்வாவை எடுத்து ஆல்கா மச்ஜிதில் சென்றார், அவர் அந்தக் கிப்லா நோக்கி திரும்பி, அல்லாஹ்வை தேடி, அவனின் மகிமையை கூறி, ஒற்றுமையைச் சொன்னார். அவர் நிலவின் நிலை நிலவும்வரை நிற்கச் சொன்னார், ஆனால் அது முன்னதாகவே போனார்.",
                    "reference": "Muslim [1218](2/891)."
                }
            ]
        },
        {
            "group_id": 121,
            "title": "ஜமரத்தை அடிக்கும்போது",
            "duas": [
                {
                    "id": 239,
                    "group_id": 121,
                    "dua": "يُكَبِّرُ كُلَّمَا رَمَى بِحَصَاةٍ عِنْدَ الجِمَارِ الثَّلاثِ، ثُمَّ يَتَقَدَّمُ، وَ يَقِفُ يَدْعُوْ مُسْتَقْبِلَ القِبْلَةَ، رَافِعاً يَدَيْهِ بَعْدَ الجَمْرَةِ الأوْلَى وَ الثَّانِيَةِ، أمَّا جَمْرَةُ العَقَبَةِ فَيَرْمِيْهَا، وَ يُكَبِّرُ عِنْدَ كُلِّ حَصَاةٍ، وَ يَنْصَرِفُ، وَ لَا يَقِفُ عِنْدَهَا",
                    "translation": "அவர் ஒவ்வொரு கற்களைச் சிலம்பிக்கும் போது தக்பீர் கூற வேண்டும், பின்னர் அவர் முன்னே சென்று, கிப்லா நோக்கி தன்னை நோக்கி அழைக்க வேண்டும், மற்றும் அவர் தனது கைம்முறைகளை உயர்த்த வேண்டும், மேலும் அது குறுக்கீடு போடக் கூடாது.",
                    "reference": "Al-Bukhârî [1752 and 1753](3/583-584), also see its wording there, Al-Bukhârî [1750](3/581) and Muslim [1296] narrated it as well from the ḥadīth of Ibn Mas'ûd (RA)."
                }
            ]
        },
        {
            "group_id": 127,
            "title": "விலங்கு அரை அல்லது பிசா கொடுக்கும் போது",
            "duas": [
                {
                    "id": 246,
                    "group_id": 127,
                    "dua": "بِسْمِ اللهِ واللهُ أَكْبَرُ [اللَّهُمَّ مِنْكَ ولَكَ] اللَّهُمَّ تَقَبَّلْ مِنِّي",
                    "translation": "அல்லாஹ்வின் பெயரில், அல்லாஹ் மிகப்பெரியது. அல்லாஹா (இது) உனக்கே மற்றும் உனக்கே, அல்லாஹா, இது எனது பாவங்களை ஏற்று.",
                    "reference": "Muslim [1966](3/1557) and Baihaqî (9/287). What is between the brackets is from Baihaqî and others."
                }
            ]
        }
    ]
},
  {
    "category_id": 5,
    "title": "பயணம்",
    "group": [
        {
            "group_id": 95,
            "title": "ஒரு விலங்கை அல்லது ஏதேனும் போக்குவரத்தின்மீது ஏறும் போது",
            "duas": [
                {
                    "id": 206,
                    "group_id": 95,
                    "dua": "بِسْمِ اللهِ، وَالْحَمْدُ لِلَّهِ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، الحَمْدُ لِلَّهِ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، اللهُ أكْبَرُ، سُبْحَانَكَ اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِيْ، فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
                    "translation": "அல்லாஹ்வின் பெயரில் மற்றும் அனைத்துப் புகழும் அல்லாஹ்விற்கு. அவர் எவ்வளவு பெருமைமிக்கவர், அவர் இந்த (போக்குவரத்து) ஒன்றை எங்கள் சேவைக்கு வைத்து உள்ளவர், நாங்கள் இதற்கு தகுதி இல்லை, எங்கள் இறைவனிடம்தான் நமது இறுதியிடம். அனைத்து புகழும் அல்லாஹ்விற்கு, அனைத்து புகழும் அல்லாஹ்விற்கு, அனைத்து புகழும் அல்லாஹ்விற்கு, அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது. நீங்கள் எவ்வளவு பெருமைமிக்கவர், ஓ அல்லாஹா, நிச்சயமாக நான் என் ஆத்மாவை துன்புறுத்தினேன், எனக்கு மன்னிக்கவும், நிச்சயமாக பாவங்களை மன்னிக்கக் கூடாது என்பதுதான் நீங்கள்.",
                    "reference": "Abû Dâwud [2602](3/34) and At-Tirmidhî [3446](5/510). Also see Ŝaĥîĥ At-Tirmidhî (3/156)."
                }
            ]
        },
        {
            "group_id": 96,
            "title": "பயணத்திற்காக",
            "duas": [
                {
                    "id": 207,
                    "group_id": 96,
                    "dua": "(١) اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ، اللَّهُ أَكْبَرُ ﴾سُبْحَانَ الَّذِيْ سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ﴿ اللَّهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى، وَمِنَ الْعَمَلِ مَا تَرْضَى، اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِعَنَّا بُعْدَهُ، اللَّهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ، وَالْخَلِيْفَةُ فِي الأَهْلِ، اللَّهُمَّ إِنِّي أَعُوْدُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكآبَةِ الْمَنْظَرِ وَسُوءِ المُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ(٢) آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
                    "translation": "(1) அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது, அவர் எவ்வளவு பெருமைமிக்கவர், அவர் இந்த (போக்குவரத்து) ஒன்றை எங்கள் சேவைக்கு வைத்துள்ளார், நாங்கள் இதற்குத் தகுதி இல்லை, எங்கள் இறைவனிடம்தான் நமது இறுதியிடம். ஓ அல்லாஹா, இந்த பயணத்தில் நாங்கள் நீங்கள் இன்பத்திற்கும் பயனாகும் பணி கேட்கிறோம். ஓ அல்லாஹா, எங்கள் பயணத்தை எளிதாக்குங்கள் மற்றும் அதன் தூரத்தை விரைவில் அடைய உதவுங்கள். ஓ அல்லாஹா, நீங்கள் பயணத்தில் நண்பர் மற்றும் குடும்பத்தில் எங்கள் அனுதாபமாக இருக்கிறீர்கள், ஓ அல்லாஹா, நான் உங்கள் நம்பிக்கையைப் பெறுகிறேன், பயணத்தின் தொல்லைகளை, மனதில் மாற்றங்கள் மற்றும் மோசமான நிலைமைகளிலிருந்து, மற்றும் குடும்பம் மற்றும் செல்வத்தில் மோசமான முடிவுகளிலிருந்து நான் உங்களிடம் நம்பிக்கை வைக்கிறேன்.மீண்டும் வந்த பிறகு அதே வேண்டுதலைச் செய்கிறேன், மேலும் இதைக் குறிப்பிடுகிறேன்:(2) 'நாங்கள் திரும்புகிறோம், arrepent, வழிபட்டு, எங்கள் இறைவனை புகழ்கிறோம்.'",
                    "reference": "Muslim [1342](2/998)."
                }
            ]
        },
        {
            "group_id": 97,
            "title": "ஒரு நகரம் அல்லது கிராமத்தில் நுழையும் போது",
            "duas": [
                {
                    "id": 208,
                    "group_id": 97,
                    "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الأَرْاضِيْنَ السَّبْعِ وَمَا أقْلَلْنَ، وَرَبَّ الشَّيَاطِيْنِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَخَيْرَ مَا فِيْهَا، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ أَهْلِهَا، وَشَرِّ مَا فِيْهَا",
                    "translation": "ஓ அல்லாஹா, ஏழு வானங்களின் இறைவன் மற்றும் அவற்றின் எல்லாவற்றையும் சூழ்ந்தவன், ஏழு பூமியின் இறைவன் மற்றும் அவற்றின் எல்லாவற்றையும் தாங்கி நிற்கும், அபிசாரியின் இறைவன் மற்றும் அவர்களை தவறாக வழிநடத்துவன, காற்றின் இறைவன் மற்றும் அவர் கொண்டு போகும் அனைவருக்கான. இந்த கிராமத்தின் நல்லதற்காக, அதன் குடியரசிற்காக, அதன் உள்ளே உள்ள அனைத்து நல்லதற்காக, மற்றும் இதற்காக, நான் உங்களை விடுபட்டது, இந்த கிராமத்தின் தீயவை, அதன் குடியரசின் தீயவை, மற்றும் இதற்குள் உள்ள அனைத்து தீயவியல்களில் இருந்து நான் உங்களை விடுபட்டேன்.",
                    "reference": "Al-Hâkim (2/100) and he authenticated it and Adh-Dhahabî agreed with him, Ibn As-Sunnî [524], Al-Hâfiž declared it Ĥasan in Takrîj Al-Athkâr (5/154). Shaykh Ibn Bâz said that it has been narrated by An-Nisâ'i ['Amal al-Yawm wa al-Laylah][547-548] with a Ĥasan chain. Also see Tuĥfat Al-Akhyâr (pg. 37)."
                }
            ]
        },
        {
            "group_id": 98,
            "title": "மார்க்கெட்டில் நுழையும் போது",
            "duas": [
                {
                    "id": 209,
                    "group_id": 98,
                    "dua": "لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لَهُ، لَهُ المُلْكُ وَلَهُ الحَمْدُ، يُحْيِي وَيُمِيْتُ، وَهُوَ حَيٌّ لَا يَمُوتُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ",
                    "translation": "அல்லாஹா தவிர வேறு எவரும் இல்லை, தனியாக, அவருக்கே பங்குகள் இல்லை, அவருக்கே அரசியல் மற்றும் புகழும் உள்ளது. அவர் வாழ்கிறார் மற்றும் இறக்கிறார், அவர் உயிருடன் உள்ளவர் மற்றும் இறக்கவில்லை. அவருக்கு எல்லா நல்லதும் உள்ளது மற்றும் அவர் அனைத்திலும் அழுத்தமானவர்.",
                    "reference": "At-Tirmidhî [3429](5/291), Al-Hâkim (1/538) and Ibn Mâjah [2235]. Al-Albânî classed it as Ĥasan in Ŝaĥîĥ Ibn Mâjah (2/21) and Ŝaĥîĥ At-Tirmidhî (3/152)."
                }
            ]
        },
        {
            "group_id": 99,
            "title": "ஏறிய விலங்கு (அல்லது போக்குவரத்து) தடுமாறும் போது",
            "duas": [
                {
                    "id": 210,
                    "group_id": 99,
                    "dua": "بِسْمِ اللهِ",
                    "translation": "அல்லாஹ்வின் பெயரில்.",
                    "reference": "Abû Dâwud [4982](4/296). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/941)."
                }
            ]
        },
        {
            "group_id": 100,
            "title": "பணியாளர் வசிக்கிறவருக்கான வேண்டுதல்",
            "duas": [
                {
                    "id": 211,
                    "group_id": 100,
                    "dua": "أَسْتَوْدِعُكُمُ اللَّهَ، الَّذِيْ لَا تَضِيْعُ وَدَائِعُهُ",
                    "translation": "நான் உங்களை அந்த அல்லாஹ்வின் நம்பிக்கைக்கு வைக்கிறேன், அவர் நம்பிக்கையைப் பெற முடியாது.",
                    "reference": "Aĥmad (2/403) and Ibn Mâjah [2825](2/943). Also see Ŝaĥîĥ Ibn Mâjah (2/133)."
                }
            ]
        },
        {
            "group_id": 101,
            "title": "பயணக்காரருக்கான வசிப்பவரின் வேண்டுதல்",
            "duas": [
                {
                    "id": 212,
                    "group_id": 101,
                    "dua": "أَسْتَوْدِعُ اللَّهَ دِيْنَكَ، وَأَمَانَتَكَ، وَخَوَاتِيْمَ عَمَلِكَ",
                    "translation": "நான் உன் மதத்தையும், உன் நம்பிக்கையையும், உன் செயல்களின் முடிவுகளையும் அல்லாஹ்வின் நம்பிக்கைக்கு விடுகிறேன்.",
                    "reference": "Aĥmad (2/7) and At-Tirmidhî [3443](5/499). Also see Ŝaĥîĥ At-Tirmidhî (2/155)."
                },
                {
                    "id": 213,
                    "group_id": 101,
                    "dua": "زَوَّدَكَ اللَّهُ التَّقْوَى، وَغَفَرَذَنْبَكَ، وَيَسَّرَ لَكَ الخَيْرَ حَيْثُمَا كُنْتَ",
                    "translation": "அல்லாஹா உனக்குத் தக்வா கொடுத்து, உன் பாவங்களை மன்னித்து, எங்கு இருந்தாலும் உனக்கு நல்லதைக் கடினமாக்கட்டும்.",
                    "reference": "At-Tirmidhî [3444]. Also see Ŝaĥîĥ At-Tirmidhî (3/155)."
                }
            ]
        },
        {
            "group_id": 102,
            "title": "ஏறும்போது அல்லது இறங்கும் போது நினைவூட்டல்",
            "duas": [
                {
                    "id": 214,
                    "group_id": 102,
                    "dua": "(١) اللهُ أَكْبَرُ(٢) سُبْحَانَ اللهُ",
                    "translation": "ஏறும் போது, (1) 'அல்லாஹ் மிகப்பெரியது' என்றால், இறங்கும் போது (2) 'அல்லாஹ் எவ்வளவு குரலின்மை' என்று கூறுங்கள்.",
                    "reference": "Al-Bukhârî [2993](6/135)."
                }
            ]
        },
        {
            "group_id": 103,
            "title": "காலை வந்து கொண்டால் பயணியின் பிரார்த்தனை",
            "duas": [
                {
                    "id": 215,
                    "group_id": 103,
                    "dua": "سَمَّعَ سَامِعٌ بِحَمْدِ اللهِ، وَحُسْنِ بَلائِهِ عَلَيْنَا،.رَبَّنَا صَاحِبْنَا، وَأَفْضِلْ عَلَيْنَا عَائِذاً باللهِ مِنَ النَّارِ",
                    "translation": "ஒரு சாட்சியாளர், அல்லாஹ்வுக்கு நம் புகழையும் அவரின் அனுகிரஹத்தையும், நம்முடைய பாவங்களிலிருந்து இன்றி காப்பாற்றுங்கள் என்று சொல்லும், நம்முடைய இறைவனே, நம்மை பாதுகாப்பு செய்யவும், எங்கள் மீது கென்பற்றச் செய்யவும், தீமைகளைத்தேற்கவும்.",
                    "reference": "Muslim [2718](4/2086)."
                }
            ]
        },
        {
            "group_id": 104,
            "title": "எங்கு நிற்கிறோமே அல்லது படுக்கிறோமே",
            "duas": [
                {
                    "id": 216,
                    "group_id": 104,
                    "dua": "أَعُوذُ بِكَلِمَاتِ اللّهِِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
                    "translation": "அல்லாஹ்வின் முழுமையான சொற்களிலிருந்து நான் அதில் மாசுகளைப் பெறுகிறேன்.",
                    "reference": "Muslim [2708](4/2080)."
                }
            ]
        },
        {
            "group_id": 105,
            "title": "பயணத்திலிருந்து திரும்பும் போது",
            "duas": [
                {
                    "id": 217,
                    "group_id": 105,
                    "dua": "اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، اللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لهُ المُلْكُ وَ لَهُ الحَمْدُ، وهُوَ عَلَى كُلِّ شَيْءٍ قَدِيْرٌ، آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حـَامِدُونَ، صَدَقَ اللهُ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الأحْزَابَ وَحْدَهُ",
                    "translation": "அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது, அல்லாஹ் மிகப்பெரியது. அல்லாஹ்வை தவிர வேறு எவரும் இல்லை, தனியாக, அவருக்கே பங்குகள் இல்லை. அவருக்கே அரசியல் மற்றும் புகழும் உள்ளது, அவர் அனைத்திலும் அழுத்தமானவர். நாங்கள் திரும்புகிறோம், arrepent, வழிபட்டு, எங்கள் இறைவனை புகழ்கிறோம். அல்லாஹ் அவரது வாக்குறுதிகளை நிறைவேற்றினார், அவரது பணி நிறைவுக்கு வந்தார் மற்றும் தனித்துவமாக கூட்டத்தினை தோற்கடித்தார்.",
                    "reference": "Al-Bukhârî [1797](7/163) and Muslim [1344](2/980)."
                }
            ]
        }
    ]
},
  {
    "category_id": 6,
    "title": "மகிழ்ச்சி & துக்கம்",
    "group": [
      {
        "group_id": 34,
        "title": "கவலை மற்றும் துக்கத்திற்கு",
        "duas": [
          {
            "id": 120,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي عَبْدُكَ، ابْنُ عَبْدِكَ، ابْنُ أَمَتِكَ، نَاصِيَتِي بِيَدِكَ، مَاضٍ فِيَّ حُكْمُكَ، عَدْلٌ فِيَّ قَضَاؤُكَ، أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ، سَمَّيْتَ بِهِ نَفْسَكَ، أوْ أَنْزَلْتَهُ فِي كِتَابِكَ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ، أَوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ، أَنْ تَجْعَلَ القُرْآنَ رَبِيْعَ قَلْبِي، وَنُورَ صَدْرِي، وجَلَاءَ حُزْنِي، وَذَهَابَ هَمِّي",
            "translation": "அல்லாஹ்வே, நான் உன் அடிமை, உன் அடிமையின் மகன், உன் தாசியின் மகன், என் பிறை உன் கையில் உள்ளது, உன் கட்டளை என்னைப் பின் தொடர்கிறது, உன் தீர்ப்பு என்னைப் பொறுத்தவரை நியாயமானது. உன்னைப் பொருத்து அனைத்து பெயர்களையும் உன்னிடம் கேட்கிறேன். நீ உனக்காக பெயரிட்டால் அல்லது உன் நூலில் வெளிப்படுத்தினால், அல்லது உன் படைப்புகளில் ஒருவருக்கு கற்றுக் கொடுத்தால் அல்லது மறைஞானத்தில் உன் மூலம் பாதுகாக்கப்பட்டால், உன் கர்ப்பத்தில் குர்ஆனை என் இதயத்தின் உயிராக்கமாகவும் என் மார்பின் வெளிச்சமாகவும், என் துக்கத்தை நீக்கும் மருந்தாகவும், என் கவலையை களைவதாகவும் ஆக்குவாய்.",
            "reference": "Aĥmad (1/391). Al-Albânî authenticated it in Al-Kalam Ať-Ťayyib [124]."
          },
          {
            "id": 121,
            "group_id": 34,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْـزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَالِ",
            "translation": "அல்லாஹ்வே, நான் உன்னிடம் பாதுகாப்பு கேட்கிறேன் கவலை மற்றும் துக்கம், பலவீனம் மற்றும் சோம்பல், சிக்கனம் மற்றும் கோழைத்தனம், கடனின் சுமை மற்றும் ஆண்களால் கட்டுப்படுத்தப்படுவதிலிருந்து.",
            "reference": "Al-Bukhârî [6363](7/158), see Fatĥ al-Bârî (11/173)."
          }
        ]
      },
      {
        "group_id": 35,
        "title": "நெருக்கடியில் உள்ள ஒருவருக்கு",
        "duas": [
          {
            "id": 122,
            "group_id": 35,
            "dua": "لَا إلَهَ إِلَّا اللَّهُ الْعَظِيْمُ الْحَلِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ العَرْشِ العَظِيْمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ، وَرَبُّ الأَرْضِ وَرَبُّ العَرْشِ الكَرِيْمِ",
            "translation": "அருளாளர், மிகப் பெருமைமிகுந்த அல்லாஹ் அல்லாமல் வழிபடுவதற்கு வேறு யாருமில்லை. பரம அருட்கொடையாளர், மகத்தான சிங்காசனத்தின் இறைவனாகிய அல்லாஹ் அல்லாமல் வழிபடுவதற்கு வேறு யாருமில்லை. வானங்களின் இறைவனாகவும், பூமியின் இறைவனாகவும், கௌரவமிக்க சிங்காசனத்தின் இறைவனாகவும் உள்ள அல்லாஹ் அல்லாமல் வழிபடுவதற்கு வேறு யாருமில்லை.",
            "reference": "Al-Bukhârî [6346](7/154) and Muslim [2730](4/2092)."
          },
          {
            "id": 123,
            "group_id": 35,
            "dua": "اللَّهُمَّ رَحْمَتَكَ أَرْجـُو، فَلا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ، وَأَصْلِحْ لِي شَأْنِي كُلَّهُ، لَا إِلَهَ إِلَّا أنْتَ",
            "translation": "அல்லாஹ்வே, உன்னுடைய அருளை நம்புகிறேன். எனது அனைத்துப் பணிகளையும் சரிசெய்யவும். கண் சிமிட்டும் நேரம் கூட எனக்கு என்னை முழுமையாக விடாதே. உன்னுடையதோடு சரிசமமான யாரும் இல்லை.",
            "reference": "Abû Dâwud [5090](4/324) and Aĥmad (5/42). Al-Albânî authenticated it in Ŝaĥîĥ Abî Dâwud (3/959)."
          },
          {
            "id": 124,
            "group_id": 35,
            "dua": "لَا إِلَهَ إِلَّا أنْتَ سُبْحَانَكَ، إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ",
            "translation": "நீயே நாயகன் அல்லாஹ்வே, நீ மிகச் சுத்தமானவன், நிச்சயமாக நான் துன்மார்க்கரின் குழுவில் இருந்தேன்.",
            "reference": "At-Tirmidhî [3505](5/529) and Al-Hâkim (1/505) and he authenticated it and Adh-Dhahabî agreed with him. Also see Ŝaĥîĥ At-Tirmidhî (3/168)."
          },
          {
            "id": 125,
            "group_id": 35,
            "dua": "اللهُ اللهُ رَبِّي لَا أُشْرِكُ بِهِ شَيْئاً",
            "translation": "அல்லாஹ், அல்லாஹ் எனது இறைவன், அவரோடு நான் எதையும் இணைத்துக் கொள்ள மாட்டேன்.",
            "reference": "Abû Dâwud [1525](2/87). Also see Ŝaĥîĥ Ibn Mâjah (2/335)."
          }
        ]
      },
      {
        "group_id": 36,
        "title": "எதிரியையோ அல்லது அதிகாரத்தில் இருப்பவரையோ சந்திக்கும் போது",
        "duas": [
          {
            "id": 126,
            "group_id": 36,
            "dua": "اللَّهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ، وَنَعُوذُ بِكَ مِنْ شُرُورِهـِمْ",
            "translation": "அல்லாஹ்வே, அவர்களின் எதிர்ப்புக்கு நீ முன்னின்று, அவர்களின் தீமைகளிலிருந்து நாங்கள் உன்னிடம் பாதுகாப்பு கேட்கிறோம்.",
            "reference": "Abû Dâwud [1537](2/89) and Al-Hâkim (2/142) and he authenticated it and Adh-Dhahabî agreed with him."
          },
          {
            "id": 127,
            "group_id": 36,
            "dua": "اللَّهُمَّ أَنْتَ عَضُدِي، وَأَنْتَ نَصِيْرِي، بِكَ أَحُولُ، وَبِكَ أَصُولُ، وَبِكَ أُقَاتِلُ",
            "translation": "அல்லாஹ்வே, நீ என் ஆதரவாளர், நீ என் உதவியாளர், உன் வழியாகவே நான் அசைய முடிகிறது, உன் வழியாகவே நான் போரிடுகிறேன்.",
            "reference": "Abû Dâwud [2632](3/42) and At-Tirmidhî [3584](5/572). Also see Ŝaĥîĥ At-Tirmidhî (3/183)."
          },
          {
            "id": 128,
            "group_id": 36,
            "dua": "حَسْبُنَا اللهُ، وَنِعْمَ الوَكِيْلُ",
            "translation": "எங்களுக்கு அல்லாஹ் போதுமானவர், எவ்வளவு சிறந்த பாதுகாவலர் அவர்.",
            "reference": "Al-Bukhârî [4563](5/172)."
          }
        ]
      },
      {
        "group_id": 37,
        "title": "ஆட்சியாளரின் அநியாயத்திற்கு பயப்படும் ஒருவருக்கு",
        "duas": [
          {
            "id": 129,
            "group_id": 37,
            "dua": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ، وَ رَبَّ العَرْشِ العَظِيْمِ، كُنْ لِي جَاراً مِنْ فُلَانِ بْنِ فُلَانٍ، وَ أَحْزَابِهِ مِنْ خَلائِقِكَ؛ أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنهُمْ أوْ يَطْغَى، عَزَّ جَارُكَ، وَ جَلَّ ثَنَائُكَ، وَ لَا إِلَهَ إِلَّا أَنْتَ",
            "translation": "அல்லாஹ்வே, ஏழு வானங்களின் இறைவனே, பெரும் சிங்காசனத்தின் இறைவனே, என்னை [இந்த பெயரை கூறுங்கள்] எனும் அவரிடமிருந்தும், அவரின் கூட்டாளிகளிடமிருந்தும் பாதுகாப்பாயிரு, அவர்கள் என்னை அடக்கும்படி செய்யாதீர்கள், உன் பாதுகாப்பிற்குள் இருக்கும் ஒருவர் எப்பொழுதும் கௌரவமிக்கவர், உன் புகழ் மிகுந்தது, உன்னோடு சமமானது எதுவும் இல்லை.",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][707] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad [545]."
          },
          {
            "id": 130,
            "group_id": 37,
            "dua": "اللهُ أَكْبَرُ، اللهُ أَعَزُّ مِنْ خَلْقِهِ جَمِيْعًا، اللهُ أَعَزُّ مِمَّا أَخَافُ وَ أَحْذَرُ، أَعُوذُ باللهِ الَّذِي لَا إِلَهَ إِلَّا هُوَ، الْمُمْسِكِ السَّمَوَاتِ السَّبْعِ أَنْ يَقَعْنَ عَلَى الأَرْضِ إِلَّا بِإِذْنِهِ، مِنْ شَرِّ عَبْدِكَ فُلاَنٍ، وُجُنُودِهِ وَ أَتْبَاعِهِ وَ أَشْيَاعِهِ، مِنَ الْجِنِّ وَ الإِنْسِ، اللَّهُمَّ كُنْ لِي جَارًا مِنْ شَرِّهِمْ، جَلَّ ثَنَاؤُك، وَ عَزَّ جَارُكَ، وَ تَبَارَكَ اسْمُكَ: وَ لَا إِلَهَ غَيْرُكَ. [ثَلاثَ مَرَّاتٍ]",
            "translation": "அல்லாஹ் எல்லாவற்றிலும் பெரிதானவர், நான் பயப்படும் ஒவ்வொன்றிலும் அல்லாஹ் பெரிதானவர். வானங்களைத் தடுக்கின்ற உன்னுடையதின் கீழ் நான் உன்னை நோக்கி நம்புகிறேன். எனது எதிரிகளிடமிருந்து என்னைக் காப்பாற்றுவாயாக!",
            "reference": "Al-Bukhârî [Al-Adab Al-Mufrad][708] and Al-Albânî authenticated it in Ŝaĥîĥ Al-Adab Al-Mufrad (546)."
          }
        ]
      },
      {
        "group_id": 38,
        "title": "எதிரிகளுக்கு எதிராக",
        "duas": [
          {
            "id": 131,
            "group_id": 38,
            "dua": "اللَّهُمَّ مُنْزِلَ الْكِتَابِ، سَرِيْعَ الْحِسَابِ، اهْزِمِ الأحْزَابَ، اللَّهُمَّ اهْزِمْهُمْ وَ زَلْزِلْهُمْ",
            "translation": "அல்லாஹ்வே, நூலை வெளிப்படுத்தியவனே, கணக்கெடுப்பை விரைவாகச் செய்யவனே, கூட்டணிகளை தோற்கடிக்கவுமாட்டிரு, அல்லாஹ்வே, அவர்களை தோற்கடித்து குலையவுமாட்டிரு.",
            "reference": "Muslim [1742](3/1362)."
          }
        ]
      },
      {
        "group_id": 39,
        "title": "ஒரு கூட்டத்தின் பேரிலே பயப்படும் போது",
        "duas": [
          {
            "id": 132,
            "group_id": 39,
            "dua": "اللَّهُمَّ اكْفِنِيْهِمْ بِمَا شِئْتَ",
            "translation": "அல்லாஹ்வே, அவர்களை உன் விருப்பத்திற்கேற்ப என்னை விலக்கிவிடு.",
            "reference": "Muslim [3005](4/2300)."
          }
        ]
      },
      {
        "group_id": 40,
        "title": "உங்கள் இமான் குறித்த சந்தேகத்தில் சிக்கியவருக்கு",
        "duas": [
          {
            "id": 133,
            "group_id": 40,
            "dua": "(1) يَسْتَعِيْذُ بِاللهِ(2) يَنْتَهِي عَمَّا وَسْوَسَ فِيْهِ",
            "translation": "(1) ஷைத்தானிலிருந்து அல்லாஹ்விடம் பாதுகாப்பு கேட்கவும்.(2) அந்த சந்தேகம் ஏற்படுவதை நிறுத்தவும்.",
            "reference": "Al-Bukhârî [6/336](6/336) and Muslim [134,214](1/120)."
          },
          {
            "id": 134,
            "group_id": 40,
            "dua": "آمَنْتُ بِاللهِ وَرُسُلِهِ",
            "translation": "நான் அல்லாஹ்வையும் அவரது தூதர்களையும் நம்புகிறேன்.",
            "reference": "Muslim [134,212](1/119-120)."
          },
          {
            "id": 135,
            "group_id": 40,
            "dua": "﴾هُوَ الأوَّلُ وَالآخِـرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ﴿",
            "translation": "அவர் முதல் மற்றும் கடைசி, வெளிப்படையானவன் மற்றும் மறைபொருந்தியவன், அவருக்கு எல்லாவற்றும் நன்கறிந்தவன்.",
            "reference": "(1) Sûrah Al-Ĥadîd : 3.(2) Abû Dâwud [5110](4/329) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abî  Dâwud (3/962)."
          }
        ]
      },
      {
        "group_id": 41,
        "title": "கடனை அடைத்தல்",
        "duas": [
          {
            "id": 136,
            "group_id": 41,
            "dua": "اللَّهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
            "translation": "அல்லாஹ்வே, உன் அற்புத அருளால் எனக்கு வேறு எதையும் தேவையில்லாதபடி என்னை நிரப்புவாயாக.",
            "reference": "At-Tirmidhî [3563](5/650). Also see Ŝaĥîĥ At-Tirmidhî (3/180)."
          },
          {
            "id": 137,
            "group_id": 41,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الهَمِّ وَ الْحَـزَنِ، والعَجْزِ والكَسَلِ، والبُخْلِ والجُبْنِ، وضَلَعِ الدَّيْنِ وغَلَبَةِ الرِّجَال",
            "translation": "அல்லாஹ்வே, நான் உன்னிடம் பாதுகாப்பு கேட்கிறேன் கவலை மற்றும் துக்கம், பலவீனம் மற்றும் சோம்பல், சிக்கனம் மற்றும் கோழைத்தனம், கடனின் சுமை மற்றும் ஆண்களால் கட்டுப்படுத்தப்படுவதிலிருந்து.",
            "reference": "Al-Bukhârî [6363](7/158)."
          }
        ]
      },
      {
        "group_id": 53,
        "title": "ஒரு பேரிடர் ஏற்பட்டவருக்கு",
        "duas": [
          {
            "id": 154,
            "group_id": 53,
            "dua": "إِنَّا لِلهِ وَ إِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أجُرْنِي فِي مُصِيْبَتِي، وَ أخْلِفْ لِي خَيْراً مِنْهَا",
            "translation": "நாம் அல்லாஹ்விற்கு சொந்தமானவர்கள், நிச்சயமாக அவரிடமே திரும்பிச் செல்கின்றோம். அல்லாஹ்வே, என் பேரிடரில் என்னை பரிசளி, அதை விட மிக்கதையும் எனக்குப் பெற்றுத்தா.",
            "reference": "Muslim [918](2/632)."
          }
        ]
      },
      {
        "group_id": 92,
        "title": "ஷிர்க்கிற்கு பயப்படும் போது",
        "duas": [
          {
            "id": 203,
            "group_id": 92,
            "dua": "اللَّهُمَّ إِنِّي أَعُوذُبِكَ أَنْ أُشْرِكَ بِكَ وَأَنَا أَعْلَمُ، وَأَسْتَغْفِرُكَ لِمَا لَا أَعْلَمُ",
            "translation": "அல்லாஹ்வே, உன்னுடன் நான் ஷிர்க் செய்யாதிருக்க உன்னிடம் பாதுகாப்பு கேட்கிறேன், நான் அறிந்தும் அறியாமலும் செய்யும் தவறுகளுக்காக உன்னிடம் மன்னிப்பு கேட்கிறேன்.",
            "reference": "Aĥmad (4/403). Also see Ŝaĥîĥ Al-Jâmi' [3731](3/233) and Ŝaĥîĥ At-Targhîb wa At-Tarhîb [36](1/122) by Al-Albânî."
          }
        ]
      },
      {
        "group_id": 94,
        "title": "நியமனங்கள் பற்றிய காரியம் கூறுவதற்கு",
        "duas": [
          {
            "id": 205,
            "group_id": 94,
            "dua": "اللَّهُمَّ لَا طَيْرَ إِلَّا طَيْرُكَ، وَلَا خَيْرَ إِلَّا خَيْرُكَ، وَلَا إِلَهَ غَيْرُكَ",
            "translation": "அல்லாஹ்வே, எந்த நியமனங்களும் உன் உட்பொறுப்பின் கீழில்லை, எந்த நன்மையும் உன் படைப்பின் கீழில்லை, உன்னோடு சரிசமமான யாரும் இல்லை.",
            "reference": "Aĥmad (2/220), Ibn As-Sunnî [292] and Al-Albânî authenticated it in [Al-Aḥâdīth Aŝ-Ŝaĥîĥah][1065](3/54)."
          }
        ]
      },
      {
        "group_id": 106,
        "title": "மகிழ்ச்சியான அல்லது மகிழ்ச்சியற்ற செய்திகளைப் பெற்ற பிறகு கூற வேண்டியவை",
        "duas": [
          {
            "id": 218,
            "group_id": 106,
            "dua": "(١) الحَمْدُ لِلَّهِ الَّذِيْ بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ(٢) الحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
            "translation": "மகிழ்ச்சியான செய்திகளைப் பெற்றபின் கூற வேண்டியது: (1) 'அல்லாஹ்விற்குப் புகழ், அவருடைய அருளினால் நல்ல செயல்கள் நிறைவேறுகின்றன.'மகிழ்ச்சியற்ற செய்திகளைப் பெற்றபின் கூற வேண்டியது: (2) 'எல்லா சூழல்களிலும் அல்லாஹ்விற்குப் புகழ்.'",
            "reference": "Ibn As-Sunnî ['Amal al-Yawm wa al-Laylah][378] and Al-Hâkim (1/499) and he authenticated it. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [4640](4/201)."
          }
        ]
      },
      {
        "group_id": 122,
        "title": "வியப்போ அல்லது மகிழ்ச்சியோ ஏற்பட்டால்",
        "duas": [
          {
            "id": 240,
            "group_id": 122,
            "dua": "سُبْحَانَ اللهِ!",
            "translation": "அல்லாஹ் மிகச் சுத்தமானவன்!",
            "reference": "Al-Bukhârî [155](1/210), [283](1/390) and Muslim [371], [314](414), [332](4/1857)."
          },
          {
            "id": 241,
            "group_id": 122,
            "dua": "اللهُ أَكْبَرُ",
            "translation": "அல்லாஹ் மிகப்பெரியவன்.",
            "reference": "Al-Bukhârî [4741](8/441). Also see Ŝaĥîĥ At-Tirmidhî (2/103),(2/235) and Aĥmad (5/218)."
          }
        ]
      },
      {
        "group_id": 123,
        "title": "மகிழ்ச்சியான செய்திகளைப் பெற்ற பிறகு",
        "duas": [
          {
            "id": 242,
            "group_id": 123,
            "dua": "كَانَ النَّبِيُّ ﷺ إذَا أتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يُسَرُّ بِهِ؛ خَرَّ سَاجِداً شُكْراً لله تَبَارَكَ وَ تَعَالَى",
            "translation": "நபி ﷺ மகிழ்ச்சியான செய்தியோ அல்லது மகிழ்ச்சியளிக்கக் கூடிய செய்தியோ கேட்டால், உடனே அல்லாஹ்விற்கு நன்றி தெரிவித்து சஜ்தா செய்வார்.",
            "reference": "Abû Dâwud [2774], At-Tirmidhî [1578] and Ibn Mâjah [1394]. Also see Ŝaĥîĥ Ibn Mâjah (1/233) and Irwâ'-ul-Ghalîl (2/226)."
          }
        ]
      },
      {
        "group_id": 126,
        "title": "அதிர்ச்சியடைந்த போது",
        "duas": [
          {
            "id": 245,
            "group_id": 126,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "அல்லாஹ்வைத் தவிர வேறு யாரும் வழிபடுவதற்கு இல்லை.",
            "reference": "Al-Bukhârî [3346](6/381) and Muslim [2880](4/2208)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 7,
    "title": "இயற்கை",
    "group": [
        {
            "group_id": 61,
            "title": "காற்றுக் காற்றின் போது",
            "duas": [
                {
                    "id": 166,
                    "group_id": 61,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا",
                    "translation": "ஓ அல்லாஹா, நான் இதன் நன்மையை உன்னிடம் கேட்கிறேன், இதன் தீமைக்காக நான் உன்னிடம் அந்நியத்துடன் இருக்கிறேன்.",
                    "reference": "Abû Dâwud [5097](4/326) and Ibn Mâjah [3727](2/1228). Also see Ŝaĥîĥ Ibn Mâjah (2/305)."
                },
                {
                    "id": 167,
                    "group_id": 61,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا فِيْهَا، وَخَيْرَ مَا اُرْسِلَتْ بِهِ، وَأَعُوذُ بِكَ مِنْ شَـرِّهَا، وَشَرِّ مَا فِيْهَا، وَشَرِّ مَا اُرْسِلَتْ بِهِ",
                    "translation": "ஓ அல்லாஹா, நான் இதன் நன்மையை, இதற்குள் உள்ள நல்லதை மற்றும் இதன் மூலம் அனுப்பிய நல்லதை கேட்கிறேன், இதன் தீமையை, இதற்குள் உள்ள தீமையை மற்றும் இதன் மூலம் அனுப்பிய தீமைகளைப் பற்றி நான் உன்னிடம் அந்நியத்துடன் இருக்கிறேன்.",
                    "reference": "Muslim [899](2/616) and Al-Bukhârî [3206](4/76)."
                }
            ]
        },
        {
            "group_id": 62,
            "title": "இணையத்தை கேட்கும் போது",
            "duas": [
                {
                    "id": 168,
                    "group_id": 62,
                    "dua": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ، وَالمَلائِكَةُ مِنْ خِيْفَتِهِ",
                    "translation": "அவர் எவ்வளவு பெருமைமிக்கவர், (அவர்) அவரின் புகழுடன் காற்றினால் புகழிடப்படுகிறது, அவர் மலைகளில் உள்ள மரங்கள் சாய்த்துப் போகும் போது.",
                    "reference": "Al-Muwaťťa' (2/992) and Al-Albânî declared its chain to be Ŝaĥîĥ and Mawqûf."
                }
            ]
        },
        {
            "group_id": 63,
            "title": "மழைக்காக",
            "duas": [
                {
                    "id": 169,
                    "group_id": 63,
                    "dua": "اللَّهُمَّ أَسْقِنَا غَيْثاً مُغِيْثاً مَرِيْئاً مَرِيْعاً، نَافِعاً، غَيْرَ ضَارٍّ، عاجِلاً غَيْرَ آجِلٍ",
                    "translation": "ஓ அல்லாஹா, எங்களுக்கு உதவிய மழையை, ஆரோக்கியமான மற்றும் நல்ல மழையை, பயனுள்ளதாகவும் தீமையாக இல்லாத மழையை, இப்போது, பின்னர் அல்ல.",
                    "reference": "Abû Dâwud [1169](1/303). Al-Albânî declared it authentic in Ŝaĥîĥ Abû Dâwud (1/216)."
                },
                {
                    "id": 170,
                    "group_id": 63,
                    "dua": "اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا، اللَّهُمَّ أَغِثْنَا",
                    "translation": "ஓ அல்லாஹா, எங்களை மீட்டுக் கொள்ளுங்கள், ஓ அல்லாஹா, எங்களை மீட்டுக் கொள்ளுங்கள், ஓ அல்லாஹா, எங்களை மீட்டுக் கொள்ளுங்கள்.",
                    "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/613)."
                },
                {
                    "id": 171,
                    "group_id": 63,
                    "dua": "اللَّهُمَّ اسْقِ عِبَادَكَ، وَبَهَائِمَكَ، وَانْشُرْ رَحْمَتَكَ، وَأَحْيِيْ بَلَدَكَ المَيِّتَ",
                    "translation": "ஓ அல்லாஹா, உன் தாபங்கள் மற்றும் உங்கள் கல்லூரிகளுக்கான நீரை வழங்குங்கள், உங்கள் கருணையை விரிவாக்குங்கள் மற்றும் உங்கள் இறந்த நிலத்தை உயிரூட்டுங்கள்.",
                    "reference": "Abû Dâwud [1176](1/305) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (1/218)."
                }
            ]
        },
        {
            "group_id": 64,
            "title": "மழை பெய்யும் போது",
            "duas": [
                {
                    "id": 172,
                    "group_id": 64,
                    "dua": "اللَّهُمَّ صَيِّباً نَافِعاً",
                    "translation": "ஓ அல்லாஹா, இது ஒரு பயனுள்ள மழை கிளவையாக இருக்கட்டும்.",
                    "reference": "Al-Bukhârî [1032](2/518)."
                }
            ]
        },
        {
            "group_id": 65,
            "title": "மழைக்குப் பிறகு",
            "duas": [
                {
                    "id": 173,
                    "group_id": 65,
                    "dua": "مُطِرْنَا بِفَضْلِ اللهِ وَرَحْمَتِهِ",
                    "translation": "எங்களுக்கு அல்லாஹ்வின் அருளால் மற்றும் கருணையால் மழை கிடைத்தது.",
                    "reference": "Al-Bukhârî [846](1/205) and Muslim [71](1/83)."
                }
            ]
        },
        {
            "group_id": 66,
            "title": "தெளிவான வானங்களுக்கு கேட்கும் போது",
            "duas": [
                {
                    "id": 174,
                    "group_id": 66,
                    "dua": "اللَّهُمَّ حَوَالَيْنَا وَلَا عَلَيْنَا، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ، وَبُطُونِ الأوْدِيَةِ، وَمَنَابِتِ الشَّجَرِ",
                    "translation": "ஓ அல்லாஹா, மழை எங்களுக்கு அருகாமையில் விழட்டும், எங்களிடம் அல்ல, ஓ அல்லாஹா, (அது விழட்டும்) பசுமைகளில், மலைகளில், ஆற்றின் அடியில் மற்றும் மரங்களின் இலைகளின் மீது.",
                    "reference": "Al-Bukhârî [1013](1/224) and Muslim [897](2/614)."
                }
            ]
        },
        {
            "group_id": 67,
            "title": "வெள்ளை நிலா காணும் போது",
            "duas": [
                {
                    "id": 175,
                    "group_id": 67,
                    "dua": "اللهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالأمْنِ وَالإيْمَانِ، والسَّلامَةِ والإسْلامِ، وَالتَّوْفِيْقِ لِمَا تُحِبُّ رَبَّنَا وَتَرْضَى، رَبُّنَا وَرَبُّكَ اللهُ",
                    "translation": "அல்லாஹ் மிகப்பெரியது. ஓ அல்லாஹா, மாதவிடாய் நமக்கு சாந்தியுடன், நம்பிக்கையுடன், சுகமாக, இஸ்லாமுடன், மற்றும் நீங்கள் விரும்பும் அனைத்திற்கும் உங்களை மகிழ்ச்சியளிக்கும் உடன்படிக்கையுடன் நிலவட்டும். நமது இறைவன் மற்றும் உங்கள் இறைவன் அல்லாஹ்வே.",
                    "reference": "At-Tirmidhî [3451](5/405) and Ad-Dârimî (1/336) and the wording is his. Also see Ŝaĥîĥ At-Tirmidhî (3/157)."
                }
            ]
        },
        {
            "group_id": 76,
            "title": "முதுகு அல்லது முற்றுமுழுதாகக் காய்ந்துவிட்டால்",
            "duas": [
                {
                    "id": 187,
                    "group_id": 76,
                    "dua": "اللَّهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا، وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا، وَبَارِكْ لَنَا فِي صَاعِنَا، وَبَارِكْ لَنَا فِي مُدِّنَا",
                    "translation": "ஓ அல்லாஹா, எங்கள் பழங்களில், எங்கள் நகரத்தில், எங்கள் சாயத்தில், மற்றும் எங்கள் முட்டையில் நம் மீது ஆசீர்வதிக்கவும்.",
                    "reference": "Muslim [1373](2/1000)."
                }
            ]
        },
        {
            "group_id": 110,
            "title": "குட்டை அல்லது பன்றியின் சத்தத்தை கேட்கும் போது",
            "duas": [
                {
                    "id": 228,
                    "group_id": 110,
                    "dua": "إذَا سَمِعْتُمْ صِيَاحَ الدِّيَكَةِ فَاسْألُوا اللهَ مِنْ فَضْلِهِ؛ فَإنَّهَا رَأَتْ مَلَكاً، وَ إذَا سَمِعْتُمْ نَهِيْقَ الحِمَارِ فَتَعوَّذُوا بِااللهِ مِنَ الشَّيْطَانِ؛ فَإنَّهُ رَأى شَيْطَانًا",
                    "translation": "நீங்கள் கோழியின் சத்தத்தை கேட்டால், அல்லாஹவிடம் அவரின் அருளைப் பெறுங்கள்; இது ஒரு தூதனைப் பார்த்தது, மேலும் நீங்கள் குதிரையின் சத்தத்தை கேட்டால், நீங்கள் அல்லாஹ்விடம் சாத்தானால் சுத்தப்படுங்கள்; இது ஒரு சாத்தானைக் கண்டது.",
                    "reference": "Al-Bukhârî [3303](6/350) and Muslim [2729](4/2092)."
                }
            ]
        },
        {
            "group_id": 111,
            "title": "இரவு காலையில் நாய்களின் சத்தத்தை கேட்கும் போது",
            "duas": [
                {
                    "id": 229,
                    "group_id": 111,
                    "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
                    "translation": "நீங்கள் இரவில் நாய்களின் அல்லது குதிரையின் சத்தங்களை கேட்டால், நான் அல்லாஹ்விடம் அந்நியத்துடன் இருக்கிறேன், ஏனெனில் அவை நீங்கள் காணாததைப் பார்கின்றன.",
                    "reference": "Abû Dâwud [5103](4/327) and Aĥmad (3/306). Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/961)."
                }
            ]
        }
    ]
},
  {
    "category_id": 8,
    "title": "சிறந்த நடத்தை",
    "group": [
        {
            "group_id": 47,
            "title": "ஒரு பிறப்புக்கு வரவேற்கிறேன்",
            "duas": [
                {
                    "id": 145,
                    "group_id": 47,
                    "dua": "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَ شَكَرْتَ الْوَاهِبَ، وَ بَلَغَ أَشُدَّهُ، وَ رُزِقْتَ بِرَّهُوَيَرُدُّ عَلَيْهِ المُهَنَّأ فَيَقُولُ: بَارَكَ اللهُ لَكَ، وَ بَارَكَ عَلَيْكَ، وجَزَاكَ اللهُ خَيْراً، وَرَزَقَكَ اللهُ مِثْلَهُ، وأَجْزَلَ ثَوَابَكَ",
                    "translation": "அல்லாஹா, நீ உனக்கு அளித்த இந்த குழந்தையில் உன்னை ஆசீர்வதிக்கட்டும், மற்றும் உன்னை வழங்குபவருக்கு நீ நன்றி செலுத்தவும், அவன் (இந்த குழந்தை) பரிதாபத்திற்கு வந்து, உன்னை நோக்கி நல்ல நடத்தை அடையவும்.பதில்: 'அல்லாஹா, உனக்காக எதுவும் அமைதியாக இருக்கட்டும்! அல்லாஹா, உன் மன்னிப்பு மூலம் உன்னை விரும்புகிறார், என்னால் ஈர்க்கப்படும் பிற குழந்தையை உனக்காக அளித்து, உனக்காக பருமனான நினைவுகளை அளிக்கட்டும்.'",
                    "reference": "An-Nawawî [Al-Athkâr](pg. 349). Also see Ŝaĥîĥ Al-Athkâr of Imam An-Nawawî (2/713) by Shaykh Salîm Al-Hilâlî."
                }
            ]
        },
        {
            "group_id": 75,
            "title": "போதை நிலையில் கற்பித்து வந்தால்",
            "duas": [
                {
                    "id": 186,
                    "group_id": 75,
                    "dua": "إِنِّي صَائِمٌ، إِنِّي صَائِمٌ",
                    "translation": "நான் நோன்பேற்கிறேன், நான் நோன்பேற்கிறேன்.",
                    "reference": "Al-Bukhârî [1894](4/103) and Muslim [1151](2/806)."
                }
            ]
        },
        {
            "group_id": 77,
            "title": "முசுகத்தின்போது",
            "duas": [
                {
                    "id": 188,
                    "group_id": 77,
                    "dua": "(١) الْحَمْدُ للهِ (٢) يَرْحَمُكَ اللهُ(٣) يَهْدِيْكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
                    "translation": "நீங்கள் முசுகம் செய்து கொண்டால், சொல்லுங்கள்: (1) 'அல்லாஹா, உன்னுடைய புகழ் கொண்டவன்', பின்னர் அவரது சகோதரன் அல்லது தோழர் பதிலளிக்க வேண்டும்: (2) 'அல்லாஹா, உன்னை இரக்கம் செய்வானாக'. மற்றும் முசுகத்தில் உள்ளவன் மீண்டும் சொல்லவேண்டும்: (3) 'அல்லாஹா, உங்களை வழிநடத்துவான் மற்றும் உங்கள் நிலையை சரிசெய்வான்.'",
                    "reference": "Al-Bukhârî [6224](7/125)."
                }
            ]
        },
        {
            "group_id": 78,
            "title": "ஒரு முஸ்லிம் அல்லாதவர் முசுகம் செய்வதற்கு பிறகு",
            "duas": [
                {
                    "id": 189,
                    "group_id": 78,
                    "dua": "يَهْدِيْكُمُ اللهُ، وَيُصْلِحُ بَالَكُمْ",
                    "translation": "அல்லாஹா உங்களை வழிநடத்துவான் மற்றும் உங்கள் நிலையை சரிசெய்வான்.",
                    "reference": "At-Tirmidhî [2739](5/82), Aĥmad (4/400) and Abû Dâwud [5038](4/308). Also see Ŝaĥîĥ At-Tirmidhî (2/354)."
                }
            ]
        },
        {
            "group_id": 80,
            "title": "வலைந்து சென்ற இரவில் அல்லது மாடியால் வாங்கும் போது",
            "duas": [
                {
                    "id": 191,
                    "group_id": 80,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَخَيْرَ مَا جَبَلْتَهَا عَلَيْهِ، وَأَعُوذُ بِكَ مِنْ شَرِّهَا، وَشَرِّ مَا جَبَلْتَهَا عَلَيْهِ",
                    "translation": "ஓ அல்லாஹா, அவளின் உள்ளுள்ள நன்மையை மற்றும் நீ அவளை விலக்கினாய், அதை அடையவும். அவளில் உள்ள தீமையினால் நான் உன்னிடம் மறுப்பு செய்கிறேன் மற்றும் நீ அவளை விலக்கினாய், அதை அடையவும்.",
                    "reference": "Abû Dâwud [2160](2/248) and Ibn Mâjah [1918](1/617). Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
                }
            ]
        },
        {
            "group_id": 82,
            "title": "கோபம் வரும்போது",
            "duas": [
                {
                    "id": 193,
                    "group_id": 82,
                    "dua": "أَعُوذُ بِاللهِ مِنَ الشَّيْطَانِ الرَّجِيْمِ",
                    "translation": "நான் திட்டமிட்ட துரோகியிடமிருந்து அல்லாஹாவிடம் மறுப்பு செய்கிறேன்.",
                    "reference": "Al-Bukhârî [6048](7/99) and Muslim [2610](5/2015)."
                }
            ]
        },
        {
            "group_id": 83,
            "title": "ஒருவரை சோதனை அல்லது கஷ்டத்தில் காணும்போது",
            "duas": [
                {
                    "id": 194,
                    "group_id": 83,
                    "dua": "الْحَمْدُ لِلَّهِ الَّذِيْ عَافَانِي مِمَّا ابْتَلاكَ بِهِ، وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً",
                    "translation": "அல்லாஹாவுக்கு புகழ், நீ உன்னை சோதிக்கக் காரணமாக நான் எவ்வளவு கஷ்டங்களை தாங்கி இருக்கிறேன் மற்றும் என் உருவில் ஆட்குழல் வாழ்ந்திருக்கிறேன்.",
                    "reference": "At-Tirmidhî [3432](5/493,494). Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
                }
            ]
        },
        {
            "group_id": 84,
            "title": "ஒரு அமர்வு அல்லது கூட்டத்தில்",
            "duas": [
                {
                    "id": 195,
                    "group_id": 84,
                    "dua": "رَبِّ اغْفِرْ لي، وَتُبْ عَلَـيَّ، إِنَّكَ أَنْتَ التَّوَّابُ الغَفُورُ",
                    "translation": "ஓ என் இறைவன், என்னை மன்னிக்கவும் மற்றும் எனக்காக (எனது தீமையை ஏற்கவும்). நீ உண்மையில் மீண்டும் திரும்புகிறவன். மீண்டும் மன்னிக்கிறவன்.",
                    "reference": "At-Tirmidhî [3432]. Also see Ŝaĥîĥ At-Tirmidhî (3/153) and Ŝaĥîĥ Ibn Mâjah (2/321) and the wording is At-Tirmidhî's."
                }
            ]
        },
        {
            "group_id": 85,
            "title": "ஒரு அமர்வு அல்லது கூட்டத்தின் முடிவில் கூறப்படும் பாவங்களுக்கான மறுப்பின்",
            "duas": [
                {
                    "id": 196,
                    "group_id": 85,
                    "dua": "سُبْحَانَكَ اللَّهُمَّ وَبِحَمْدِكَ، أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا أَنْتَ، أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ",
                    "translation": "அல்லாஹா, நீ எவ்வளவு மிகப்பெரிதானவர், நான் உன்னை புகழ்கிறேன். யாரும் என்னை சாத்தானாக்கவில்லை என்பதற்கான குற்றம். நான் உன் மன்னிப்பை தேடுகிறேன் மற்றும் உன் முன் திரும்புகிறேன்.",
                    "reference": "Abû Dâwud [4859], At-Tirmidhî [3433], An-Nisâ'i ['Amal al-Yawm wa al-Laylah][397]. Also see Ŝaĥîĥ At-Tirmidhî (3/153)."
                }
            ]
        },
        {
            "group_id": 86,
            "title": "மன்னிப்பின் மறுப்புக்கு மீண்டும் வருகிறேன்",
            "duas": [
                {
                    "id": 197,
                    "group_id": 86,
                    "dua": "وَلَكَ",
                    "translation": "உனக்காக (அல்லாஹா மன்னிக்கட்டும்).",
                    "reference": "Aĥmad (5/82) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah](pg. 218)."
                }
            ]
        },
        {
            "group_id": 87,
            "title": "நீங்கள் செய்த நன்மைக்கு",
            "duas": [
                {
                    "id": 198,
                    "group_id": 87,
                    "dua": "جَزَاكَ اللهُ خَيْراً",
                    "translation": "அல்லாஹா உன்னை நன்மை செய்யட்டும்.",
                    "reference": "At-Tirmidhî [2035]. Also see Ŝaĥîĥ Al-Jâmi' [6244] and Ŝaĥîĥ At-Tirmidhî (2/200)."
                }
            ]
        },
        {
            "group_id": 89,
            "title": "அல்லாஹாவின் நன்மைக்காக உன்னைப் பொறுத்தவரை",
            "duas": [
                {
                    "id": 200,
                    "group_id": 89,
                    "dua": "أَحَبَّكَ الَّذِيْ أَحْبَبْتَنِي لَهُ",
                    "translation": "உன்னைச் சொல்லிக்கொண்ட அவர் உன்னை நேசிக்கட்டும்.",
                    "reference": "Abû Dâwud [5125](4/333) and Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (3/965)."
                }
            ]
        },
        {
            "group_id": 90,
            "title": "உனது சொத்துக்களில் சிலவற்றை உனக்கு வழங்கியவருக்கு",
            "duas": [
                {
                    "id": 201,
                    "group_id": 90,
                    "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِكَ",
                    "translation": "அல்லாஹா உன் குடும்பத்திற்கும் சொத்திற்கும் ஆசீர்வதிக்கட்டும்.",
                    "reference": "Abû Dâwud [5125](4/333) and Al-Albânî declared it Ĥasan in Ŝaĥîĥ Abû Dâwud (3/965)."
                }
            ]
        },
        {
            "group_id": 91,
            "title": "உனது கடனை கட்டுவதற்கு பிறகு",
            "duas": [
                {
                    "id": 202,
                    "group_id": 91,
                    "dua": "بَارَكَ اللهُ لَكَ في أَهْلِكَ وَمالِك، إِنَّمَا جَزَاءُ السَّلَفِ الْحَمْدُ والأَدَاءُ",
                    "translation": "அல்லாஹா உன் குடும்பத்திற்கும் சொத்திற்கும் ஆசீர்வதிக்கட்டும். உண்மையில், பாராட்டு மற்றும் செலுத்துதல் கடனை எதிர்பார்க்கின்றன.",
                    "reference": "An-Nisâ'i ['Amal al-Yawm wa al-Laylah][372](pg. 300) and Ibn Mâjah [2424](2/809). Also see Ŝaĥîĥ Ibn Mâjah (2/55)."
                }
            ]
        },
        {
            "group_id": 93,
            "title": "ஒருவருக்கு பரிசு அல்லது தானம் வழங்கிய பிறகு மறுப்பைத் திருப்புங்கள்",
            "duas": [
                {
                    "id": 204,
                    "group_id": 93,
                    "dua": "وَفِيْكَ بَارَكَ اللهُ",
                    "translation": "அல்லாஹா உன்னை ஆசீர்வதிக்கட்டும்.",
                    "reference": "Ibn As-Sunnî [278](pg. 138). Also see Ibn Qayyim [Al-Wabil Aŝ-Ŝayyib](pg. 304) with research by Bashîر Muĥammad 'Uyun."
                }
            ]
        },
        {
            "group_id": 108,
            "title": "இஸ்லாமிய வாழ்த்து பரப்புவதன் உயர்வு",
            "duas": [
                {
                    "id": 224,
                    "group_id": 108,
                    "dua": "قَالَ ﷺ: «لا تَدْخُلُوا الجَنَّة حَتَّى تُؤمِنُوا، وَ لَا تُؤمِنُوا حَتَّى تَحَابُّوا، أَوَلَا أدُلُّكُمْ عَلَى شَيْءٍ إذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ، أَفْشُوا السَّلامَ بَيْنَكُمْ»",
                    "translation": "அவர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) சொன்னார்: 'நீங்கள் நம்பிக்கையுடன் ஜன்னலுக்கு உள்ளே செல்லமாட்டீர்கள், மேலும் நீங்கள் ஒன்றின்மையில் நேசிக்க முடியாது. நான் உங்களுக்கு ஏதாவது சொல்ல முடியுமா, நீங்கள் அதை செயல்படுத்தினால், நீங்கள் ஒருவருக்கொருவர் மதிப்பு அடைவீர்கள்? உங்கள் இடையில் சலாமை பரப்புங்கள்.'",
                    "reference": "Muslim [54](1/74)."
                },
                {
                    "id": 225,
                    "group_id": 108,
                    "dua": "قَالَ عمار بن ياسر(رضي الله عنه): «ثَلاثٌ مَنْ جَمَعَهُنَّ فَقَدْ جَمَعَ الإيْمَانَ: الإنْصَافُ مِنْ نَفْسِكَ، و بَذْلُ السَّلامِ لِلْعَالَمِ، و الإنْفَاقُ مِنَ الإقْتَارِ»",
                    "translation": "'அம்மார் பின் யாசிர் (ராடி அல்லாஹ் அன்பே) சொன்னார்: 'மூன்று சிறப்புகள், அவற்றைப் பரப்பினால், அவன் தனது நம்பிக்கையை நிறைவாக பெறுகிறான்: நீ உன்னை நியாயமாக காட்டவும், உலகுக்கு வாழ்த்துக்கள் அளிக்கவும், மற்றும் சிறிது அளவிலான மானிடத்தை செலுத்தவும்.'",
                    "reference": "Al-Bukhârî [Before hadith[28]](1/82)."
                },
                {
                    "id": 226,
                    "group_id": 108,
                    "dua": "وَ عَنْ عَبْدِاللهِ بِنْ عَمْرٍو(رضي الله عنه): «أنَّ رَجُلاً سَأَلَ النَّبِيَّ ﷺ أيُّ الإسْلامِ خَيْرٌ؟» قَالَ: «تُطْعِمُ الطَّعَامَ، وَتَقْرَأُ السَّلامَ عَلَى مَنْ عَرَفْتَ وَ مَنْ لَمْ تَعْرِف»",
                    "translation": "'அப்துல்லாஹ் பின் அம்ர் (ராடி அல்லாஹ் அன்பே) சொன்னார்: 'ஒரு மனிதர் நபியை (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கேட்டார்: 'எந்த இஸ்லாம் சிறந்தது?'. அவர் (ஸல்லல்லாஹு அலைஹி வஸல்லம்) கூறினார்: 'உணவைச் சாப்பிடுங்கள், மற்றும் நீங்கள் அறிந்தவருக்கு வாழ்த்து அளிக்கவும், நீங்கள் அறியாதவருக்கு கூட.'",
                    "reference": "Al-Bukhârî [12](1/55) and Muslim [39](1/65)."
                }
            ]
        },
        {
            "group_id": 109,
            "title": "ஒரு முஸ்லிம் அல்லாதவருக்கு வாழ்த்தை மறுப்பது",
            "duas": [
                {
                    "id": 227,
                    "group_id": 109,
                    "dua": "وَ عَلَيْكُمْ",
                    "translation": "உங்களுக்கு (அல்லாஹாவின் இரக்கம்) உடனே.",
                    "reference": "Al-Bukhârî [6258](11/42) and Muslim [2163](4/1705)."
                }
            ]
        },
        {
            "group_id": 112,
            "title": "நீங்கள் பாவம் செய்த ஒருவருக்கான",
            "duas": [
                {
                    "id": 230,
                    "group_id": 112,
                    "dua": "اللَّهُمَّ فأَيُّمَا مُؤْمِنٍ سَبَبْتُهُ؛ فَاجْعَلْ ذَلِكَ لَهُ قُرْبَةً إلَيْكَ يَوْمَ القِيَامَةِ",
                    "translation": "ஓ அல்லாஹா, நான் அடிக்கடி சிரித்தால், அதை ஒவ்வொரு நம்பிக்கையுள்ளவனுக்காகவும், அதை உனக்கு உண்டாக்கி விடுங்கள் என்றால், அதை மறுதலிக்கவும்.",
                    "reference": "Al-Bukhârî [6361](11/171) and Muslim [2601](4/2007)."
                }
            ]
        },
        {
            "group_id": 113,
            "title": "ஒரு முஸ்லிமிடம் புகழ்வதற்கான அடிப்படைகள்",
            "duas": [
                {
                    "id": 231,
                    "group_id": 113,
                    "dua": "قَالَ ﷺ: «إذَا كَانَ أحَدُكُمْ مَادِحاً صَاحِبَهُ لَا مَحَالَةَ؛ فَلْيَقُل: أحْسِبُ فُلَانًا: وَ اللهُ حَسِيْبُهُ، وَ لَا أُزَكِّي عَلَى اللهِ أحَداً: أحْسِبُهُ – إنْ كَانَ يَعْلمُ ذَاكَ – كَذَا وَ كَذَا»",
                    "translation": "நான் எவரும் அடுத்தவன் பக்கம் சீரியல் செய்யவில்லை, ஆனால் என்னால் யாருக்கானது என்று நான் எதிர்பார்க்கிறேன்; நான் நினைத்தால், அதில் வேறு ஒருவர் அல்ல என்கிறேன்.'",
                    "reference": "Muslim [3000](4/2296) and Al-Bukhârî [2662]."
                }
            ]
        },
        {
            "group_id": 114,
            "title": "புகழப்பட்ட ஒருவருக்கான",
            "duas": [
                {
                    "id": 232,
                    "group_id": 114,
                    "dua": "اللَّهُمَّ لَا تُؤَاخِذْنِي بِمَا يَقُولُونَ، وَ اغْفِرْ لِي مَا لاَ يَعْلَمُونَ [وَ اجْعَلْنِي خَيْراً مِمَّا يَظُنُّونَ]",
                    "translation": "ஓ அல்லாஹா, அவர்கள் என்னைப் பற்றி கூறுவதைத் திட்டமிடாதே, அவர்கள் என்னைப் பற்றி அறியாததைக் கொண்டு மன்னிக்கவும் (அவர்களுக்கு என்னால் தோன்றுவது).",
                    "reference": "Al-Bukhârî [Adab Al-Mufrad][761] and Al-Albânî declared its chain Ĥasan in Ŝaĥîĥ Adab Al-Mufrad [585]. What is between the brackets is an extension from Al-Baihaqî [Shu'ab Al-Imân](4/228) through a different way."
                }
            ]
        }
    ]
},
  {
    "category_id": 9,
    "title": "வீடு மற்றும் குடும்பம்",
    "group": [
      {
        "group_id": 2,
        "title": "உடுப்பு அணிந்த போது",
        "duas": [
          {
            "id": 5,
            "group_id": 2,
            "dua": "اَلحَمدُ لِلهِ الَّذِي كَسَانِي هَذَا (الثَّوْبَ) وَرَزَقَنِيهِ مِنْ غَيْرِ حَولٍ مِنِّي وَ لَا قُوَّةٍ",
            "translation": "என்னை இந்த (உடுப்பை) அணியச் செய்ததும், எனக்குத் தரவொன்றும் இல்லாமல் அதை எனக்கு அளித்ததுமான அல்லாஹ்வுக்குப் புகழ்.",
            "reference": "Abû Dâwud [4023], At-Tirmidhî [2458] and Ibn Mâjah [3285]. Also see Irwâ'-ul-Ghalîl (7/47)."
          }
        ]
      },
      {
        "group_id": 3,
        "title": "புதிய உடுப்பு அணிந்த போது",
        "duas": [
          {
            "id": 6,
            "group_id": 3,
            "dua": "اللَّهُمَّ لَكَ الحَمدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشِّرِ مَا صُنِعَ لَهُ",
            "translation": "அல்லாஹ்வே, உனக்கு புகழ். நீயே என்னை இந்த உடுப்பில் ஆடையிட்டாய், அதன் நன்மையையும் அதன் உற்பத்தி காரணத்தையும் கேட்கிறேன், அதன் தீமைக்கும் அதன் உற்பத்தி காரணத்திற்குமான தீமைக்கும் உன்னிடமிருந்து பாதுகாப்புக் கேட்கிறேன்.",
            "reference": "Abû Dâwud [4020] and At-Tirmidhî [1767] and Al-Baghawî. The wording is from Abû Dâwud. Also see Mukhtaŝar Shama'il At-Tirmidhî by Al-Albânî (p. 47)."
          }
        ]
      },
      {
        "group_id": 4,
        "title": "புதிய உடுப்பு அணிந்த ஒருவருக்கு",
        "duas": [
          {
            "id": 7,
            "group_id": 4,
            "dua": "تُبْلِي وَيُخْلِفُ اللهُ تَعَالَى",
            "translation": "நீ அதை மெல்லுப்பாயாக, அல்லாஹ் உங்களுக்கு மறு ஆடையை அளிப்பானாக.",
            "reference": "Abû Dâwud [4020](4/41). Also see Ŝaĥiĥ Abû Dâwud (2/760)."
          },
          {
            "id": 8,
            "group_id": 4,
            "dua": "إِلبَسْ جَدِيداً، وَعِشْ حَمِيداً، وَمُتْ شَهِيداً",
            "translation": "புதியதை அணிந்து கொள், புகழுடன் வாழ்ந்து கொள், மற்றும் துணிவுடன் மரிக்கவும்.",
            "reference": "Ibn Mâjah [3558](2/1178) and Al-Baghawî (12/41). Also see Ŝaĥiĥ Ibn Mâjah (2/275)."
          }
        ]
      },
      {
        "group_id": 5,
        "title": "உடையை கழிப்பதற்கு முன்",
        "duas": [
          {
            "id": 9,
            "group_id": 5,
            "dua": "بِسْمِ اللهِ",
            "translation": "அல்லாஹ்வின் பேரால்.",
            "reference": "At-Tirmidhî [606](2/505) and Sahîh Al-Jâmi' [3210](3/203). Also see Irwâ'-ul-Ghalîl [50]."
          }
        ]
      },
      {
        "group_id": 6,
        "title": "மலக்கூடம் நுழைவதற்கு முன்",
        "duas": [
          {
            "id": 10,
            "group_id": 6,
            "dua": "(بِسْمِ اللهِ) اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ",
            "translation": "(அல்லாஹ்வின் பேரால்) அல்லாஹ்வே, தீமைகளிலிருந்தும் தீமைகள் செய்பவர்களிலிருந்தும் உன்னிடம் பாதுகாப்புக் கேட்கிறேன்.",
            "reference": "Al-Bukhârî [142](1/45) and Muslim [375](1/283). The narration with the extension \"In the name of Allah\" has been collected by Sa'eed bin Manŝoor, see Fatĥ al-Bârî (1/244)."
          }
        ]
      },
      {
        "group_id": 7,
        "title": "மலக்கூடத்தை விட்டு வெளியேறியபோது",
        "duas": [
          {
            "id": 11,
            "group_id": 7,
            "dua": "غُفْرَانَكَ",
            "translation": "உன்னிடமிருந்து மன்னிப்பைக் கேட்கிறேன்.",
            "reference": "At-Tirmidhî [7], Abû Dâwud [30], Ibn Mâjah [300] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][79]."
          }
        ]
      },
      {
        "group_id": 10,
        "title": "வீடு நுழைந்தபோது",
        "duas": [
          {
            "id": 16,
            "group_id": 10,
            "dua": "بِسْمِ اللهِ، تَوَكَّلْتُ عَلَى اللهِ، وَلاَحَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "அல்லாஹ்வின் பெயரால், அல்லாஹ்வில் நம்பிக்கையுடன் இருக்கிறேன், அல்லாஹ்வின் சக்தியில்தான் சக்தியும் வலிமையும் உள்ளது.",
            "reference": "Abû Dâwud [5094](4/325) and At-Tirmidhî [3427](5/490). Also see Ŝaĥiĥ At-Tirmidhî (3/151)."
          },
          {
            "id": 17,
            "group_id": 10,
            "dua": "اللَّهُمَّ إِنَّي أَعْوْذُ بِكَ أَنْ أَضِلَّ، أَوْ أُضِلَّ، أَوْ أَزِلَّ، أُوْ أُزَلَّ أَوْ أَظْلِمَ، أَوْ أُظْلَمَ، أَوْ أَجْهَلَ، أَوْ يُجْهَلَ عَلَيَّ",
            "translation": "அல்லாஹ்வே, நான் வழிதவறவோ அல்லது வழிதவற வைக்கப்படவோ, தவறிச் செல்வோ அல்லது தவற வைக்கப்படவோ, அநியாயம் செய்வோ அல்லது அநியாயம் செய்யப்படவோ, முட்டாள்தனமாக நடந்துகொள்வோ அல்லது முட்டாள்தனமாக நடத்தப்படவோ விடுவதாக உன்னிடம் பாதுகாப்பு கேட்கிறேன்.",
            "reference": "Abû Dâwud [5094], At-Tirmidhî [3427], An-Nisâ'i (8/268) and Ibn Mâjah [3884]. Also see Ŝaĥiĥ At-Tirmidhî (3/152) and Ŝaĥiĥ Ibn Mâjah (2/336)."
          }
        ]
      },
      {
        "group_id": 11,
        "title": "வீட்டைவிட்டுச் செல்வதற்கு முன்",
        "duas": [
          {
            "id": 18,
            "group_id": 11,
            "dua": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللهِ رَبَّنَا تَوَكَّلْنَا",
            "translation": "அல்லாஹ்வின் பெயரால் நுழைகின்றோம், அல்லாஹ்வின் பெயரால் வெளியேறுகிறோம், எங்கள் இறைவனான அல்லாஹ்வில் நம்பிக்கை வைத்து இருக்கின்றோம்.",
            "reference": "Abû Dâwud [5096](4/325) and Shaykh Abdul 'Azîz bin Bâz graded its chain ĥasan in [Tuĥfat al-Akhyâr](28)."
          }
        ]
      },
      {
        "group_id": 45,
        "title": "பிசாசின் வார்த்தைகளையும் அவனது தீய உத்திகளையும் துரத்துவதற்காக",
        "duas": [
          {
            "id": 141,
            "group_id": 45,
            "dua": "الاسْتِعَاذَةُ بِاللهِ مِنْهُ",
            "translation": "அல்லாஹ்விடம் அவனிடமிருந்து பாதுகாப்பைக் கேளுங்கள்.",
            "reference": "Abû Dâwud (1/206) and At-Tirmidhî. Also see Ŝaĥîĥ At-Tirmidhî (1/77)."
          },
          {
            "id": 142,
            "group_id": 45,
            "dua": "الأذَانُ",
            "translation": "அதான் (துஆ அழைப்பு).",
            "reference": "Al-Bukhârî [608](1/151) and Muslim [389](1/291)."
          },
          {
            "id": 143,
            "group_id": 45,
            "dua": "الأذْكَارُ وَ قِراءَةُ القُرْآنِ",
            "translation": "நினைவுத் துஆக்களும் குர்ஆன் பாராயணமும்.",
            "reference": "Muslim [780](1/539)."
          }
        ]
      },
      {
        "group_id": 79,
        "title": "புதிதாக திருமணம் ஆனவருக்கு",
        "duas": [
          {
            "id": 190,
            "group_id": 79,
            "dua": "بَارَكَ اللّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
            "translation": "அல்லாஹ் உங்களுக்கு ஆசீர்வதிப்பானாக, உங்களுக்கு அருள் புரிவானாக, உங்களை நன்மையில் ஒன்றிப்பானாக.",
            "reference": "Abû Dâwud [2130], At-Tirmidhî [1091], and Ibn Mâjah [1905]. Also see Ŝaĥîĥ Ibn Mâjah (1/324)."
          }
        ]
      },
      {
        "group_id": 81,
        "title": "பாலியல் உறவிற்கு முன்",
        "duas": [
          {
            "id": 192,
            "group_id": 81,
            "dua": "بِسْمِ اللهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطانَ مَا رَزَقْتَنَا",
            "translation": "அல்லாஹ்வின் பெயரால், அல்லாஹ்வே, நம்மிடமிருந்து பிசாசை விலக்கி வைத்துவிடு, மற்றும் நம்மால் அருளப்பெற்றதை பிசாசிடமிருந்து பாதுகாத்து விடு.",
            "reference": "Al-Bukhârî [3271](6/141) and Muslim [1434](2/1028)."
          }
        ]
      },
      {
        "group_id": 125,
        "title": "ஒருவரது கண்கள் நன்மையைப் பார்த்துவிடாமல் செய்ய",
        "duas": [
          {
            "id": 244,
            "group_id": 125,
            "dua": "اللَّهُمَّ بَارِك عَلَيْهِ",
            "translation": "உங்கள் சகோதரர், உங்களோ அல்லது உங்கள் செல்வத்திலோ நீங்கள் ஆர்வமாகக் காணும் எந்தவொரு விஷயத்தையும் பார்த்தால், அதற்காக ஆசீர்வாதம் கேளுங்கள், ஏனெனில் தீய கண் உண்மையானது.",
            "reference": "Aĥmad (4/447), Ibn Mâjah [3509] and Mâlik [1697-1698]. Al-Albânî authenticated it in Ŝaĥîĥ Al-Jâmi' [556](1/212). Also see research of Zâd al-Ma'âd by Al-Arnâ'ûť."
          }
        ]
      },
      {
        "group_id": 128,
        "title": "விறுமுறும் பிசாசுகளைத் தவிர்க்க துஆக்கள்",
        "duas": [
          {
            "id": 247,
            "group_id": 128,
            "dua": "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ، الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ ولَا فَاجِرٌ مِنْ شَرِّ مَا خَلقَ، وبَرَأَ وذَرَأَ، ومِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وِمنْ شَرِّ مَا يَعْرُجُ فِيْهَا، ومِنْ شَرِّ مَا ذَرَأَ فِي الأَرْضِ، ومِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وِمنْ شَرِّ فِتَنِ اللَّيْلِ والنَّهَارِ، ومِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقاً يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
            "translation": "நற்குணமுடையவனோ தீயவனோ தாண்டிக்கொள்ள முடியாத அல்லாஹ்வின் முழுமையான வார்த்தைகளின் படியில் நான் பாதுகாப்புக் கேட்கிறேன், அவன் படைத்த அனைத்து தீமைகளிலிருந்தும், வானத்தில் இருந்து இறங்கும் தீமைகளிலிருந்தும், வானத்தில் ஏறிச் செல்லும் தீமைகளிலிருந்தும், பூமியில் பரவியுள்ள தீமைகளிலிருந்தும், பூமியில் இருந்து கிளம்பி வரும் தீமைகளிலிருந்தும், இரவும் பகலும் வரும் சோதனைகளிலிருந்தும், இரவின் வேளை வரும் தீயவர்களிலிருந்தும் பாதுகாப்புக் கேட்கிறேன். (நன்மையுடன் வரும்) ஒருவனிடம் இருந்து தவிர வேறு யாரிடமும் இல்லை.",
            "reference": "Aĥmad (3/419) with a Ŝaĥîĥ chain, Ibn As-Sunnî [637]. Al-Arnâ'ûť declared its chain Ŝaĥîĥ in his research of Ať-Ťaĥawiyyah (pg. 133). Also see Majma' Az-Zawâ'id (10/127)."
          }
        ]
      },
      {
        "group_id": 132,
        "title": "பொதுவான மற்றும் பயனுள்ள விதிமுறைகள்",
        "duas": [
          {
            "id": 267,
            "group_id": 132,
            "dua": "إذَا كَانَ جُنْحُ اللَّيْل – أوْ أمْسَيْتُم – فَكُفُّوا صِبْيَانَكُمْ؛ فَإنَّ الشَّيَاطِيْنَ تَنْتَشِرُ حِيْنَئَذٍ، فَإذَا ذَهَبَ سَاعَةٌ مِنَ اللَّيْلِ فَخَلُّوهُمْ، وَأغْلقُوا الأبْوَابَ، وَاذْكُرُوا اسْمَ اللهِ؛ فَإنَّ الشَّيْطَانَ لَا يَفْتَحُ بَابًا مُغْلَقًا، وَ أوْكُوا قِرَبَكُمْ، وَاذْكُرُوا اسْمَ اللهِ، وَ خَمِّرُوا آنِيَتَكُمْ وَاذْكُرُوا اسْمَ اللهِ، وَ لَوْ أنْ تَعْرِضُوا عَلَيْهَا شَيْئًا، وَ أطْفِئُوا مَصَابِيْحَكُمْ",
            "translation": "இரவு இறங்கும் போது உங்கள் குழந்தைகளை வீட்டுக்குள் தடுத்து வைக்கவும், ஏனெனில் அப்போது பிசாசுகள் பரவுகின்றன. சிறிது நேரம் கழித்து அவர்களை வெளியே அனுமதிக்கவும். உங்கள் கதவுகளை மூடிவிடவும், அல்லாஹ்வின் பெயரைச் சொல்லுங்கள், ஏனெனில் பிசாசு ஒரு மூடப்பட்ட கதவைத் திறக்கமாட்டான். உங்கள் நீர்குடிகளை அடைத்து, அல்லாஹ்வின் பெயரைச் சொல்லுங்கள். உங்கள் பாத்திரங்களை மூடவும், அல்லாஹ்வின் பெயரைச் சொல்லுங்கள், ஒரு பொருளைக் கூட அதை மூட பயன்படுத்துங்கள், உங்கள் விளக்குகளை அணைக்கவும்.",
            "reference": "Al-Bukhârî [5623](10/88) and Muslim [2012](3/1595)."
          }
        ]
      }
    ]
  },
  {
    "category_id": 10,
    "title": "உணவு மற்றும் பானம்",
    "group": [
        {
            "group_id": 68,
            "title": "விருதுப்பெற்ற பிறகு",
            "duas": [
                {
                    "id": 176,
                    "group_id": 68,
                    "dua": "ذَهَبَ الظَّمَأُ، وَابْتَلَّتِ العُرُوقُ، وَثَبَتَ الأجْرُ إِنْ شَاءَ اللهُ",
                    "translation": "பின்பு தாகம் போய்விடுகிறது, மற்றும் இரத்தக்கூட்டுகள் தீர்ந்து விடுகின்றன, மற்றும் வெகுமதி உறுதி செய்யப்படுகிறது, அல்லாஹ் விரும்பினால்.",
                    "reference": "Abû Dâwud [2357](2/306). Also see Ŝaĥîĥ Al-Jâmi' [4678](4/209)."
                },
                {
                    "id": 177,
                    "group_id": 68,
                    "dua": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِرَحْمَتِكَ الَّتِي وَسِعَتْ كُلَّ شَيْءٍ، أَنْ تَغْفِرَ لِي",
                    "translation": "ஓ அல்லாஹா, நீ என்னுடைய பாவங்களை மன்னிக்க, எல்லா விஷயங்களையும் அடக்கும் உன் பரிவுக்காக நான் உன்னை வேண்டுகிறேன்.",
                    "reference": "Ibn Mâjah [1753](1/557) and Al-Hâfiž declared it Ĥasan in this takhrîj of Al-Athkâr. Also see Sharĥ Al-Athkâr (4/342)."
                }
            ]
        },
        {
            "group_id": 69,
            "title": "உணவு உண்ணும் முன்னர்",
            "duas": [
                {
                    "id": 178,
                    "group_id": 69,
                    "dua": "بِسْمِ اللهِ (في أَوَّلِهِ وَآخِرِهِ)",
                    "translation": "அல்லாஹாவின் பெயரில் (அதன் தொடக்கம் மற்றும் முடிவில்)*.",
                    "reference": "* உணவுக்குமுன் நீங்கள் இந்த துவாவைப் படிக்க மறந்தால், உணவுக்குப் பிறகு இதைப் படிக்க வேண்டும். Abû Dâwud [3767](3/347) and At-Tirmidhî [1858](4/288). Also see Ŝaĥîĥ At-Tirmidhî (2/167)."
                },
                {
                    "id": 179,
                    "group_id": 69,
                    "dua": "(١) اللَّهُمَّ بَارِكْ لَنَا فِيْهِ، وَأَطْعِمْنَا خَيْراً مِنْهُ(٢) اللَّهُمَّ بَارِكْ لَنَا فِيْمَا رَزَقْتَهُمْ، وَزِدْنَا مِنْهُ",
                    "translation": "(1) 'ஓ அல்லாஹா, இதற்கு நன்மை செய் மற்றும் நமக்கு இதற்கு மேலாக உணவு அளி.'மட்டும் பால் கொடுக்கப்பட்டால், இதற்குப் பதிலாக இதைப் படிக்கவும்:(2) 'ஓ அல்லாஹா, இதற்கு நன்மை செய் மற்றும் இதற்கு மேலும் கொடு.'",
                    "reference": "Abû Dâwud [3767] and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][282]. Al-Albânî declared it weak, see Al-Kalam Ať-Ťayyib [184]."
                }
            ]
        },
        {
            "group_id": 70,
            "title": "உணவு முடித்த பிறகு",
            "duas": [
                {
                    "id": 180,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هـَذَا، وَرَزَقَنِيْهِ، مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
                    "translation": "என்னை இது உணவளித்த மற்றும் அதை எனக்கு வழங்கிய அல்லாஹா. என்னால் அதை செய்யும் எந்த பலத்தினையும் இல்லாமல். ",
                    "reference": "Abû Dâwud [4023], At-Tirmidhî [3458] and Ibn Mâjah [3285]. Also see Ŝaĥîĥ At-Tirmidhî (3/159)."
                },
                {
                    "id": 181,
                    "group_id": 70,
                    "dua": "الْحَمْدُ لِلَّهِ حَمْداً كَثِيْراً طَيِّباً مُبَارَكاً فِيْهِ، غَيْرَ [مَكْفِيٍّ وَلَا] مُوَدَّعٍ، وَلَا مُسْتَغْنىً عَنْهُ رَبُّنَا",
                    "translation": "அல்லாஹா நிறைந்த நல்வாழ்வுடன், ஒருபோதும் நிறைய உள்ள மாலிக்கையோடு, மறுபடியும் இருந்து செல்லக்கூடிய இல்லாமல், நாங்கள் கடவுளே.",
                    "reference": "Al-Bukhârî [5458](6/214) and At-Tirmidhî [3456](5/507) and the wording is his."
                }
            ]
        },
        {
            "group_id": 71,
            "title": "அழைப்புக்கு வந்த விருந்தினரின் மாமே",
            "duas": [
                {
                    "id": 182,
                    "group_id": 71,
                    "dua": "اللَّهُمَّ بَارِكْ لَهُمْ فِيْمَا رَزَقْتَهُمْ، وَاغْفِرْ لَهُمْ، وَارْحَمْهُمْ",
                    "translation": "ஓ அல்லாஹா, நீ அவர்களுக்கு வழங்கியதை ஆசீர்வதிக்கவும், அவர்களை மன்னிக்கவும் மற்றும் அவர்களுக்கு தயவு செய்க.",
                    "reference": "Muslim [2042](3/1615)."
                }
            ]
        },
        {
            "group_id": 72,
            "title": "ஒரு பானத்தை வழங்கும் ஒருவர் அல்லது அதை செய்வதற்கு திட்டமிடும் ஒருவருக்காக",
            "duas": [
                {
                    "id": 183,
                    "group_id": 72,
                    "dua": "اللَّهُمَّ أَطْعِمْ مَنْ أَطْعَمَنِي، وَاسْقِ مَنْ سَقَانِي",
                    "translation": "ஓ அல்லாஹா, எனக்கு உணவளித்தவருக்கு உணவளிக்கவும், எனக்கு பானமளித்தவருக்கு பானம் அளிக்கவும்.",
                    "reference": "Muslim [2055](3/1626)."
                }
            ]
        },
        {
            "group_id": 73,
            "title": "ஓர் ஒருவரின் இல்லத்தில் விருதுப்பெற்று உட்கார்ந்த போது",
            "duas": [
                {
                    "id": 184,
                    "group_id": 73,
                    "dua": "أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ، وَأَكَلَ طَعَامَكُمُ الأبْرَارُ، وَصَلَّتْ عَلَيْكُمُ المَلائِكَةُ",
                    "translation": "உங்கள் இல்லத்தில் விருது பெறும் ரேசின்கள், மற்றும் பொது மற்றும் கற்பனை செய்யும் தகுதியானவர்கள் உங்கள் உணவை உண்பவராகவும், மற்றும் மாலைகளை உங்களுக்கு ஆசியளிக்கின்றன.",
                    "reference": "Abû Dâwud [3854](3/367), Ibn Mâjah [1747](1/556) and An-Nisâ'i ['Amal al-Yawm wa al-Laylah][296-298]. Al-Albânî authenticated it in Ŝaĥîĥ Abû Dâwud (2/730)."
                }
            ]
        },
        {
            "group_id": 74,
            "title": "ஒரு விருதுக்கானப் பண்பான உணவை வழங்கும்போது",
            "duas": [
                {
                    "id": 185,
                    "group_id": 74,
                    "dua": "إذَا دُعِيَ أحَدُكُمْ فَلْيُجِبْ، فَإنْ كَانَ صَائِمًا فَلْيُصَلِّ، وَ إنْ كَانَ مُفْطِراً فَلْيَطْعَمْ (وَ مَعنَى فَلْيُصَلِّ؛ أيْ: فَلْيَدْعُ)",
                    "translation": "நீங்கள் ஒரு உணவுக்கு அழைக்கப்படுகிறீர்கள் என்றால், அதை ஏற்றுக்கொள்ளுங்கள். நீங்கள் விருது பெறுகிறீர்கள் என்றால், (அங்கு உள்ளவர்களுக்கு) உழைக்கும் நோக்கத்தில் இருங்கள். நீங்கள் விருது பெறவில்லை என்றால், உண்பதற்கான வாய்ப்பு உள்ளார் (அந்த 'பாராட்டுவதற்கு' என்ற அர்த்தம், 'விருது வழங்குவது').",
                    "reference": "Muslim [1431](2/1054)."
                }
            ]
        }
    ]
},
  {
    "category_id": 11,
    "title": "நோய் மற்றும் மரணம்",
    "group": [
      {
        "group_id": 48,
        "title": "குழந்தைகளை அல்லாஹ்வின் பாதுகாப்பில் வைப்பது",
        "duas": [
          {
            "id": 146,
            "group_id": 48,
            "dua": "أُعِيْذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ، مِنْ كُلِّ شَيْطَانٍ وَهـَامَّةٍ، وَمِنْ كُلِّ عَيْنٍ لامَّةٍ",
            "translation": "நான் உங்களை, அல்லாஹ்வின் முழுமையான வார்த்தைகளால், ஒவ்வொரு பிசாசும் விஷவிலங்குகளிலிருந்தும், ஒவ்வொரு தீய கண்களிலிருந்தும் பாதுகாக்க செய்கிறேன்.",
            "reference": "Al-Bukhârî [3371](4/119)."
          }
        ]
      },
      {
        "group_id": 49,
        "title": "நோயாளியைப் பார்க்கச் செல்லும் போது",
        "duas": [
          {
            "id": 147,
            "group_id": 49,
            "dua": "لَا بأْسَ طَهُورٌ إِنْ شَاءَ اللهُ",
            "translation": "பரவாயில்லை, இது (நோய்) ஒரு பரிசுத்தமாக்கல் ஆகட்டும், அல்லாஹ் விரும்பினால்.",
            "reference": "Al-Bukhârî [3616](10/118)."
          },
          {
            "id": 148,
            "group_id": 49,
            "dua": "أَسْأَلُ اللهَ العَظِيْمَ، رَبَّ العَرْشِ العَظِيْمِ، أَنْ يَشْفِيَكَ [سَبْعَ مَرَّاتٍ]",
            "translation": "நான் மேன்மையான அல்லாஹ்வை, மகத்தான அரியாணையின் இறைவனை, உங்களுக்கு குணமளிக்க வேண்டுகிறேன். (ஏழு முறை)",
            "reference": "At-Tirmidhî [2083] and Abû Dâwud [3106]. Also see Ŝaĥîĥ At-Tirmidhî (2/210) and Ŝaĥîĥ Al-Jâmi' [5766](5/180)."
          }
        ]
      },
      {
        "group_id": 50,
        "title": "நோயாளியைப் பார்க்கச் செல்வது சிறந்தது",
        "duas": [
          {
            "id": 149,
            "group_id": 50,
            "dua": "إذَا عَادَ الرَّجُلُ أخَاهُ المُسْلِمَ، مَشَى فِي خِرَافَةِ الجَنَّةِ حَتَّى يَجْلِسَ، فَإذَا جَلَسَ غَمَرَتْهُ الرَّحْمَةُ،  فَإنْ كَانَ غُدْوَةً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُمْسِيَ، و إنْ كَانَ مَسَاءً صَلَّى عَلَيْهِ سَبْعُونَ ألْفَ مَلَكٍ حَتَّى يُصْبِحَ",
            "translation": "ஒரு மனிதன் தனது நோயுற்ற முஸ்லிம் சகோதரரை பார்க்கச் சென்றால், அவன் கண்ணியத்தின் கனியினை அறுவடை செய்து செல்கின்றான், அவன் அமர்ந்ததும் அவன் மீது கருணை பொழிகின்றது, இது காலை நேரத்தில் என்றால், எழுபது ஆயிரம் தெய்வத்தூதர்கள் அவனுக்கு மாலை வரை பிரார்த்திக்கின்றனர், மாலை நேரத்தில் என்றால், எழுபது ஆயிரம் தெய்வத்தூதர்கள் அவனுக்கு காலை வரை பிரார்த்திக்கின்றனர்.",
            "reference": "At-Tirmidhî [969], Ibn Mâjah [1442] and Aĥmad (1/97). Also see Ŝaĥîĥ Ibn Mâjah (1/244) and Ŝaĥîĥ At-Tirmidhî (1/286). Shaykh Aĥmad Shâkir also authenticated it."
          }
        ]
      },
      {
        "group_id": 51,
        "title": "நோயாளி வாழ்க்கையை இழக்கும் எதிர்பார்ப்பின் போது",
        "duas": [
          {
            "id": 150,
            "group_id": 51,
            "dua": "اللَّهُمَّ اغْفِرْ لي، وَارْحَمْنِي، وَأَلْحِقْنِي بِالرَّفِيْقِ الأعْلَى",
            "translation": "அல்லாஹ்வே, என்னை மன்னித்து, எனக்கு கருணை செய்துவிடு, என்னை உயர்ந்த தோழர்களுடன் ஒன்றிப்பாயாக.",
            "reference": "Al-Bukhârî [4440](7/10) and Muslim [2444](4/1893)."
          },
          {
            "id": 151,
            "group_id": 51,
            "dua": "لَا إِلَهَ إِلَّا اللهُ، إِنَّ لِلْمَوْتِ لَسَكَرَاتٍ",
            "translation": "அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை, மரணம் நிச்சயமாக வேதனையினைக் கொண்டுள்ளது.",
            "reference": "Al-Bukhârî [4449](8/144)."
          },
          {
            "id": 152,
            "group_id": 51,
            "dua": "لَا إلَهَ إلَّا اللهُ وَاللهُ أَكْبَرُ، لَا إلَهَ إلَّا اللهُ وحْدَهُ، لَا إلَهَ إلَّا اللهُ وَحْدَهُ لَا شَرِيْكَ لهُ، لَا إلَهَ إلَّا اللهُ لَهُ المُلْكُ ولَهُ الحَمْدُ، لَا إلَهَ إلَّا اللهُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ",
            "translation": "அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை, அல்லாஹ் மிகப்பெரியவர். அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை, அவரின் கூட்டாளியில்லை. அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை, அவருக்கு எல்லா அதிகாரமும் புகழும் உள்ளது. அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை, அல்லாஹ்வின் உதவி மற்றும் வலிமையால் மட்டுமே எல்லாம் சாத்தியம்.",
            "reference": "At-Tirmidhî [3430] and Ibn Mâjah [3794]. Al-Albânî authenticated it. Also see Ŝaĥîĥ At-Tirmidhî (3/152) and Ŝaĥîĥ Ibn Mâjah (2/317)."
          }
        ]
      },
      {
        "group_id": 52,
        "title": "இறக்கும் நிலைக்கு அடையவாருக்கு உள்ள அறிவுறுத்தல்",
        "duas": [
          {
            "id": 153,
            "group_id": 52,
            "dua": "لَا إلَهَ إلَّا اللهُ",
            "translation": "அல்லாஹ்வைத் தவிர வணக்கத்திற்குரியவர் எவரும் இல்லை எனும் கடைசி வார்த்தையைச் சொல்வார், அவர் சொர்க்கத்தில் நுழைவார்.",
            "reference": "Abû Dâwud [3116](3/190). Also See Ŝaĥîĥ Al-Jâmi' [6479](5/432)."
          }
        ]
      },
      {
        "group_id": 54,
        "title": "இறந்தவரின் கண்களை மூடும் போது",
        "duas": [
          {
            "id": 155,
            "group_id": 54,
            "dua": "اللَّهُمَّ اغْفِرْ لِفُلانٍ (باسْمِهِ)، وَارْفَعْ دَرَجَتَهُ في المَهْدِيِّيْنَ، وَاخْلُفْهُ في عَقِبِهِ في الغَابِرِيْنَ، وَاغْفِرْ لَنَا وَلَهُ يَا رَبَّ العَالَمِيْنَ، وَافْسَحْ لَهُ في قَبْرِهِ وَنَوِّرْ لَهُ فِيْهِ",
            "translation": "அல்லாஹ்வே, (இறந்தவரின் பெயர்) அவரை மன்னித்து, அவரது நிலையை வழிகாட்டப்பட்டவர்களுடன் உயர்த்துவாயாக, அவரது குடும்பத்திற்கு நீ வாரிசாக இருந்து, எங்களுக்கும் அவருக்கும் மன்னிப்பு வழங்குவாயாக, எங்கள் உலகின் இறைவா, அவரது கல்லறையை விசாலமாக்கி, அதில் ஒளியை தருவாயாக.",
            "reference": "Muslim [920](2/634)."
          }
        ]
      },
      {
        "group_id": 55,
        "title": "இறந்தவருக்கு ஜனாஸா பிரார்த்தனையில்",
        "duas": [
          {
            "id": 156,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعافِهِ، وَاعْفُ عَنْهُ، وَأَكْرِمْ نُزُلَهُ، وَوَسِّعْ مُدْخَلَهُ، وَاغْسِلْهُ بِالْمَاءِ وَالثَّـلْجِ وَالْبَرَدِ، وَنَقِّهِ مِنَ الْخَطَايَا كَمَا نَقَّيْتَ الثَّوْبَ الأَبْيَضَ مِنَ الدَّنَسِ، وَأَبْدِلْهُ داراً خَيْراً مِنْ دَارِهِ، وَأَهْلاً خَيْراً مِنْ أَهْلِهِ، وَزَوْجَاً خَيْراً مِنْ زَوْجِهِ، وَأَدْخِلْهُ الْجَنَّةَ، وَأَعِذْهُ مِنْ عَذَابِ القَبْرِ(وَ عَذَابِ النَّارِ)",
            "translation": "அல்லாஹ்வே, அவரை மன்னித்து, அவருக்கு கருணை செய்துவிடு, அவரை பரிசுத்தமாக்கி, அவரைத் தள்ளிவிடு, அவரை கௌரவமாக வரவேற்று, அவரது நுழைவாயிலை விசாலமாக்கி, அவரை நீரால், பனியால், குளிரால் சுத்திகரித்து, அவரது பாவங்களைப் பரிசுத்தமாக்கி, அவரது வீட்டை விட சிறந்த வீட்டையும், அவரது குடும்பத்தை விட சிறந்த குடும்பத்தையும், அவரது மனைவியை விட சிறந்த மனைவியையும் கொடுக்கவும், அவரை சொர்க்கத்தில் நுழையச் செய்யவும், அவரது கல்லறையின் தண்டனை மற்றும் நரகத்தின் வேதனையில் இருந்து அவரை காப்பாற்றவும்.",
            "reference": "Muslim [963](2/663)."
          },
          {
            "id": 157,
            "group_id": 55,
            "dua": "اللَّهُمَّ اغْفِرْ لِحَيِّنَا، وَمَيِّتِنَا، وَشَاهِدِنَا، وَغَائِبِنَا، وَصَغِيْرِنَا، وَكَبِيْرِنَا، وَذَكَرِنَا، وَأُنْثَانَا، اللَّهُمَّ مَنْ أَحْيَيْتَهُ مِنَّا فَأَحْيِهِ عَلَى الإِسْلامِ، وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ، اللَّهُمَّ لَا تَحْرِمْنَا أَجْرَهُ، وَلَا تُضِلَّنَا بَعْدَهُ",
            "translation": "அல்லாஹ்வே, எங்கள் உயிரோடு உள்ளவர்களையும் இறந்தவர்களையும், எங்கள் முன்னால் உள்ளவர்களையும் பின்பு உள்ளவர்களையும், எங்கள் சிறியவர்களையும் பெரியவர்களையும், எங்கள் ஆண்களையும் பெண்களையும் மன்னித்துவிடு. அல்லாஹ்வே, எங்களில் யாரை நீ வாழவைக்கின்றாயோ, அவர்களை இஸ்லாமில் வாழவையாக்கு, எங்களில் யாரை நீ இறக்கவைக்கின்றாயோ, அவர்களை ஈமான் நிலையில் இறக்கவையாக்கு. அல்லாஹ்வே, அவரின் நன்மையை நமக்குத் தர மறக்காதே, அவருக்குப் பிறகு நம்மை வழிதவறவிடாதே.",
            "reference": "Ibn Mâjah [1498](1/480), Abû Dâwud [3201], At-Tirmidhî [1024], An-Nisâ'i [1988] and Aĥmad (2/368). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 158,
            "group_id": 55,
            "dua": "اللَّهُمَّ إِنَّ فُلانَ بْنَ فُلانٍ في ذِمَّتِكَ، وَحَبْلِ جِوارِكَ، فَقِهِ مِنْ فِتْنَةِ الْقَبْرِ وَعَذَابِ النَّارِ، وَأَنْتَ أَهْلُ الْوَفاءِ وَالْحَقِّ، فَاغْفِرْ لَهُ، وَارْحَمْهُ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ",
            "translation": "அல்லாஹ்வே, (இறந்தவர் பெயர்) உங்களின் பாதுகாப்பிலும் காப்பிலுமிருக்கிறார். அவரை கல்லறையின் சோதனை மற்றும் நரகத்தின் தண்டனையிலிருந்து காப்பாற்றுவாயாக. நீ தான் உண்மைக்கும் நம்பிக்கைக்கும் உரியவர். அவரை மன்னித்து, அவருக்கு கருணை செய்வாயாக, நீ தான் மன்னிப்பின் கடவுளும், மிகப் பெரும் கருணையுடையவனும்.",
            "reference": "Ibn Mâjah [1499] and Abû Dâwud (3/211). Also see Ŝaĥîĥ Ibn Mâjah (1/251)."
          },
          {
            "id": 159,
            "group_id": 55,
            "dua": "اللَّهُمَّ عَبْدُكَ وَابْنُ أَمَتِكَ، احْتَاجَ إِلى رَحْمَتِكَ، وَأَنْتَ غَنِيٌّ عَنْ عَذَابِهِ، إِنْ كَانَ مُحْسِناً فَزِدْ في حَسَنَاتِهِ، وَإِنْ كَانَ مُسِيْئاً فَتَجَاوَزْ عَنْهُ",
            "translation": "அல்லாஹ்வே, உம்முடைய அடிமை மற்றும் உம்முடைய பெண்மாடாளியின் மகன், உம்முடைய கருணையைத் தேவைப்படுகிறது, நீ அவரைத் தண்டிக்க தேவையற்றவன். அவர் நல்லவராக இருந்தால் அவரது நன்மைகளை அதிகரித்து, அவர் தவறாக இருந்தால் அவரது தவறுகளை மன்னித்துவிடு.",
            "reference": "Al-Hâkim (1/359 )and he authenticated it and Adh-Dhahabî agreed with him. Also see Aĥkâm Al-Janâ'iz by Al-Albânî (pg. 125)."
          }
        ]
      },
      {
        "group_id": 56,
        "title": "இறந்தவர் குழந்தையாக இருந்தால், ஜனாஸா பிரார்த்தனையில்",
        "duas": [
          {
            "id": 160,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ فَرَطاً وَذُخْراً لِوالِدَيْهِ، وَشَفِيْعاً مُجَاباً، اللَّهُمَّ ثَقِّلْ بِهِ مَوَازِيْنَهُمَا، وَأَعْظِمْ بِهِ أُجـُورَهُمَا، وَأَلْحِقْهُ بِصَالِحِ المُؤْمِنِيْنَ، وَاجْعَلْهُ في كَفَالَةِ إِبْرَاهـِيْمَ، وَقِهِ بِرَحْمَتِكَ عَذَابَ الْجَحِيْمِ، و أبْدِلْهُ دَاراً خَيْراً مِنْ دَارِهِ، و أهْلاً خَيْراً مِنْ أهْلِهِ، اللهم اغْفِرْ لأسْلاَفِنَا، وَ أفْرَاطِنَا، وَ مَنْ سَبَقَنَا باِلإيْمَانِ",
            "translation": "அல்லாஹ்வே, அவரை அவருடைய பெற்றோருக்கு முன்னரே வழங்கப்பட்ட பரிசாகவும், பாதுகாக்கப்பட்ட செல்வமாகவும், வாதிடப்படும் மன்னிப்பாகவும் ஆக்கிவிடு. அல்லாஹ்வே, அவரின் மூலம் பெற்றோரின் தராசுகளை கனமாக்கி, அவர்களுடைய நன்மைகளை அதிகமாக்கி, அவரை நல்லொழுக்கம் கொண்ட விசுவாசிகளுடன் ஒன்றிணைத்து, அவரை இப்ராஹீம் நபியின் பாதுகாப்பில் வைப்பாயாக. அவரை உமது கருணையால் நரகத்தின் வேதனையிலிருந்து காப்பாற்றுவாயாக. அவருக்குத் தரமான வீடு மற்றும் நல்ல குடும்பத்தை வழங்குவாயாக. அல்லாஹ்வே, எங்கள் முன்னோர்கள், எங்கள் தலைமுறைகள், எங்கள் முன்னால் உள்ள விசுவாசிகளுக்கு மன்னிப்பு வழங்குவாயாக.",
            "reference": "See Al-Mughnî by Ibn Qudâmah (3/416) and Ad-Durûs Al-Muhimmah Li'âmah Al-Ummah by Shaykh Ibn Bâz (pg. 15)."
          },
          {
            "id": 161,
            "group_id": 56,
            "dua": "اللَّهُمَّ اجْعَلْهُ لَنَا فَرَطاً، وَسَلَفاً، وَأَجْراً",
            "translation": "அல்லாஹ்வே, அவரை நமக்கு முன்னரே வழங்கப்பட்ட பரிசாகவும், முன்னோர்களாகவும், நன்மையாகவும் ஆக்கிவிடு.",
            "reference": "Al-Baghawî [Sharĥ As-Sunnah](5/357)."
          }
        ]
      },
      {
        "group_id": 57,
        "title": "ஆறுதல் கூறுதல்",
        "duas": [
          {
            "id": 162,
            "group_id": 57,
            "dua": "إِنَّ لِلَّهِ مَا أَخَذَ، وَلَهُ مَا أَعْطَى، وَكُلُّ شَيءٍ عِنْدَهُ بِأَجَلٍ مُسَمَّىً...فَلْتَصْبِرْ وَ لْتَحْتَسِبْ",
            "translation": "நிச்சயமாக, அல்லாஹ்வுக்கே அவர் எடுத்தது சொந்தமானது, அவருக்கே அவர் கொடுத்தது சொந்தமானது, எல்லாவற்றிற்கும் ஒரு காலக்கெடு உள்ளது. (அதனால்) நீ பொறுத்து விடு, அதற்குத் தூய நியாயத்தை விரும்பு.",
            "reference": "Al-Bukhârî [1284](2/80) and Muslim [923](2/636)."
          }
        ]
      },
      {
        "group_id": 58,
        "title": "இறந்தவரை கல்லறையில் வைக்கும் போது",
        "duas": [
          {
            "id": 163,
            "group_id": 58,
            "dua": "بِسْمِ اللهِ، وَعَلَى سُنَّةِ رَسُولِ اللهِ",
            "translation": "அல்லாஹ்வின் பெயரில் மற்றும் அல்லாஹ்வின் தூதரின் சுன்னாவின் படி.",
            "reference": "Abû Dâwud [3213](3/314) with a Ŝaĥîĥ chain and Aĥmad (2/40) with the phrase: (بسم الله و على ملة رسول الله) and its chain is Ŝaĥîĥ."
          }
        ]
      },
      {
        "group_id": 59,
        "title": "இறந்தவரை அடக்கம் செய்த பின்",
        "duas": [
          {
            "id": 164,
            "group_id": 59,
            "dua": "اللَّهُمَّ اغْفِرْ لَهُ، اللَّهُمَّ ثَبِّتْهُ",
            "translation": "அல்லாஹ்வே, அவரை மன்னித்து, அவரை நிலைநாட்டிவிடு.",
            "reference": "Abû Dâwud [3221](3/315) and Al-Hâkim (1/370) and he authenticated it and Adh-Dhahabî agreed with him."
          }
        ]
      },
      {
        "group_id": 60,
        "title": "கல்லறைகளைப் பார்வையிடும் போது",
        "duas": [
          {
            "id": 165,
            "group_id": 60,
            "dua": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ، مِنَ المُؤْمِنِيْنَ، وَالْمُسْلِمِيْنَ، وَإِنَّا إِنْ شَاءَ اللهُ بِكُمْ لَاحِقُونَ، [وَ يَرْ حَمُ اللهُ المُسْتَقْدِمِيْنَ مِنَّا وَ المُسْتَأخِرِيْنَ] أسْألُ اللهَ لَنَا وَلَكُمْ العَافِيَةَ",
            "translation": "நிம்மதியே உங்கள்மீது நிலவுக! ஓ கல்லறையின் குடியிருப்பர்களே! விசுவாசிகளிலும் முஸ்லிம்களிலும் இருந்து. நிச்சயமாக, நாங்களும் விரைவில் உங்களுடன் இணைய இருக்கின்றோம், அல்லாஹ் விரும்பினால். நாங்கள் அல்லாஹ்விடம் நமக்கும் உங்களுக்கும் நன்மையை வேண்டுகின்றோம்.",
            "reference": "Muslim [975](2/671) and Ibn Mâjah [1547](1/494) and the wording is his. What is between the brackets is from the hadith of 'Â'ishah collected by Muslim [974](2/671)."
          }
        ]
      },
      {
        "group_id": 124,
        "title": "உடலில் வலியை உணரும்போது",
        "duas": [
          {
            "id": 243,
            "group_id": 124,
            "dua": "بِسْمِ اللهِ (ثَلاثاً)أَعُوذُ بِاللهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ.(سَبْعَ مَرَّاتٍ)",
            "translation": "மூன்று முறை 'அல்லாஹ்வின் பெயரால்' சொல்லவும், பின்னர் 'எனக்கு ஏற்படும் தீமையிலிருந்து அல்லாஹ்விடம் மற்றும் அவரது சக்தியில் நம்பிக்கை கொண்டு பாதுகாப்பு தேடுகிறேன்' என்று ஏழு முறை சொல்லவும்.",
            "reference": "Muslim [2202](4/1728)."
          }
        ]
      }
    ]
  }
]