[
    {
        "title": "المد الطبيعي (مد أصلي)",
        "description": "تركز هذه الدرسة على المد الأصلي أو المد الطبيعي، الذي يحدث مع حروف معينة ويُعتبر أساسياً للنطق الصحيح في علم التجويد. سيتعلم المتعلمون متى وكيف يطبقون المد الأصلي، مما يعزز طلاقتهم في تلاوة القرآن الكريم."
    },
    {
        "title": "المد الممتد (مد طويل)",
        "description": "في هذا الدرس، سيستكشف الطلاب مفهوم المد الطويل جداً، الذي يمدد الصوت الحركي لفترة أطول. ستغطي الدورة القواعد المتعلقة باستخدامه وتقدم تمارين عملية لمساعدة المتعلمين على إتقان هذه التقنية المتقدمة."
    },
    {
        "title": "قواعد الوقف",
        "description": "يغطي هذا الدرس قواعد الوقف في تلاوة القرآن الكريم. سيتعلم الطلاب أنواع الوقف المختلفة، بما في ذلك الوقف الجائز والممنوع، لتحسين تدفق التلاوة وضمان النطق الصحيح والمعنى السليم."
    },
    {
        "title": "رموز الوقف",
        "description": "في هذا الدرس، سيتعرف الطلاب على علامات الوقف المختلفة المستخدمة في القرآن، والتي تشير إلى أماكن التوقف أو الاستمرار في التلاوة. سيساعد فهم هذه العلامات المتعلمين على اتخاذ قرارات مستنيرة أثناء التلاوة."
    },
    {
        "title": "قواعد النون الساكنة والتنوين",
        "description": "تركز هذه الدرسة على القواعد الخاصة بنطق حرف النون (ن) عند اتباعه بالسكون (نۡ) واستخدام التنوين. سيفهم المتعلمون كيف تؤثر هذه القواعد على تدفق التلاوة ونطق الأصوات."
    },
    {
        "title": "قواعد الميم الساكنة",
        "description": "في هذا الدرس، سيدرس المتعلمون القواعد المتعلقة بحرف الميم (م) عندما يظهر بالسكون (مۡ). يركز الدرس على النطق الصحيح وتأثيره على دقة التلاوة."
    },
    {
        "title": "قواعد همزة الوصل",
        "description": "في هذا الدرس، سيتعلم الطلاب القواعد المتعلقة بحرف الألف (ٱ) من حيث النطق وكيفية تفاعله مع الأحرف الأخرى. سيساعد فهم هذه القواعد على تحسين دقة التلاوة."
    },
    {
        "title": "المد الفرعي",
        "description": "يغطي هذا الدرس المد الفرعي، أو المد الثانوي، الذي يحدث في ظل ظروف معينة. سيستكشف المتعلمون الأنواع المختلفة من المد الفرعي وكيفية التعرف عليها وتطبيقها أثناء التلاوة."
    },
    {
        "title": "تقنيات الإدغام المحسّنة",
        "description": "في هذا الدرس، سيتعمق الطلاب في قواعد الإدغام المتقدم، التي تشمل دمج حروف معينة. ستساعد هذه الدراسة المتقدمة المتعلمين على تحسين طلاقتهم ودقتهم في تلاوة القرآن الكريم."
    }
]