[
    {
        "title": "Təbii Madd",
        "description": "Bu dərs Madd Asli və ya təbii uzatma üzərində cəmlənir, hansı ki, müəyyən hərflərlə baş verir və təcvid qaydalarına görə düzgün tələffüzün əsasını təşkil edir. Öyrənənlər Madd Asli-nin nə zaman və necə tətbiq olunacağını öyrənəcək, bu da onların Quranı səlis oxuma qabiliyyətini artıracaq."
    },
    {
        "title": "Uzadılmış Madd",
        "description": "Bu dərsdə tələbələr çox uzun Madd anlayışını araşdıracaqlar, bu da sait səsinin daha uzun müddət uzadılmasını nəzərdə tutur. Kurs, bu texnikanın tətbiqi ilə bağlı qaydaları əhatə edəcək və bu qabaqcıl texnikanı mənimsəməyə kömək edəcək praktiki məşqlər təqdim edəcək."
    },
    {
        "title": "Dayanma Qaydaları",
        "description": "Bu dərs Quran tilavətindəki vəqf (dayanma) qaydalarını əhatə edir. Öyrənənlər, oxunuş axıcılığını artırmaq və düzgün tələffüz və mənanı təmin etmək üçün icazəli və qadağan olunan dayanma növlərini öyrənəcəklər."
    },
    {
        "title": "Waqf Simvolları",
        "description": "Bu dərsdə tələbələr Quran tilavətində harada dayanmaq və harada davam etmək lazım olduğunu göstərən müxtəlif vəqf işarələri ilə tanış olacaqlar. Bu işarələri anlamaq öyrənənlərə tilavət zamanı düşünülmüş qərarlar verməyə kömək edəcək."
    },
    {
        "title": "Noon Saakin və Tanvin Qaydaları",
        "description": "Bu dərs ن (nun) hərfinin, ona Sukoon (نۡ) və ya Tanvin gəldikdə, düzgün tələffüzü ilə bağlı qaydaları öyrədir. Öyrənənlər bu qaydaların oxunuşun axıcılığına və səslərin tələffüzünə necə təsir etdiyini başa düşəcəklər."
    },
    {
        "title": "Meem Saakin Qaydaları",
        "description": "Bu dərsdə öyrənənlər م (mim) hərfi ilə bağlı qaydaları, xüsusən də onun Sukoon (مۡ) ilə müşayiət olunduğu halları öyrənəcəklər. Dərs düzgün tələffüzə və oxunuş dəqiqliyinə təsirini vurğulayır."
    },
    {
        "title": "Hamzatul Wasl Qaydaları",
        "description": "Bu dərsdə tələbələr ٱ (əlif) hərfinin tələffüzü və digər hərflərlə necə əlaqədə olduğu qaydalarını öyrənəcəklər. Bu qaydaları anlamaq tilavət dəqiqliyini artırmağa kömək edəcək."
    },
    {
        "title": "Törəmə Madd",
        "description": "Bu dərs Madd Far'i və ya ikinci dərəcəli uzatmanı əhatə edir, hansı ki, xüsusi şərtlər altında baş verir. Öyrənənlər Madd Far'i-nin müxtəlif növlərini araşdıracaq və tilavətlərində bunları necə tanıyıb tətbiq edəcəklərini öyrənəcəklər."
    },
    {
        "title": "İdğam Texnikaları",
        "description": "Bu dərsdə tələbələr müəyyən hərflərin birləşdirilməsi ilə bağlı irəli səviyyə İdxam qaydalarını öyrənəcəklər. Bu irəli səviyyəli təhsil tələbələrə Quran tilavətində səlislik və dəqiqliklərini artırmağa kömək edəcək."
    }
]