[
    {
        "title": "প্রাকৃতিক মাদ্দ",
        "description": "এই পাঠটি মাদ আসলি বা প্রাকৃতিক প্রসারণের উপর কেন্দ্রীভূত, যা নির্দিষ্ট বর্ণের সঙ্গে ঘটে এবং তাজবীদের নিয়ম অনুসারে সঠিক উচ্চারণের জন্য মৌলিক। শিক্ষার্থীরা শিখবে কখন এবং কীভাবে মাদ আসলি প্রয়োগ করতে হবে, যা তাদের কুরআন তিলাওয়াতের প্রবাহকে উন্নত করবে।"
    },
    {
        "title": "বর্ধিত মাদ্দ",
        "description": "এই পাঠে শিক্ষার্থীরা খুব দীর্ঘ মাদ ধারণাটি অন্বেষণ করবে, যা স্বরবর্ণের শব্দকে দীর্ঘ সময়ের জন্য প্রসারিত করে। পাঠ্যক্রমটি এর প্রয়োগ সম্পর্কিত নিয়মগুলি কভার করবে এবং শিক্ষার্থীদের এই উন্নত কৌশল আয়ত্ত করতে সহায়তা করার জন্য অনুশীলনের সুযোগ দেবে।"
    },
    {
        "title": "থামার নিয়মাবলি",
        "description": "এই পাঠটি কুরআন তিলাওয়াতের সময় ওয়াকফ (থামা) এর নিয়ম কভার করে। শিক্ষার্থীরা বিভিন্ন ধরনের থামার নিয়ম সম্পর্কে শিখবে, যার মধ্যে রয়েছে অনুমোদিত এবং নিষিদ্ধ বিরতি, যাতে তিলাওয়াতের প্রবাহ উন্নত হয় এবং সঠিক উচ্চারণ ও অর্থ নিশ্চিত করা যায়।"
    },
    {
        "title": "ওয়াকফ চিহ্নসমূহ",
        "description": "এই পাঠে শিক্ষার্থীরা কুরআনে ব্যবহৃত বিভিন্ন ওয়াকফ চিহ্ন সম্পর্কে শিখবে, যা কোথায় থামতে হবে এবং কোথায় চালিয়ে যেতে হবে তা নির্দেশ করে। এই চিহ্নগুলি বোঝা শিক্ষার্থীদের তিলাওয়াতের সময় সচেতন সিদ্ধান্ত নিতে সহায়তা করবে।"
    },
    {
        "title": "নূন সাকিন ও তানভীন-এর নিয়মাবলি",
        "description": "এই পাঠটি নূন (ن) বর্ণের উচ্চারণের নির্দিষ্ট নিয়মগুলির উপর দৃষ্টি নিবদ্ধ করে যখন এটি সাকিন (نۡ) দ্বারা অনুসরণ করা হয় অথবা তন্মীন ব্যবহার করা হয়। শিক্ষার্থীরা শিখবে কীভাবে এই নিয়মগুলি তিলাওয়াতের প্রবাহ এবং শব্দের উচ্চারণকে প্রভাবিত করে।"
    },
    {
        "title": "মীম সাকিন-এর নিয়মাবলি",
        "description": "এই পাঠে শিক্ষার্থীরা মীম (م) বর্ণের সঙ্গে সংশ্লিষ্ট নিয়মগুলি অধ্যয়ন করবে যখন এটি সাকিন (مۡ) এর সাথে উপস্থিত হয়। পাঠটি সঠিক উচ্চারণ এবং তিলাওয়াতের যথার্থতার উপর এর প্রভাবের উপর আলোকপাত করবে।"
    },
    {
        "title": "হামজাতুল ওয়াসলের নিয়মাবলি",
        "description": "এই পাঠে শিক্ষার্থীরা আলিফ (ٱ) বর্ণের উচ্চারণ এবং এটি অন্য বর্ণের সাথে কীভাবে মিথস্ক্রিয়া করে তা শিখবে। এই নিয়মগুলি বোঝা তিলাওয়াতের সঠিকতা উন্নত করতে সহায়ক হবে।"
    },
    {
        "title": "ফারই মাদ্দ",
        "description": "এই পাঠটি মাদ ফার'ই বা গৌণ প্রসারণ নিয়ে আলোচনা করে, যা নির্দিষ্ট শর্তে ঘটে। শিক্ষার্থীরা মাদ ফার'ই-এর বিভিন্ন প্রকার অন্বেষণ করবে এবং কীভাবে এগুলি চিনতে এবং তিলাওয়াতে প্রয়োগ করতে হয় তা শিখবে।"
    },
    {
        "title": "উন্নত ইদগাম কৌশলসমূহ",
        "description": "এই পাঠে শিক্ষার্থীরা নির্দিষ্ট বর্ণগুলির উন্নত ইদগাম নিয়ম সম্পর্কে অধ্যয়ন করবে, যা কিছু বর্ণকে একত্রিত করে। এই উন্নত অধ্যয়ন শিক্ষার্থীদের কুরআন তিলাওয়াতের সুনির্দিষ্টতা এবং প্রবাহ বৃদ্ধি করতে সহায়তা করবে।"
    }
]