[
    {
        "title": "Natural Madd",
        "description": "This lesson focuses on Madd Asli, or natural prolongation, which occurs with specific letters and is fundamental to proper pronunciation in Tajweed. Learners will understand when and how to apply Madd Asli, enhancing their fluency in reciting the Quran."
    },
    {
        "title": "Extended Madd",
        "description": "In this lesson, students will explore the concept of the very long Madd, which extends the vowel sound for an extended duration. The course will cover the rules governing its usage and provide practice exercises to help learners master this advanced technique."
    },
    {
        "title": "Stopping Rules",
        "description": "This lesson covers the rules of stopping (waqf) in Quranic recitation. Learners will study the different types of stops, including permissible and prohibited pauses, to enhance their recitation flow and ensure correct pronunciation and meaning."
    },
    {
        "title": "Waqf Symbols",
        "description": "In this lesson, students will learn about the various Waqf signs used in the Quran to indicate where to stop and where to continue reciting. Understanding these signs will help learners make informed decisions during their recitation."
    },
    {
        "title": "Rules for Noon Saakin and Tanween",
        "description": "This lesson focuses on the specific rules regarding the pronunciation of the letter ن (noon) when followed by a Sukoon (نۡ) and the use of Tanween. Learners will grasp how these rules affect the flow of recitation and the articulation of sounds."
    },
    {
        "title": "Rules for Meem Saakin",
        "description": "In this lesson, learners will study the rules related to the letter م (meem) when it appears with a Sukoon (مۡ). The focus will be on proper articulation and its impact on recitation accuracy."
    },
    {
        "title": "Rules for Hamzatul Wasl",
        "description": "In this lesson, students will learn the rules regarding the letter ٱ (alif) in terms of its pronunciation and how it interacts with other letters. Understanding these rules will help enhance the accuracy of recitation."
    },
    {
        "title": "Derived Madd",
        "description": "This lesson covers Madd Far'i, or secondary prolongation, which occurs under specific conditions. Learners will explore the different types of Madd Far'i and how to recognize and apply them in their recitation."
    },
    {
        "title": "Enhanced Idghaam Techniques",
        "description": "In this lesson, students will delve into advanced Idghaam rules, which involve the merging of certain letters. This advanced study will help learners improve their fluency and accuracy in Quranic recitation."
    }
]