[
    {
        "title": "Madd Naturel",
        "description": "Cette leçon se concentre sur le Madd Asli, ou prolongation naturelle, qui se produit avec des lettres spécifiques et est fondamentale pour une prononciation correcte dans le Tajweed. Les apprenants comprendront quand et comment appliquer le Madd Asli, améliorant ainsi leur fluidité dans la récitation du Coran."
    },
    {
        "title": "Madd Allongé",
        "description": "Dans cette leçon, les élèves exploreront le concept du Madd très long, qui étend le son des voyelles sur une durée prolongée. Le cours couvrira les règles régissant son utilisation et proposera des exercices pratiques pour aider les apprenants à maîtriser cette technique avancée."
    },
    {
        "title": "Règles d’Arrêt",
        "description": "Cette leçon couvre les règles de l’arrêt (waqf) dans la récitation coranique. Les apprenants étudieront les différents types d’arrêts, y compris les pauses permises et interdites, pour améliorer le flux de leur récitation et garantir une prononciation et un sens corrects."
    },
    {
        "title": "Symboles de Waqf",
        "description": "Dans cette leçon, les étudiants apprendront les différents signes de waqf utilisés dans le Coran pour indiquer où s’arrêter et où continuer la récitation. Comprendre ces signes aidera les apprenants à prendre des décisions éclairées lors de leur récitation."
    },
    {
        "title": "Règles pour Noon Saakin et Tanween",
        "description": "Cette leçon se concentre sur les règles spécifiques concernant la prononciation de la lettre ن (noon) lorsqu’elle est suivie d’un Sukoon (نۡ) et l’utilisation du Tanween. Les apprenants saisiront comment ces règles influencent le flux de la récitation et l’articulation des sons."
    },
    {
        "title": "Règles pour Meem Saakin",
        "description": "Dans cette leçon, les apprenants étudieront les règles relatives à la lettre م (meem) lorsqu’elle apparaît avec un Sukoon (مۡ). L’accent sera mis sur une articulation correcte et son impact sur la précision de la récitation."
    },
    {
        "title": "Règles pour Hamzatul Wasl",
        "description": "Dans cette leçon, les étudiants apprendront les règles relatives à la lettre ٱ (alif) en termes de prononciation et comment elle interagit avec d’autres lettres. Comprendre ces règles contribuera à améliorer la précision de la récitation."
    },
    {
        "title": "Madd Dérivé",
        "description": "Cette leçon traite du Madd Far’i, ou prolongation secondaire, qui se produit dans des conditions spécifiques. Les apprenants exploreront les différents types de Madd Far’i et apprendront à les reconnaître et à les appliquer dans leur récitation."
    },
    {
        "title": "Techniques Avancées d’Idghaam",
        "description": "Dans cette leçon, les étudiants approfondiront les règles avancées de l’Idghaam, qui impliquent la fusion de certaines lettres. Cette étude avancée aidera les apprenants à améliorer leur fluidité et leur précision dans la récitation du Coran."
    }
]