[
    {
        "title": "प्राकृतिक मद्ध",
        "description": "यह पाठ मद असली या प्राकृतिक विस्तार पर केंद्रित है, जो विशिष्ट अक्षरों के साथ होता है और तजवीद में सही उच्चारण के लिए बुनियादी है। सीखने वाले यह समझेंगे कि मद असली को कब और कैसे लागू करना है, जिससे उनकी कुरान की तिलावत में प्रवाह बेहतर होगा।"
    },
    {
        "title": "विस्तारित मद्ध",
        "description": "इस पाठ में, छात्र बहुत लंबा मद की अवधारणा का अध्ययन करेंगे, जो स्वर ध्वनि को एक विस्तारित अवधि तक खींचता है। पाठ में इसके उपयोग को नियंत्रित करने वाले नियमों को कवर किया जाएगा और छात्रों को इस उन्नत तकनीक को समझने और अभ्यास करने में मदद मिलेगी।"
    },
    {
        "title": "रुकने के नियम",
        "description": "यह पाठ कुरान की तिलावत में वक़्फ (रुकने) के नियमों को शामिल करता है। विद्यार्थी विभिन्न प्रकार के रुकावों, जैसे अनुमत और निषिद्ध ठहराव, का अध्ययन करेंगे ताकि उनकी तिलावत प्रवाह में सुधार हो और सही उच्चारण और अर्थ सुनिश्चित हो सके।"
    },
    {
        "title": "वक्फ़ के प्रतीक",
        "description": "इस पाठ में, छात्र कुरान में उपयोग किए गए विभिन्न वक़्फ संकेतों के बारे में जानेंगे जो यह संकेत देते हैं कि कहां रुकना है और कहां तिलावत जारी रखनी है। इन संकेतों को समझने से छात्रों को तिलावत के दौरान सूचित निर्णय लेने में मदद मिलेगी।"
    },
    {
        "title": "नून साकिन और तनवीन के नियम",
        "description": "यह पाठ अक्षर न (ن) की उच्चारण संबंधी विशिष्ट नियमों पर केंद्रित है, जब इसे सुकून (نۡ) द्वारा अनुसरण किया जाता है या तन्वीन का उपयोग किया जाता है। छात्र समझेंगे कि ये नियम तिलावत के प्रवाह और ध्वनियों के उच्चारण को कैसे प्रभावित करते हैं।"
    },
    {
        "title": "मीन साकिन के नियम",
        "description": "इस पाठ में, छात्र अक्षर म (م) से संबंधित नियमों का अध्ययन करेंगे, जब यह सुकून (مۡ) के साथ आता है। पाठ सही उच्चारण और तिलावत की सटीकता पर इसके प्रभाव पर जोर देता है।"
    },
    {
        "title": "हमज़ातुल वसल के नियम",
        "description": "इस पाठ में, छात्र अक्षर अलिफ (ٱ) की उच्चारण संबंधी नियमों और अन्य अक्षरों के साथ इसके संबंध को समझेंगे। इन नियमों को समझने से तिलावत की सटीकता में सुधार होगा।"
    },
    {
        "title": "उत्पन्न मद्ध",
        "description": "यह पाठ मद फ़र'ई या द्वितीयक विस्तार को कवर करता है, जो विशिष्ट परिस्थितियों में होता है। विद्यार्थी मद फ़र'ई के विभिन्न प्रकारों का अध्ययन करेंगे और अपनी तिलावत में उन्हें पहचानने और लागू करने का तरीका सीखेंगे।"
    },
    {
        "title": "संवर्धित इद्गाम तकनीकें",
        "description": "इस पाठ में, छात्र उन्नत इदग़ाम नियमों का अध्ययन करेंगे, जिसमें कुछ अक्षरों का मेल शामिल है। यह उन्नत अध्ययन छात्रों को कुरान की तिलावत में प्रवाह और सटीकता बढ़ाने में मदद करेगा।"
    }
]