[
    {
        "title": "Madd Alami",
        "description": "Pelajaran ini berfokus pada Madd Asli, atau pemanjangan alami, yang terjadi pada huruf-huruf tertentu dan merupakan dasar untuk pelafalan yang benar dalam Tajwid. Peserta didik akan memahami kapan dan bagaimana menerapkan Madd Asli, sehingga meningkatkan kelancaran mereka dalam membaca Al-Quran."
    },
    {
        "title": "Madd Panjang",
        "description": "Dalam pelajaran ini, siswa akan mempelajari konsep Madd yang sangat panjang, yang memperpanjang bunyi vokal untuk durasi yang lebih lama. Kursus ini akan membahas aturan yang mengatur penggunaannya dan menyediakan latihan untuk membantu siswa menguasai teknik tingkat lanjut ini."
    },
    {
        "title": "Aturan Berhenti",
        "description": "Pelajaran ini mencakup aturan berhenti (waqf) dalam membaca Al-Quran. Peserta didik akan mempelajari berbagai jenis waqf, termasuk jeda yang diperbolehkan dan yang dilarang, untuk meningkatkan aliran bacaan mereka dan memastikan pelafalan serta pemahaman yang benar."
    },
    {
        "title": "Simbol Waqf",
        "description": "Dalam pelajaran ini, siswa akan mempelajari berbagai tanda waqf yang digunakan dalam Al-Quran untuk menunjukkan di mana harus berhenti dan melanjutkan bacaan. Memahami tanda-tanda ini akan membantu siswa membuat keputusan yang tepat selama membaca."
    },
    {
        "title": "Aturan untuk Nun Sakin dan Tanwin",
        "description": "Pelajaran ini berfokus pada aturan khusus terkait pelafalan huruf ن (nun) saat diikuti oleh sukun (نۡ) dan penggunaan tanwin. Peserta didik akan memahami bagaimana aturan ini memengaruhi aliran bacaan dan artikulasi bunyi."
    },
    {
        "title": "Aturan untuk Mim Sakin",
        "description": "Dalam pelajaran ini, peserta didik akan mempelajari aturan terkait huruf م (mim) saat muncul dengan sukun (مۡ). Fokusnya adalah pada artikulasi yang benar dan dampaknya terhadap ketepatan membaca."
    },
    {
        "title": "Aturan untuk Hamzatul Wasl",
        "description": "Pelajaran ini akan membahas aturan yang terkait dengan huruf ٱ (alif) dalam hal pelafalan dan bagaimana huruf tersebut berinteraksi dengan huruf lainnya. Memahami aturan ini akan membantu meningkatkan ketepatan bacaan."
    },
    {
        "title": "Madd Turunan",
        "description": "Pelajaran ini mencakup Madd Far'i, atau pemanjangan sekunder, yang terjadi dalam kondisi tertentu. Peserta didik akan mempelajari berbagai jenis Madd Far'i dan bagaimana mengenali serta menerapkannya dalam bacaan mereka."
    },
    {
        "title": "Teknik Idghaam Tingkat Lanjut",
        "description": "Dalam pelajaran ini, siswa akan mempelajari aturan Idgham tingkat lanjut, yang melibatkan penggabungan huruf tertentu. Studi tingkat lanjut ini akan membantu siswa meningkatkan kelancaran dan ketepatan mereka dalam membaca Al-Quran."
    }
]