[
    {
        "title": "Табиғи мадд",
        "description": "Бұл сабақ Мадд Асли, немесе табиғи ұзарту ережесіне бағытталған, ол белгілі бір әріптермен кездеседі және Тәжуидте дұрыс дыбыстаудың негізі болып табылады. Оқушылар Мадд Аслиді қашан және қалай қолдану керектігін түсініп, Құран оқу шеберлігін жақсартады."
    },
    {
        "title": "Ұзартылған мадд",
        "description": "Бұл сабақта оқушылар Өте ұзақ мадд концепциясын зерттейді, ол дауысты дыбысты ұзақ уақытқа созуға мүмкіндік береді. Курста оның қолдану ережелері түсіндіріледі және оқушыларға осы жетілдірілген техниканы игеруге көмектесетін тәжірибелік жаттығулар ұсынылады."
    },
    {
        "title": "Тоқтау ережелері",
        "description": "Бұл сабақта уақф (тоқтау) ережелері қамтылады. Оқушылар Құран оқуында рұқсат етілген және тыйым салынған тоқтаулардың түрлерін зерттеп, оқу қарқынын жақсартуды, дұрыс дыбыстау мен мағынаны түсінуді қамтамасыз етеді."
    },
    {
        "title": "Тоқтау ережелері",
        "description": "Бұл сабақта оқушылар Құранда қолданылатын уақф белгілерін үйренеді, олар тоқтау немесе оқуды жалғастыру нүктелерін көрсетеді. Осы белгілерді түсіну оқушыларға оқу барысында дұрыс шешім қабылдауға көмектеседі."
    },
    {
        "title": "Нун сакин және тануин ережелері",
        "description": "Бұл сабақта нун (ن) әрпінің, оның соңынан сұкун (نۡ) келгенде және тануин қолданылғандағы нақты ережелері түсіндіріледі. Оқушылар бұл ережелердің оқу қарқыны мен дыбыстардың айтылуына қалай әсер ететінін түсінеді."
    },
    {
        "title": "Мим сакин ережелері",
        "description": "Бұл сабақта оқушылар мим (م) әрпіне қатысты ережелерді зерттейді, ол сұкун (مۡ) белгісімен келгенде. Назар аударылатын басты мәселе — дұрыс дыбыстау және оның оқудың дәлдігіне әсері."
    },
    {
        "title": "Хамзатуль уасль ережелері",
        "description": "Бұл сабақта оқушылар әлиф (ٱ) әрпіне қатысты ережелерді және оның басқа әріптермен қалай әрекеттесетінін үйренеді. Осы ережелерді түсіну оқудың дәлдігін арттыруға көмектеседі."
    },
    {
        "title": "Туынды мадд",
        "description": "Бұл сабақ Мадд Фар'и, немесе екінші дәрежелі ұзарту туралы, ол белгілі бір жағдайларда пайда болады. Оқушылар Мадд Фар'идің әртүрлі түрлерін зерттеп, оны оқу кезінде тану және қолдану әдістерін үйренеді."
    },
    {
        "title": "Идғамның жетілдірілген әдістері",
        "description": "Бұл сабақта оқушылар күрделі идғам ережелерін, белгілі бір әріптердің бірігуін қамтитын ережелерді үйренеді. Бұл терең зерттеу оқушыларға Құран оқу қарқыны мен дәлдігін жақсартуға көмектеседі."
    }
]