[
    {
        "title": "Madd Semula Jadi",
        "description": "Pelajaran ini memfokuskan pada Madd Asli, atau pemanjangan semula jadi, yang berlaku pada huruf-huruf tertentu dan menjadi asas kepada sebutan yang betul dalam Tajwid. Pelajar akan memahami bila dan bagaimana untuk menerapkan Madd Asli, meningkatkan kelancaran mereka dalam membaca al-Quran."
    },
    {
        "title": "Madd Lanjutan",
        "description": "Dalam pelajaran ini, pelajar akan meneroka konsep Madd yang Sangat Panjang, yang memanjangkan bunyi vokal untuk tempoh masa yang lebih lama. Kursus ini akan merangkumi peraturan yang mengawal penggunaannya dan menyediakan latihan praktikal untuk membantu pelajar menguasai teknik lanjutan ini."
    },
    {
        "title": "Peraturan Berhenti",
        "description": "Pelajaran ini merangkumi peraturan berhenti (waqf) dalam bacaan al-Quran. Pelajar akan mempelajari pelbagai jenis waqf, termasuk jeda yang dibenarkan dan dilarang, untuk meningkatkan aliran bacaan mereka dan memastikan sebutan serta maksud yang betul."
    },
    {
        "title": "Simbol Waqf",
        "description": "Dalam pelajaran ini, pelajar akan mempelajari pelbagai tanda waqf yang digunakan dalam al-Quran untuk menunjukkan di mana harus berhenti dan di mana harus meneruskan bacaan. Memahami tanda-tanda ini akan membantu pelajar membuat keputusan yang tepat semasa membaca."
    },
    {
        "title": "Peraturan untuk Nun Sakin dan Tanwin",
        "description": "Pelajaran ini memfokuskan pada peraturan tertentu berkaitan sebutan huruf ن (nun) apabila diikuti oleh Sukun (نۡ) dan penggunaan Tanwin. Pelajar akan memahami bagaimana peraturan ini mempengaruhi aliran bacaan dan artikulasi bunyi."
    },
    {
        "title": "Peraturan untuk Mim Sakin",
        "description": "Dalam pelajaran ini, pelajar akan mempelajari peraturan berkaitan huruf م (mim) apabila ia muncul dengan Sukun (مۡ). Fokusnya adalah pada artikulasi yang betul dan kesannya terhadap ketepatan bacaan."
    },
    {
        "title": "Peraturan untuk Hamzatul Wasl",
        "description": "Dalam pelajaran ini, pelajar akan mempelajari peraturan berkaitan huruf ٱ (alif) dari segi sebutannya dan bagaimana ia berinteraksi dengan huruf lain. Memahami peraturan ini akan membantu meningkatkan ketepatan bacaan."
    },
    {
        "title": "Madd Terbitan",
        "description": "Pelajaran ini merangkumi Madd Far'i, atau pemanjangan sekunder, yang berlaku dalam keadaan tertentu. Pelajar akan meneroka pelbagai jenis Madd Far'i dan bagaimana untuk mengenal pasti serta menerapkannya dalam bacaan mereka."
    },
    {
        "title": "Teknik Idghaam Dipertingkatkan",
        "description": "Dalam pelajaran ini, pelajar akan mendalami peraturan Idgham lanjutan, yang melibatkan penggabungan huruf-huruf tertentu. Kajian lanjutan ini akan membantu pelajar meningkatkan kelancaran dan ketepatan mereka dalam bacaan al-Quran."
    }
]