[
    {
        "title": "Естественный мадд",
        "description": "Этот урок посвящен Мадд Асли, или естественному удлинению, которое возникает с определенными буквами и является основой правильного произношения в таджвиде. Ученики узнают, когда и как применять Мадд Асли, что улучшит их беглость в чтении Корана."
    },
    {
        "title": "Удлинённый мадд",
        "description": "На этом уроке студенты изучат концепцию очень длинного мадда, который удлиняет звук гласной на более длительное время. Курс охватывает правила его применения и включает практические упражнения, чтобы помочь учащимся освоить эту продвинутую технику."
    },
    {
        "title": "Правила остановки",
        "description": "Этот урок включает в себя изучение правил остановки (ваقف) при чтении Корана. Ученики изучат различные виды пауз, включая допустимые и запрещенные, чтобы улучшить плавность чтения и обеспечить правильное произношение и понимание смысла."
    },
    {
        "title": "Символы вакфа",
        "description": "На этом уроке студенты узнают о различных знаках ваqфа, используемых в Коране для указания на то, где следует остановиться или продолжить чтение. Понимание этих знаков поможет учащимся принимать правильные решения во время чтения."
    },
    {
        "title": "Правила для Нун Сакин и Танвина",
        "description": "Этот урок посвящен конкретным правилам произношения буквы ن (нун), когда за ней следует сукун (نۡ), и использования танвина. Ученики поймут, как эти правила влияют на плавность чтения и артикуляцию звуков."
    },
    {
        "title": "Правила для Мим Сакин",
        "description": "На этом уроке учащиеся изучат правила, связанные с буквой م (мим), когда она появляется с сукуном (مۡ). Основное внимание будет уделено правильной артикуляции и её влиянию на точность чтения."
    },
    {
        "title": "Правила для Хамзатуль Васль",
        "description": "На этом уроке студенты узнают правила, связанные с буквой ٱ (алиф), её произношением и взаимодействием с другими буквами. Понимание этих правил поможет улучшить точность чтения."
    },
    {
        "title": "Производный мадд",
        "description": "Этот урок охватывает Мадд Фар'и, или вторичное удлинение, которое возникает в определенных условиях. Ученики изучат различные виды Мадд Фар'и и узнают, как распознавать и применять их в чтении."
    },
    {
        "title": "Усовершенствованные техники Идгама",
        "description": "На этом уроке студенты углубятся в расширенные правила идгама, которые включают слияние определенных букв. Это углубленное изучение поможет учащимся улучшить беглость и точность в чтении Корана."
    }
]