[
    {
        "title": "இயற்கை மத்",
        "description": "இந்த பாடம் மத் அஸ்லி அல்லது இயல்பான நீட்டிப்பு பற்றியது, இது குறிப்பிட்ட எழுத்துக்களில் ஏற்படுகிறது மற்றும் தஜ்வீதில் சரியான உச்சரிப்புக்கான அடிப்படை அம்சமாகும். மாணவர்கள் மத் அஸ்லியை எப்போது மற்றும் எவ்வாறு பயன்படுத்த வேண்டும் என்பதைப் புரிந்து கொள்வார்கள், இதன் மூலம் அவர்கள் குர்ஆனைப் பயிற்சிப்பதில் தேர்ச்சியை மேம்படுத்திக் கொள்வார்கள்."
    },
    {
        "title": "நீண்ட மத்",
        "description": "இந்த பாடத்தில், மாணவர்கள் மிக நீண்ட மத் என்ற கருத்தை ஆராய்வார்கள், இது மெய்யெழுத்தின் ஒலியை நீண்ட காலத்திற்கு நீட்டிக்கிறது. இந்த பாடத்திட்டம் இதன் பயன்பாட்டுக்கான விதிகளை உள்ளடக்கியது மற்றும் மாணவர்கள் இந்த மேம்பட்ட முறையை முழுமையாக கற்றுக்கொள்வதற்கு பயிற்சிப் பயிற்சிகளை வழங்குகிறது."
    },
    {
        "title": "நிறுத்தல் விதிகள்",
        "description": "இந்த பாடம் குர்ஆன் ஓதுவதில் நிறுத்தல் விதிகளைக் (வக்ஃப்) குறிப்பிடுகிறது. மாணவர்கள் விதிமுறைகளைப் பற்றி கற்றுக்கொள்வார்கள், அதில் அனுமதிக்கப்பட்ட மற்றும் தடைசெய்யப்பட்ட நிறுத்தங்களும் அடங்கும், இது அவர்களின் ஓதல் பாணியை மேம்படுத்தவும், சரியான உச்சரிப்பு மற்றும் பொருள் தரவும் உதவுகிறது."
    },
    {
        "title": "வக்ப் அடையாளங்கள்",
        "description": "இந்த பாடத்தில், குர்ஆனில் பயன்படுத்தப்படும் வக்ஃப் அடையாளங்களின் பல்வேறு வகைகள் பற்றியும், எங்கு நிறுத்த வேண்டும், எங்கு தொடர வேண்டும் என்பதை குறிப்பிடுகிறது. இந்த அடையாளங்களைப் புரிந்து கொள்வதால், மாணவர்கள் ஓதுவதில் சரியான முடிவுகளை எடுக்க உதவுகிறது."
    },
    {
        "title": "நூன் சாகின் மற்றும் தன்வீனுக்கான விதிகள்",
        "description": "இந்த பாடம் நூன் (ن) என்ற எழுத்தின் உச்சரிப்பு விதிகளின் மீதான கவனத்தைத் திருப்புகிறது, இது சுகூன் (نۡ) அல்லது தன்வீன் வந்தால் பயன்படுத்தப்படுகிறது. மாணவர்கள் இந்த விதிகள் எவ்வாறு ஓதலின் ஓட்டத்தையும் ஒலியின் உச்சரிப்பையும் பாதிக்கின்றன என்பதைப் புரிந்து கொள்வார்கள்."
    },
    {
        "title": "மீம் சாகின் விதிகள்",
        "description": "இந்த பாடத்தில், மாணவர்கள் மீம் (م) என்ற எழுத்தின் விதிகளைப் பற்றிக் கற்றுக்கொள்வார்கள், இது சுகூன் (مۡ) என்ற குறியீட்டுடன் காணப்படும். சரியான உச்சரிப்பு மற்றும் ஓதலின் துல்லியத்தினை மேம்படுத்துவதற்கான முக்கியத்துவத்தைக் கொண்டுள்ளது."
    },
    {
        "title": "ஹம்சதுல் வசல் விதிகள்",
        "description": "இந்த பாடத்தில், மாணவர்கள் அலிஃப் (ٱ) எழுத்தின் உச்சரிப்பு மற்றும் மற்ற எழுத்துக்களுடன் இணைந்து செயல்படும் விதம் பற்றிக் கற்றுக்கொள்வார்கள். இந்த விதிகளைப் புரிந்துகொள்வது ஓதலின் துல்லியத்தை மேம்படுத்த உதவும்."
    },
    {
        "title": "தொகைமத்",
        "description": "இந்த பாடம் மத் ஃபர்இ அல்லது இரண்டாம் நிலை நீட்டிப்பு பற்றியது, இது குறிப்பிட்ட சூழ்நிலைகளில் ஏற்படுகிறது. மாணவர்கள் மத் ஃபர்இயின் பல்வேறு வகைகளை ஆராய்ந்து, அதனை எப்படி அடையாளம் காண வேண்டும் மற்றும் அதை சரியாகப் பயன்படுத்த வேண்டும் என்பதைக் கற்றுக்கொள்வார்கள்."
    },
    {
        "title": "மேம்பட்ட இட்காம் தொழில்நுட்பங்கள்",
        "description": "இந்த பாடத்தில், மாணவர்கள் மேம்பட்ட இத்ஃகாம் விதிகளை (Idghaam rules) கற்றுக்கொள்வார்கள், இது சில எழுத்துக்களின் இணைப்பை உள்ளடக்குகிறது. இந்த மேம்பட்ட படிப்பு குர்ஆன் ஓதுவதில் துல்லியத்தையும் ஒழுங்கையும் மேம்படுத்த உதவுகிறது."
    }
]