[
    {
        "title": "طبیعی مد",
        "description": "یہ سبق مد اصلی یعنی قدرتی لمبائی پر مرکوز ہے، جو مخصوص حروف کے ساتھ ہوتی ہے اور تجوید میں درست تلفظ کی بنیاد ہے۔ طلباء یہ سمجھیں گے کہ مد اصلی کو کب اور کیسے لاگو کرنا ہے، جس سے قرآن کی روانی میں بہتری آئے گی۔"
    },
    {
        "title": "طویل مد",
        "description": "اس سبق میں، طلباء بہت طویل مد کے تصور کا مطالعہ کریں گے، جو آواز کو طویل مدت تک بڑھاتا ہے۔ یہ کورس اس کے استعمال کے اصولوں کا احاطہ کرے گا اور اس جدید تکنیک کو سیکھنے کے لئے عملی مشق فراہم کرے گا۔"
    },
    {
        "title": "وقف کے قواعد",
        "description": "یہ سبق قرآن کی تلاوت میں وقف کے قواعد پر توجہ مرکوز کرتا ہے۔ طلباء مختلف اقسام کے وقفوں، بشمول جائز اور ممنوع وقفوں کا مطالعہ کریں گے، تاکہ ان کی تلاوت کا بہاؤ بہتر ہو اور درست معنی اور تلفظ یقینی بنایا جا سکے۔"
    },
    {
        "title": "وقف کی علامات",
        "description": "اس سبق میں، طلباء قرآن میں استعمال ہونے والے مختلف وقف کے نشانات کے بارے میں جانیں گے، جو ظاہر کرتے ہیں کہ کہاں رکنا ہے اور کہاں جاری رکھنا ہے۔ ان نشانات کو سمجھنا طلباء کو تلاوت کے دوران بہتر فیصلے کرنے میں مدد دے گا۔"
    },
    {
        "title": "نون ساکن اور تنوین کے قواعد",
        "description": "یہ سبق ن (نون) کے تلفظ سے متعلق مخصوص قواعد پر توجہ مرکوز کرتا ہے جب اس کے بعد سکون (نۡ) ہو اور تنوین کا استعمال کیا جائے۔ طلباء یہ سمجھیں گے کہ یہ قواعد تلاوت کی روانی اور آوازوں کی ادائیگی کو کیسے متاثر کرتے ہیں۔"
    },
    {
        "title": "میم ساکن کے قواعد",
        "description": "اس سبق میں، طلباء م (میم) کے حروف سے متعلق قواعد کا مطالعہ کریں گے جب یہ سکون (مۡ) کے ساتھ ظاہر ہوتا ہے۔ صحیح ادائیگی اور تلاوت کی درستگی پر اس کے اثرات پر توجہ دی جائے گی۔"
    },
    {
        "title": "ہمزۃ الوصل کے قواعد",
        "description": "اس سبق میں، طلباء ٱ (الف) کے حروف کے تلفظ سے متعلق قواعد اور دیگر حروف کے ساتھ اس کے تعامل کو سیکھیں گے۔ ان قواعد کو سمجھنے سے تلاوت کی درستگی کو بہتر بنانے میں مدد ملے گی۔"
    },
    {
        "title": "فرعی مد",
        "description": "یہ سبق مد فرعی یا ثانوی لمبائی پر توجہ دیتا ہے، جو مخصوص حالات میں ہوتا ہے۔ طلباء مد فرعی کی مختلف اقسام کو دریافت کریں گے اور اپنی تلاوت میں انہیں پہچاننے اور لاگو کرنے کا طریقہ سیکھیں گے۔"
    },
    {
        "title": "جدید ادغام تکنیکیں",
        "description": "اس سبق میں، طلباء ادغام کے جدید اصولوں کا مطالعہ کریں گے، جو مخصوص حروف کے انضمام پر مشتمل ہیں۔ یہ جدید مطالعہ طلباء کو قرآن کی تلاوت میں روانی اور درستگی کو بہتر بنانے میں مدد فراہم کرے گا۔"
    }
]